{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_dance_moves", 
    "words": [
        {
            "def": "Ball change is a dance move that consists of two steps: or a partial weight transfer on the ball of a foot behind or by the other foot, followed by a step on the other foot. This action has a syncopated feeling and counted &1, or &2, or a1, or a2, etc., i.e., the \"ball\" step splits off the end of a beat. It is used, e.g., in the kick ball change.", 
            "link": null, 
            "name": "Ball change"
        }, 
        {
            "def": "Same as Basic movement", 
            "link": null, 
            "name": "Basic figure"
        }, 
        {
            "def": "Basic movement is the very basic step that defines the character of a dance. Often it is called just thus: \"Basic Movement\" or \"Basic Step\". For some dances it is sufficient to know the basic step performed in different handholds and dance positions to enjoy it socially.", 
            "link": null, 
            "name": "Basic movement"
        }, 
        {
            "def": "Same as Basic movement.", 
            "link": null, 
            "name": "Basic step"
        }, 
        {
            "def": "Box Step is a dance figure named so because the steps rest in the four corners of a square. It is used, e.g., in American Style ballroom dances: Rumba bronze-level Foxtrot. The leader begins with the left foot and proceeds as follows.", 
            "link": null, 
            "name": "Box step"
        }, 
        {
            "def": "See Glossary of ballet terms#Chaînés.", 
            "link": null, 
            "name": "Chaines / Chainé turns / Chaines turns"
        }, 
        {
            "def": "Chasse is a dance step with a triple step pattern used in many forms of dance. It is a gliding, flowing step with the feet essentially following a step together step pattern. Timing and length of steps vary from dance to dance.", 
            "link": null, 
            "name": "Chasse"
        }, 
        {
            "def": "Closed Change is a basic step in the Waltz. The man steps forward on either foot whilst the lady steps backward on the opposing foot (e.g.: the man steps forward on his right foot whilst the lady steps back on her left). They will then step to the side on the other foot, and conclude the figure by closing the first foot beside the second (hence the name \"closed\" of the step). Each step takes up a full beat of the music.", 
            "link": null, 
            "name": "Closed change"
        }, 
        {
            "def": "Cross-body lead is a common and useful move in Latin dances such as Salsa, Mambo, Rumba and Cha-cha-cha. Basically, the man on counts 2 and 3 of his basic step (assuming dancing on 1) does a quarter-left turn (90° counterclockwise) while still holding on to the woman. On counts 4 and 5, he leads the woman forward across him, i.e., firmly leads her with his right hand on her back, so that she travels across and turns around and faces the opposite direction she was facing. At the same time, the man does another quarter-left turn as necessary in order to follow the woman and face her. At the end of the move, the dancers have their positions exchanged.", 
            "link": null, 
            "name": "Cross-body lead"
        }, 
        {
            "def": "Dosado is a circular movement where two people, who are initially facing each other, walk around each other without or almost without turning, i.e., facing in the same direction (same wall) all the time.", 
            "link": null, 
            "name": "Dos-a-dos, Dosado"
        }, 
        {
            "def": "This is a dance movement common in salsa, where the two dance partners facing each other change positions. The dance partners keep contact with one or two hands while stepping to rotate concentrically over 180 degrees around the same point in opposite directions.", 
            "link": null, 
            "name": "Enchufla"
        }, 
        {
            "def": "The Feather is a basic figure in International Style Foxtrot, in which the man makes three or four steps basically forward, with the third one (right foot) done outside the lady.", 
            "link": null, 
            "name": "Feather step"
        }, 
        {
            "def": "A general term to describe a spin without any handhold (freestyle and No set landing position)", 
            "link": null, 
            "name": "Free spin"
        }, 
        {
            "def": "\"Gancho\" means \"hook\" in Spanish and describes certain \"hooking actions\" in some dances of Latin American heritage, in Argentine Tango (leg action) and Salsa (arm action and foot action) in particular.", 
            "link": null, 
            "name": "Gancho"
        }, 
        {
            "def": "See Grapevine (dance move).", 
            "link": null, 
            "name": "Grapevine"
        }, 
        {
            "def": "A ballroom dance move, which is the turn on the heel of the support foot while the other foot is held close and parallel to the support one. At the end of the turn the weight is transferred from one foot to another.[1]", 
            "link": null, 
            "name": "Heel turn"
        }, 
        {
            "def": "A variant of the #Heel turn, in which the feet are kept apart.[1]", 
            "link": null, 
            "name": "Heel pull"
        }, 
        {
            "def": "A step taken forward into the space occupied by the partner, while the partner steps backwards. During this step feet tracks of both partners overlap. See also #Outside partner step.", 
            "link": null, 
            "name": "Inside partner step"
        }, 
        {
            "def": "The term is applied to an individual turn of a partner in the couple. Basically, it denotes a turn where the arm of the partner doing the turn begins by moving towards the \"inside\" of the couple (the line running from the center of one partner to the center of the other). The meaning is intuitively clear, but it may be performed in numerous ways and in different handholds, so that even accomplished dancers are confused. In dances such as swing and salsa, inside and outside turns most commonly refer to underarm turns done by the follower. Since in these dances the follower's right arm is normally used to lead a turn (most commonly by the leader's left arm, but sometimes by the leader's right arm when a cross-hand or \"handshake\" position is used), an inside turn is normally a left (counter-clockwise) turn, while an outside turn is a right (clockwise) turn. However, if the follower's left arm is used to initiate the turn, the intended direction of turning may be opposite. (Alternatively, the non-ambiguous terms \"left turn\" and \"right turn\" may be used.)", 
            "link": null, 
            "name": "Inside turn"
        }, 
        {
            "def": "A Lock step is an alternative variation of a chasse action which occurs when the moving foot swings to a stop across the track of the standing foot rather than closing next to it. In the Latin dances the combination of the crossed position and the turnout of the feet means that the rear toe will be pointed at the heel of the other foot, while in the Standard dances the lack of turnout means the feet will be parallel. In Standard the basic locking action is usually preceded and followed by a left side lead. The Latin lock step is often featured when Cha-cha is danced in Open position with a one-hand hold.", 
            "link": null, 
            "name": "Lock Step"
        }, 
        {
            "def": "The Moonwalk is a dance technique that presents the illusion of the dancer being pulled backwards while attempting to walk forward.", 
            "link": null, 
            "name": "Moonwalk"
        }, 
        {
            "def": "Natural turns and some other figures are those in which the dance couple rotates to the right (clockwise).", 
            "link": null, 
            "name": "Natural turn"
        }, 
        {
            "def": "A ballroom dance figure in which during the last step the moving foot passes the support foot, rather than closes to it.[1]", 
            "link": null, 
            "name": "Open turn"
        }, 
        {
            "def": "A step taken with the partner beside the moving foot (e.g., to the left of the left moving foot). During this step feet tracks of both partners do not overlap. See also #Inside partner step.", 
            "link": null, 
            "name": "Outside partner step"
        }, 
        {
            "def": "Cf. Inside turn.", 
            "link": null, 
            "name": "Outside turn"
        }, 
        {
            "def": "Reverse turns and some other figures are those in which the dance couple rotates to the left (counterclockwise).", 
            "link": null, 
            "name": "Reverse turn"
        }, 
        {
            "def": "See Ballet glossary#Rond de jambe. A toe of the straight leg draws a semicircle on the floor. In ballroom dances the direction is usually from the front to back.", 
            "link": null, 
            "name": "Rond"
        }, 
        {
            "def": "The Thunder Clap is a form of dance that incorporates clapping in the air with a sliding motion. To perform this dance one must raise one hand and then with the second hand meet the first one half way making a clapping sound; that hand must then fully extend. This motion is repeated to the beat of the music.", 
            "link": null, 
            "name": "Thunder clap"
        }, 
        {
            "def": "The Walk is probably the most basic dance move. It exists in almost every dance. Walks approximately correspond normal walking steps, taking into the account the basic technique of the dance in question. (For example, in Latin dance walks the toe hits the floor first, rather than the heel.)", 
            "link": null, 
            "name": "Walk"
        }
    ]
}