{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_astronomy", 
    "words": [
        {
            "def": "Absolute magnitude is a measure of a star's absolute brightness. It is defined as the apparent magnitude the star would show if it were located at a distance of 10 parsecs, or 32.6 light years.", 
            "link": "/wiki/Absolute_magnitude", 
            "name": "Absolute magnitude"
        }, 
        {
            "def": "Accretion disk is a roughly circular mass of diffuse material in orbit around a central object, such as a star or black hole. The material has been acquired from a source external to the central object.", 
            "link": "/wiki/Accretion_disk", 
            "name": "Accretion disk"
        }, 
        {
            "def": "Albedo feature is a large area on the surface of a reflecting object that shows a contrast in brightness or darkness (albedo) with adjacent areas.", 
            "link": "/wiki/Albedo_feature", 
            "name": "Albedo feature"
        }, 
        {
            "def": "Am star is a chemically peculiar star belonging to the more general class of A-type stars. The spectrum of the Am stars shows abnormal enhancements and deficiencies of certain metals. (See metallicity below.)", 
            "link": "/wiki/Am_star", 
            "name": "Am star"
        }, 
        {
            "def": "Apoapsis is the point of furthest excursion, or separation, between two orbiting objects.", 
            "link": "/wiki/Apoapsis", 
            "name": "Apoapsis"
        }, 
        {
            "def": "Apparent magnitude is a measure of the brightness of a celestial body as seen by an observer on Earth, adjusted to the value it would have in the absence of the atmosphere. The brighter the object appears, the lower the value of its magnitude.", 
            "link": "/wiki/Apparent_magnitude", 
            "name": "Apparent magnitude"
        }, 
        {
            "def": "Appulse is the closest approach of one celestial object to another, as viewed from a third body.", 
            "link": "/wiki/Appulse", 
            "name": "Appulse"
        }, 
        {
            "def": "Asterism is a pattern of stars recognized on Earth's night sky. It may form part of an official constellation, or be composed of stars from more than one.", 
            "link": "/wiki/Asterism_(astronomy)", 
            "name": "Asterism"
        }, 
        {
            "def": "Astrometric binary is a type of binary system where evidence for an unseen orbiting companion is revealed by its periodic gravitational perturbation of the visible component. See also spectroscopic binary.", 
            "link": "/wiki/Astrometric_binary", 
            "name": "Astrometric binary"
        }, 
        {
            "def": "Astronomical unit, or AU, is the approximate distance between the midpoints of the Earth and the Sun.", 
            "link": "/wiki/Astronomical_unit", 
            "name": "Astronomical unit"
        }, 
        {
            "def": "Autumnal equinox is the point in the year when the Sun appears to cross the celestial equator, while generally trending southward at each zenith passage. It represents the moment when the North Pole of the Earth begins to tilt away from the Sun.", 
            "link": "/wiki/Autumnal_equinox", 
            "name": "Autumnal equinox"
        }, 
        {
            "def": "Azimuth is an angular measurement of an object's orientation along the horizon of the observer, relative to the direction of true north. When combined with the altitude above the horizon, it defines an object's current position in the spherical coordinate system.", 
            "link": "/wiki/Azimuth", 
            "name": "Azimuth"
        }, 
        {
            "def": "Black hole is a concentration of mass so compact that it creates a region of space from which not even light can escape. The outer boundary of this region is called the event horizon.", 
            "link": "/wiki/Black_hole", 
            "name": "Black hole"
        }, 
        {
            "def": "Brown dwarf is a substellar object that is too low in mass to sustain the nuclear fusion of hydrogen-1 in its core, which is a characteristic of stars on the main sequence. Brown dwarfs can still generate energy from gravitational contraction and by the fusion of deuterium.", 
            "link": "/wiki/Brown_dwarf", 
            "name": "Brown dwarf"
        }, 
        {
            "def": "Celestial sphere is an imaginary sphere that covers the entire sky and is stationary with respect to the background stars. It is used as a tool for spherical astronomy.", 
            "link": "/wiki/Celestial_sphere", 
            "name": "Celestial sphere"
        }, 
        {
            "def": "Chromospheric activity index is a parameter indicating the magnetic activity in a star's chromosphere. One measure of this activity is log R′HK, where R′HK is the ratio of the equivalent width of a star's singly-ionized Calcium H and K lines, after correction for photospheric light, to the bolometric flux.[1]", 
            "link": null, 
            "name": "Chromospheric activity index"
        }, 
        {
            "def": "Color index is a numeric value that is used to compare the brightness of a star measured from different frequency bands of the electromagnetic spectrum. Because the energy output of a star varies by frequency as a function of temperature, the color index can be used to indicate the star's temperature.", 
            "link": "/wiki/Color_index", 
            "name": "Color index"
        }, 
        {
            "def": "Comets are relatively small, icy bodies that display extended features when they approach the Sun. The energy from the Sun vaporizes volatiles on a comet's surface, producing a visible coma around the cometary body. Sometimes a comet can produce a long tail radiating away from the Sun.", 
            "link": "/wiki/Comet", 
            "name": "Comets"
        }, 
        {
            "def": "Commensurability is the property of two objects orbiting the same body whose periods are in a rational proportion. For example, the orbital period of Saturn around the Sun is very nearly 5/2 the orbital period of Jupiter.", 
            "link": "/wiki/Commensurability_(astronomy)", 
            "name": "Commensurability"
        }, 
        {
            "def": "Common proper motion is used to indicate two or more stars that share the same motion through space, within the margin of observational error. That is, they have nearly the same proper motion and radial velocity parameters. This may suggest that they are gravitationally bound or share a common origin.[2]", 
            "link": null, 
            "name": "Common proper motion"
        }, 
        {
            "def": "Constellation is a region on the celestial sphere surrounding a grouping of stars. The names of constellations are assigned by tradition and often have an associated folklore based in mythology, while the modern demarcation of their borders are established by the International Astronomical Union in 1930.", 
            "link": "/wiki/Constellation", 
            "name": "Constellation"
        }, 
        {
            "def": "Declination, in the equatorial coordinate system, is the celestial equivalent of terrestrial latitude. Coordinates north of the celestial equator are measured in positive degrees from 0° to 90°, while coordinates to the south use coordinates in negative degrees.", 
            "link": "/wiki/Declination", 
            "name": "Declination"
        }, 
        {
            "def": "Decretion disk is a circumstellar disk formed from gas ejected from the central star that now follows a near Keplerian orbit around it. This type of disk can be found around many Be stars.[3]", 
            "link": null, 
            "name": "Decretion disk"
        }, 
        {
            "def": "Double star is a pair of stars that appear near each other on the celestial sphere. This can happen because, by chance, the pair lie along nearly the same line of sight from the Earth. If the two are located in physical proximity to each other, they may form a co-moving pair or a binary star system.", 
            "link": "/wiki/Double_star", 
            "name": "Double star"
        }, 
        {
            "def": "Dwarf star is the category of ordinary main sequence stars like the Sun, in contrast to evolved giant stars like Betelgeuse and Antares. Confusingly, the term dwarf has also came to include stellar remnants known as white dwarfs plus low mass, sub-stellar objects called brown dwarfs.", 
            "link": "/wiki/Dwarf_star", 
            "name": "Dwarf star"
        }, 
        {
            "def": "Early-type star is a hotter and more massive star, in contrast to late-type stars that are cooler and less massive. The term originated from historical stellar models that assumed stars began their early life at a high temperature then gradually cooled off as they aged. It can be used to refer to the higher temperature members of any particular population or category of stars, rather than just all stars in general.", 
            "link": "/wiki/Early-type_star", 
            "name": "Early-type star"
        }, 
        {
            "def": "Eccentricity is a parameter that determines how much an orbit deviates from a perfect circle. For an elliptical orbit, the eccentricity ranges from greater than zero to less than one.", 
            "link": "/wiki/Orbital_eccentricity", 
            "name": "Eccentricity"
        }, 
        {
            "def": "Ecliptic plane, or plane of the ecliptic, is the plane defined by the Earth's orbit around the Sun. Hence, the position of the Sun as viewed from Earth defines the intersection of this plane with the celestial sphere. The ecliptic plane is used as a reference plane for describing the position of other Solar System bodies. It differs from the celestial equator because of the axial tilt of the Earth.", 
            "link": "/wiki/Ecliptic_plane", 
            "name": "Ecliptic plane"
        }, 
        {
            "def": "Effective temperature of a star or planet is the temperature of an ideal black body that would emit the same total amount of electromagnetic radiation.", 
            "link": "/wiki/Effective_temperature", 
            "name": "Effective temperature"
        }, 
        {
            "def": "Evolutionary track is a curve on the Hertzsprung–Russell diagram that a solitary star, of a particular mass and composition, is expected to follow during the course of its evolution. This curve predicts the combination of temperature and luminosity that a star will have during part or all of its lifetime.[4]", 
            "link": "/wiki/Evolutionary_track", 
            "name": "Evolutionary track"
        }, 
        {
            "def": "Extinction is the absorption and scattering of electromagnetic radiation by matter (dust and gas) between an emitting astronomical object and the observer. Atmospheric extinction varies by the wavelength of the radiation, with the attenuation being greater for blue light than for red.", 
            "link": "/wiki/Extinction_(astronomy)", 
            "name": "Extinction"
        }, 
        {
            "def": "A field galaxy is a galaxy that does not belong to a larger cluster of galaxies, but is gravitationally alone.", 
            "link": "/wiki/Field_galaxy", 
            "name": "field galaxy"
        }, 
        {
            "def": "A field star is a randomly situated star that lies along the line of sight to a group of physically associated stars under study, such as a star cluster. These field stars can contaminate the results for a study and so they need to be identified.", 
            "link": null, 
            "name": "field star"
        }, 
        {
            "def": "Galactic tide is the tidal force experienced by objects subject to the gravitational field of a galaxy such as the Milky Way.", 
            "link": "/wiki/Galactic_tide", 
            "name": "Galactic tide"
        }, 
        {
            "def": "Geometric albedo is the ratio of the brightness of an astronomical body at a phase angle of zero to an idealized flat, fully reflecting, diffusively scattering (Lambertian) disk with the same cross-section. It is a measure of how much of the incoming illumination is being scattered back toward an observer and has a value between zero and one.", 
            "link": "/wiki/Geometric_albedo", 
            "name": "Geometric albedo"
        }, 
        {
            "def": "H II region is a luminous region of space that is emitting the spectrum of ionized hydrogen. It is generated by an interstellar cloud near a source of ultraviolet energy, such as hot, massive stars. Typically H II regions are found among areas of star formation in spiral galaxies.", 
            "link": "/wiki/H_II_region", 
            "name": "H II region"
        }, 
        {
            "def": "Inferior planet is an archaic term that is sometimes used to refer to the planets Mercury and Venus. The name originated from the fact that they orbit closer to the Sun than the Earth and hence, in the geocentric cosmology of Ptolemy, both appeared to travel with the Sun across the sky. This is in contrast to so-called superior planets, such as Mars, that appeared to move independently of the Sun.", 
            "link": "/wiki/Inferior_planet", 
            "name": "Inferior planet"
        }, 
        {
            "def": "Interstellar medium is the matter that exists in the space between the stars in a galaxy. This medium mainly consists of hydrogen and helium, but it is enhanced by traces of other elements contributed by matter expelled from stars.", 
            "link": "/wiki/Interstellar_medium", 
            "name": "Interstellar medium"
        }, 
        {
            "def": "Interstellar reddening is an effect produced by the incremental absorption and scattering of electromagnetic energy from interstellar matter, an effect known as extinction. This effect causes the more distant objects such as stars to appear redder and dimmer than expected. It is not to be confused with the separate phenomenon of red shift.", 
            "link": "/wiki/Interstellar_reddening", 
            "name": "Interstellar reddening"
        }, 
        {
            "def": "Isochrones are curves on the Hertzsprung-Russell diagram that represent the evolutionary positions of stars having the same age but differing masses. This is in contrast to an evolutionary track, which is a plot of stars having the same mass but differing ages. In fact, multiple evolutionary tracks can be used to build isochrones by putting curves through equal-age points along the tracks. When the mass of a star can be determined, an isochrone can be used to estimate the star's age.", 
            "link": "/wiki/Tautochrone_curve", 
            "name": "Isochrones"
        }, 
        {
            "def": "Jeans instability is a physical state in which an interstellar cloud of gas will begin to undergo collapse and form stars. A cloud can become unstable against collapse when it cools sufficiently or has perturbations of density, allowing gravity to overcome the gas pressure.", 
            "link": "/wiki/Jeans_instability", 
            "name": "Jeans instability"
        }, 
        {
            "def": "Magnetosphere is a mostly convex region formed when a plasma, such as the solar wind, interacts with the magnetic field of a body, such as a planet or star.", 
            "link": "/wiki/Magnetosphere", 
            "name": "Magnetosphere"
        }, 
        {
            "def": "Main sequence is a category of stars that form a continuous and distinctive band on plots of stellar temperature versus brightness. These stars are characterized by being in hydrostatic equilibrium and undergoing nuclear fusion of hydrogen-1 in their core region. For example, the Sun is a main sequence star.", 
            "link": "/wiki/Main_sequence", 
            "name": "Main sequence"
        }, 
        {
            "def": "Meteor is the ionization trail produced by a meteroid as it enters the Earth's atmosphere.", 
            "link": "/wiki/Meteor", 
            "name": "Meteor"
        }, 
        {
            "def": "Meteoroid is a small rock or boulder that has entered a planetary atmosphere. If it survives to reach the ground, it is then termed a meteorite.", 
            "link": "/wiki/Meteoroid", 
            "name": "Meteoroid"
        }, 
        {
            "def": "Meteor shower is a series of meteors that seemingly radiate from a point on the night sky. These are produced by debris left over from a larger body, such as a comet, and hence they follow roughly the same orbit. This makes many meteor showers predictable events as they reoccur every year.", 
            "link": "/wiki/Meteor_shower", 
            "name": "Meteor shower"
        }, 
        {
            "def": "Metallicity is the abundance of elements other than hydrogen and helium. Note that these 'metals' include elements that are not typically considered metallic.", 
            "link": "/wiki/Metallicity", 
            "name": "Metallicity"
        }, 
        {
            "def": "Minor planet is an object in direct orbit around the Sun that is neither a dominant planet nor originally classified as a comet. A moon is not a minor planet because it is orbiting another body.", 
            "link": "/wiki/Minor_planet", 
            "name": "Minor planet"
        }, 
        {
            "def": "Molecular clouds are interstellar clouds where the conditions allow molecules to form, including molecular hydrogen.", 
            "link": "/wiki/Molecular_cloud", 
            "name": "Molecular clouds"
        }, 
        {
            "def": "Morning width or rise width is the horizontal angular distance between the rise azimuth of a celestial body and the East direction.", 
            "link": "/wiki/Morning_width", 
            "name": "Morning width"
        }, 
        {
            "def": "Moving group or stellar association is a loose grouping of stars that are traveling together through space. Although the members were formed together in the same molecular cloud, they have since moved too far apart to be gravitationally bound as a cluster.", 
            "link": "/wiki/Moving_group", 
            "name": "Moving group"
        }, 
        {
            "def": "Nebula refers to a region of indistinct nebulosity. In modern terms, it means an interstellar cloud of dust, hydrogen, helium and other ionized gases. Historically, it was also used to refer to extended sources of luminosity that could not be resolved into their individual components, such as star cluster and galaxies.", 
            "link": "/wiki/Nebula", 
            "name": "Nebula"
        }, 
        {
            "def": "Neutron star is a type of stellar remnant that is composed almost entirely of neutrons, which is a type of subatomic particle with no electrical charge. Typically, a neutron star has a mass between 1.35 and about 2.0 times the mass of the Sun, but with a radius of only 12 km (7.5 mi).", 
            "link": "/wiki/Neutron_star", 
            "name": "Neutron star"
        }, 
        {
            "def": "Number density is the quantity of some specified particle or object class per unit volume. For atoms, molecules or subatomic particles, the volume is typically in cm−3 or m−3. With stars, cubic parsecs (pc−3) are often used.", 
            "link": "/wiki/Number_density", 
            "name": "Number density"
        }, 
        {
            "def": "OB association is a group of massive stars that are not gravitationally bound to each other, but move together through space in a loose association. The OB in the name is a reference to stars of stellar classification O and B.", 
            "link": "/wiki/OB_association", 
            "name": "OB association"
        }, 
        {
            "def": "Opacity is a measure of the resistance of a medium to the radiative transmission of energy. Within a star, it is an importance factor in determining whether convection occurs.", 
            "link": "/wiki/Opacity_(optics)", 
            "name": "Opacity"
        }, 
        {
            "def": "Open cluster is a gravitationally-bound group of up to a thousand stars that formed together in the same molecular cloud.", 
            "link": "/wiki/Open_cluster", 
            "name": "Open cluster"
        }, 
        {
            "def": "Opposition occurs when two celestial objects are on opposite sides of the sky. This occurs, for example, when a planet makes its closest approach to the Earth, placing it in opposition to the Sun.", 
            "link": "/wiki/Opposition_(planets)", 
            "name": "Opposition"
        }, 
        {
            "def": "Orbital elements are parameters that uniquely define an orbit.", 
            "link": "/wiki/Orbital_elements", 
            "name": "Orbital elements"
        }, 
        {
            "def": "Parsec is a portmanteau of the words parallax and second. This is the distance at which a star would show a parallax shift of exactly one arcsecond as observed from Earth's orbit. It is equal to 3.2616 light years or 206,265 Astronomical Units.", 
            "link": "/wiki/Parsec", 
            "name": "Parsec"
        }, 
        {
            "def": "Periapsis is the point of closest approach between two orbiting objects.", 
            "link": "/wiki/Periapsis", 
            "name": "Periapsis"
        }, 
        {
            "def": "Phase angle is the elongation or angle between an orbiting body and the Sun as viewed from a particular perspective such as the Earth. It determines the amount of a planet or moon's visible surface that lies in shadow. Inferior planets such as Venus generally have a low phase angle as seen from Earth, so they are often viewed as a crescent. Superior planets such as Mars and Jupiter usually have a high phase angle, so little of the shadowed side is visible.", 
            "link": "/wiki/Phase_angle_(astronomy)", 
            "name": "Phase angle"
        }, 
        {
            "def": "Planetary differentiation is the process of separating out different constituents of a planetary body, causing it to develop compositionally distinct layers (such as a metallic core).", 
            "link": "/wiki/Planetary_differentiation", 
            "name": "Planetary differentiation"
        }, 
        {
            "def": "Precession can refer to a slow change in the orientation of an object's axis of rotation. For the Earth, this is referred to as the precession of the equinoxes. Apsidal precession means a steady change in the orientation of an orbit, such as the precession in the orbit of Mercury that was explained by the theory of general relativity.", 
            "link": "/wiki/Precession_(astronomy)", 
            "name": "Precession"
        }, 
        {
            "def": "Projected separation is the minimum physical separation of two astronomical objects, as determined from their angular separation and estimated distance.[5] For planets and double stars, this distance is usually given in Astronomical Units. The actual separation of the two objects depends on the angle of the line between the two objects to the line-of-sight of the observer.", 
            "link": null, 
            "name": "Projected separation"
        }, 
        {
            "def": "Proper motion is the rate of angular motion of an object over an interval of time, usually years. For stars, this is typically given in milliarcseconds per year.", 
            "link": "/wiki/Proper_motion", 
            "name": "Proper motion"
        }, 
        {
            "def": "Protostar is a concentration of mass formed out of the contraction of a collapsing interstellar cloud. Once sufficient mass has fallen onto this central core, it becomes a pre-main-sequence star.", 
            "link": "/wiki/Protostar", 
            "name": "Protostar"
        }, 
        {
            "def": "Radial velocity is the velocity of an object along the line of sight to the observer. Positive values are used to indicate a receding object. An object such as a star can undergo changes in its radial velocity because of the gravitational perturbation of another body, or because of radial pulsations of its surface. The latter, for example, occurs with a Beta Cephei variable star.", 
            "link": "/wiki/Radial_velocity", 
            "name": "Radial velocity"
        }, 
        {
            "def": "Right ascension, in the equatorial coordinate system, is the celestial equivalent of terrestrial longitude. It divides the celestial equator into 24 hours, each of 60 minutes.", 
            "link": "/wiki/Right_ascension", 
            "name": "Right ascension"
        }, 
        {
            "def": "Roche limit is the distance from an astronomical object where the tidal force matches an orbiting body's gravitational self-attraction. Inside this limit, the tidal forces will cause the orbiting body to disintegrate, usually to disperse and form a ring. Outside this limit, loose material will tend to coalesce.", 
            "link": "/wiki/Roche_limit", 
            "name": "Roche limit"
        }, 
        {
            "def": "Rosseland optical depth (τR) is an extinction coefficient of an atmosphere, which describes the net opacity to radiation at a given depth. See optical depth.[6]", 
            "link": "/wiki/Rosseland_mean_opacity", 
            "name": "Rosseland optical depth"
        }, 
        {
            "def": "Semi-major axis is half the maximum length of an ellipse. It is used to give a physical dimension to a two-body Keplerian orbit, such as for a binary star system. However, when the distance to the system is unknown, the semi-major axis may be given as an angle.", 
            "link": "/wiki/Semi-major_axis", 
            "name": "Semi-major axis"
        }, 
        {
            "def": "Spectroscopic binary is a type of binary star system where the individual components have not been resolved with a telescope. Instead, the evidence for the binarity comes from shifts observed in the spectrum. This is caused by the Doppler effect as the radial velocity of the components change over the course of each orbit.", 
            "link": "/wiki/Spectroscopic_binary", 
            "name": "Spectroscopic binary"
        }, 
        {
            "def": "Starfield or star field refers to a set of stars visible in an arbitrarily-sized field of view of a telescope, usually in the context of some region of interest within the celestial sphere.", 
            "link": "/wiki/Starfield_(astronomy)", 
            "name": "Starfield"
        }, 
        {
            "def": "Stellar atmosphere, or stellar envelope, is the outermost region of a star. Although it forms only a small portion of the star's mass, for some evolved stars the stellar envelope can form a significant fraction of the radius.", 
            "link": "/wiki/Stellar_atmosphere", 
            "name": "Stellar atmosphere"
        }, 
        {
            "def": "Stellar classification is the categorization of stars based upon their spectrum. The modern MK spectral classification scheme is a two-dimensional classification based on temperature and luminosity.", 
            "link": "/wiki/Stellar_classification", 
            "name": "Stellar classification"
        }, 
        {
            "def": "Superior planet is an archaic term that is sometimes used to refer to planets that orbit further from the Sun than the Earth, such as Saturn. The name originated from geocentric cosmology of Ptolemy.", 
            "link": "/wiki/Superior_planet", 
            "name": "Superior planet"
        }, 
        {
            "def": "Synodic period is the time taken for a given object to make one complete orbit about another object, as calculated respect to the background stars.", 
            "link": "/wiki/Synodic_period", 
            "name": "Synodic period"
        }, 
        {
            "def": "Telluric stars have nearly featureless continuum spectra that can be used to correct for the effect of telluric contamination of the Earth's atmosphere on the spectra of other stars. For example, water vapor in the atmosphere creates significant telluric absorption bands at wavelengths above 6800 Å. These features need to be corrected for in order to reach a more accurate spectrum.", 
            "link": null, 
            "name": "Telluric stars"
        }, 
        {
            "def": "Thin disk population refers to the layer of the Milky Way galaxy where the spiral arms are found and where most of the star formation takes place. It is about 300–400 parsecs (980–1,300 light-years) deep and centered on the galactic plane. Stars belonging to this population generally follow orbits that lie close to this plane.[7] This is in contrast to members of the thick disk population and halo stars.", 
            "link": null, 
            "name": "Thin disk population"
        }, 
        {
            "def": "Tidal braking or tidal acceleration is the transfer of momentum between an astronomical body and an orbiting satellite as the result of tidal forces. This can cause changes in the rotation periods for both bodies as well as modification of their mutual orbit. A satellite in a prograde orbit will gradually recede from the primary body, while slowing the rotation rate of both bodies.", 
            "link": null, 
            "name": "Tidal braking"
        }, 
        {
            "def": "Tidal locking is a net result of continued tidal braking wherein the satellite orbits with the same face always pointed toward its primary. The Moon is tidally locked with the Earth.", 
            "link": "/wiki/Tidal_locking", 
            "name": "Tidal locking"
        }, 
        {
            "def": "Tidal stream refers to the streams of stars and gas that are stripped from gas clouds and star clusters because of interaction with the gravitational field of a galaxy such as the Milky Way.[8]", 
            "link": null, 
            "name": "Tidal stream"
        }, 
        {
            "def": "Tilt erosion is the gradual reduction of the obliquity of an orbiting satellite due to tidal interactions.[9]", 
            "link": null, 
            "name": "Tilt erosion"
        }, 
        {
            "def": "Transit is an astronomical event where an object passes across the face of a much larger body. An example of this event is the transit of Venus across the face of the Sun in 2004. Because a transit results in a decrease in the net luminosity from the two objects, the transit method is used to detect extrasolar planets as they pass in front of their host stars. Transits by objects that appear roughly the same size or larger than the body they are transiting are called occultations.", 
            "link": "/wiki/Astronomical_transit", 
            "name": "Transit"
        }, 
        {
            "def": "Vernal equinox is the point in the year when the Sun appears to cross the celestial equator, while generally trending northward at each zenith passage. It represents the moment when the North Pole of the Earth begins to tilt toward the Sun.", 
            "link": "/wiki/Vernal_equinox", 
            "name": "Vernal equinox"
        }, 
        {
            "def": "Weak-line star is a reference to the faintness of the spectral lines for a star compared to standard stars with the same stellar classification. Since most absorption lines are caused by elements other than hydrogen and helium—what astronomers refer to as \"metals\"—these are sometimes called metal weak stars.[10]", 
            "link": null, 
            "name": "Weak-line star"
        }, 
        {
            "def": "White dwarf is a type of stellar remnant composed mostly of electron-degenerate matter. A white dwarf lacks the mass needed to continue the nuclear fusion process with its constituent atoms, so the object's energy output normally comes from radiative cooling. (But see nova and Type Ia supernova.)", 
            "link": "/wiki/White_dwarf", 
            "name": "White dwarf"
        }, 
        {
            "def": "Zenith is the point on the sky that is directly overhead, from the perspective of a particular location on the Earth.", 
            "link": "/wiki/Zenith", 
            "name": "Zenith"
        }
    ]
}