{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_North_American_railway_terms", 
    "words": [
        {
            "def": "The protection given by a locomotive engineer to an employee working near, between, or under cars to which the locomotive is coupled, via a three-step process:\n\nFully apply independent brake.\nSet reverser to neutral.\nTurn off generator field (or notify the ground employee, depending on company-specific rules and locomotive type, that protection is provided).[1][2]\n\n", 
            "link": null, 
            "name": "3-step protection (US)"
        }, 
        {
            "def": "A steam locomotive with a 4-6-0 wheel arrangement[3]", 
            "link": null, 
            "name": "10 wheeler (US)"
        }, 
        {
            "def": "Procession of a train past a stop signal with verbal permission from the dispatcher.[4] Derives from Rule 241, which is used to grant such permission under certain rule sets.[5]", 
            "link": null, 
            "name": "241 (US)"
        }, 
        {
            "def": "A diesel locomotive (or more rarely an electric locomotive) equipped with a driving cab and a control system to control other locomotives in a multiple unit, and therefore able to be the lead unit in a consist of several locomotives controlled from a single position[6]", 
            "link": "/wiki/A_unit", 
            "name": "A unit (US)"
        }, 
        {
            "def": "A nickname for Canadian Pacific's EMD GP20C-ECO locomotives since their long, narrow noses resemble that of an Aardvark[citation needed]", 
            "link": null, 
            "name": "Aardvarks"
        }, 
        {
            "def": "A nickname for EMD's SD70ACe locomotive[7][8][9]", 
            "link": null, 
            "name": "ACe"
        }, 
        {
            "def": "\n\nA nickname for the DH643 diesel-hydraulic locomotive built by American Locomotive Company (ALCO)[citation needed]\nA nickname for railfans who are \"addicted\" to ALCO locomotives[citation needed]\n\n", 
            "link": null, 
            "name": "ALCOhaulic"
        }, 
        {
            "def": "ALCO RSD-15 locomotive, so named for its long, low nose[10][11][12]", 
            "link": null, 
            "name": "Alligator"
        }, 
        {
            "def": "An Amfleet passenger car—named because the car shape is a rounded stainless steel tube[13]", 
            "link": null, 
            "name": "Amcan"
        }, 
        {
            "def": "The second level seats on a cupola-style caboose[14][15]", 
            "link": null, 
            "name": "Angel seat (US)"
        }, 
        {
            "def": "A metal plate that joins the ends of rails in jointed track[16]", 
            "link": null, 
            "name": "Angle bar"
        }, 
        {
            "def": "Someone who only railfans indoors, usually using a radio scanner[citation needed]", 
            "link": null, 
            "name": "Armchair railfan"
        }, 
        {
            "def": "A small shelter that serves as a train station for Amtrak trains in a small town. Normally, there are no manned services offered at these small stations.[17]", 
            "link": null, 
            "name": "Amshack"
        }, 
        {
            "def": "An industry trade group representing primarily the major freight railroads of North America (Canada, Mexico and the United States)[18]", 
            "link": "/wiki/Association_of_American_Railroads", 
            "name": "Association of American Railroads (AAR)"
        }, 
        {
            "def": "An automatic tracking system using RFID technology[19][20]", 
            "link": "/wiki/Automatic_equipment_identification", 
            "name": "Automatic equipment identification (AEI) (US)"
        }, 
        {
            "def": "A passenger train service first operated by Auto-Train Corporation and then by Amtrak between Lorton, Virginia and Sanford, Florida that carries the passengers' automobiles aboard the same train in autoracks", 
            "link": "/wiki/Auto_Train_(Amtrak)", 
            "name": "Auto Train (US)"
        }, 
        {
            "def": "A specialized freight car for transporting automobiles[19][21]", 
            "link": "/wiki/Autorack", 
            "name": "Autorack or auto carrier (US)"
        }, 
        {
            "def": "GE B23-7, B30-7 or B36-7 locomotive. By analogy with U-boat, since with the Dash 7 line, the \"B\" or \"C\" moved to the beginning of the designation.[22]", 
            "link": null, 
            "name": "B-Boat"
        }, 
        {
            "def": "A cabless booster locomotive, controlled via multiple unit from a cab-equipped A unit, sometimes equipped with limited controls for hostling[12][23][24]", 
            "link": "/wiki/B_unit", 
            "name": "B unit"
        }, 
        {
            "def": "GE U18B locomotive[12]", 
            "link": null, 
            "name": "Baby Boat"
        }, 
        {
            "def": "EMD GP15-1 or GP15T locomotive, so-called because its low air intakes resemble those of the much larger SD40T-2 and SD45T-2[12]", 
            "link": null, 
            "name": "Baby Tunnel Motor"
        }, 
        {
            "def": "A nickname for Milwaukee Road engines after the railroad was sold to the Soo Line Railroad. The Soo covered up the Milwaukee Road name and logo on the orange locomotives with black paint, causing them to resemble bandits.[25] Also often applied to similarly patched, second-hand locomotives, especially if the patches are crudely applied.[26]", 
            "link": null, 
            "name": "Bandit"
        }, 
        {
            "def": "Empty flat, spine, or well cars[27][unreliable source?][28]", 
            "link": null, 
            "name": "Baretables"
        }, 
        {
            "def": "Taking a break from work to eat[29][30][31]", 
            "link": null, 
            "name": "Beans or Going to Beans"
        }, 
        {
            "def": "A nickname for Conrail due to the medium blue livery that their locomotives were painted[32][33]", 
            "link": null, 
            "name": "Big Blue"
        }, 
        {
            "def": "1. A nickname for Guilford Rail System, in reference to the large \"G\" emblem on their locomotives and boxcars[34]", 
            "link": null, 
            "name": "Big G"
        }, 
        {
            "def": "When a train suffers a loss of all brake air and stops or when the air brakes on the train are placed in emergency. It refers to the air ports in the automatic brake valve, the emergency portion being the biggest port or hole. (e.g. over the radio: \"We just big holed.\")[38][39][40]", 
            "link": null, 
            "name": "Big hole"
        }, 
        {
            "def": "A railroad crane[41][42]", 
            "link": null, 
            "name": "Big hook"
        }, 
        {
            "def": "A nickname given to EMD's DDA40X[citation needed]", 
            "link": null, 
            "name": "Big Jack"
        }, 
        {
            "def": "A nickname given to EMD's SD70MAC, SD80MAC, and SD90MAC locomotive models[43]", 
            "link": null, 
            "name": "Big Mac"
        }, 
        {
            "def": "A nickname given to GG1 #4877 because it was repainted into PRR Tuscan Red in 1981[citation needed]", 
            "link": null, 
            "name": "Big Red"
        }, 
        {
            "def": "Santa Fe locomotive in the pre-1972 blue and yellow scheme[12]", 
            "link": null, 
            "name": "Billboard"
        }, 
        {
            "def": "Southern Pacific locomotive (all black with some silver)[12]", 
            "link": null, 
            "name": "Black Widow"
        }, 
        {
            "def": "Southern Pacific locomotive (post-1959 gray and red paint scheme where the nose of the diesel locomotive was painted in scarlet red),[12] or Amtrak Phase I paint scheme: reddish-orange nose and then the Amtrak Chevron logo on the side of the engine.", 
            "link": null, 
            "name": "Bloody Nose"
        }, 
        {
            "def": "One of two Santa Fe paint schemes. The standard freight scheme from 1972 until the BNSF merger was dark blue with yellow on the front, with the same color division as the warbonnet scheme. It is also known as Yellowbonnet. Bluebonnet can also mean a warbonnet unit with only the red painted over, resulting in a silver and blue locomotive; this was used on passenger engines transferred to freight service after the formation of Amtrak.[12]", 
            "link": null, 
            "name": "Bluebonnet"
        }, 
        {
            "def": "A nickname given to the GE U34CH's because they were delivered in dark blue and silver NJDOT paint", 
            "link": null, 
            "name": "Bluebirds"
        }, 
        {
            "def": "A nickname given to the Reading Railroad's heavyweight MU cars, in reference to the bright blue and white paint scheme they wore in later years before being sold to SEPTA", 
            "link": null, 
            "name": "Blueliners"
        }, 
        {
            "def": "A transverse floating beam member of truck suspension system supporting the weight of vehicle body[44]", 
            "link": "/wiki/List_of_railroad_truck_parts#Truck_bolster", 
            "name": "Bolster"
        }, 
        {
            "def": "A cabless B unit or Slug. Although a Slug and a B unit differ in terms of an engine, both serve the purpose of adding more tractive effort.[45][46]", 
            "link": "/wiki/Slug_(railroad)", 
            "name": "Booster"
        }, 
        {
            "def": "A type of rolling stock with a flat bottom enclosed on all sides and top, which is loaded and unloaded from sliding doors on each side[47][48]", 
            "link": "/wiki/Boxcar", 
            "name": "Boxcar"
        }, 
        {
            "def": "A train crew member who performs railcar and track management—often a single job description along with switchman (\"brakeman/switchman\"). A brakeman manually activated brakes on railroad cars before the advent of air brakes.", 
            "link": "/wiki/Brakeman", 
            "name": "Brakeman (US)"
        }, 
        {
            "def": "A small hut at one end of a railway wagon to protect the brakeman from the elements", 
            "link": "/wiki/Brakeman%27s_cabin", 
            "name": "Brakeman's caboose (US)"
        }, 
        {
            "def": "The middle CSX tricolor paint scheme (also known as Yellow Nose 2 or YN2)[49][unreliable source?]", 
            "link": null, 
            "name": "Bright Future"
        }, 
        {
            "def": "A type of inspection car or speeder, typically streamlined, manufactured by the Buda Engine Co. Sometimes built out of an ordinary automobile body, with flanged wheels added. It was driven by small engines from 30 to 200 horsepower.[50]", 
            "link": null, 
            "name": "Buda Car"
        }, 
        {
            "def": "A caboose on the Boston and Maine Railroad[51]", 
            "link": null, 
            "name": "Buggy"
        }, 
        {
            "def": "A railroad police officer[12][35]", 
            "link": null, 
            "name": "Bull"
        }, 
        {
            "def": "GM Electro-Motive Division model 'MP' or 'SW' endcab switching locomotives[52]", 
            "link": null, 
            "name": "Butthead or Butt Head"
        }, 
        {
            "def": "A passenger coach which has a full set of train controls at one end, allowing for the use of push-pull train operation[53]", 
            "link": "/wiki/Control_car", 
            "name": "Cab car (US)"
        }, 
        {
            "def": "A locomotive which derives its structural strength from a bridge-truss design framework in the sides and roof, which cover the full width of the locomotive", 
            "link": "/wiki/Cab_unit", 
            "name": "Cab unit (US)"
        }, 
        {
            "def": "Former EMD F40PH locomotives with the diesel engine removed, and a roll-up baggage door installed in the center of the carbody; used as cab/baggage cars in Amtrak push-pull service. Portmanteau of 'cab' and 'baggage'.[54]", 
            "link": null, 
            "name": "Cabbage"
        }, 
        {
            "def": "A nickname for EMD SD9 locomotives, in reference to their smooth ride quality reminiscent of a Cadillac automobile. This nickname is said to have originated on the Southern Pacific Railroad.[citation needed]", 
            "link": null, 
            "name": "Cadillac"
        }, 
        {
            "def": "A cabless switcher. Not a slug; it has its own diesel engine.[46]", 
            "link": "/wiki/Cow-calf", 
            "name": "Calf"
        }, 
        {
            "def": "Conrail's herald[55][56]", 
            "link": null, 
            "name": "Can Opener"
        }, 
        {
            "def": "Railroad car repair-person or car inspector. The term is derived from a worker who taps or \"knocks\" on railroad equipment to check its soundness.[57]", 
            "link": null, 
            "name": "Car knocker"
        }, 
        {
            "def": "Norfolk Southern locomotives with white stripes painted on the nose, which are said to look like catfish whiskers[citation needed]", 
            "link": null, 
            "name": "Catfish"
        }, 
        {
            "def": "Union Pacific's EMD DDA40X locomotives. World's most powerful diesel locomotives, delivered in 1969, the year of Union Pacific's centennial.[58]", 
            "link": null, 
            "name": "Centennials"
        }, 
        {
            "def": "A nickname given to a 12-axled Baldwin diesel locomotive.[59] Also a tender (as on a steam engine) with seven axles (two axles in a truck, followed by five fixed axles).[60][61]", 
            "link": "/wiki/Baldwin_DR-12-8-1500/2", 
            "name": "Centipede"
        }, 
        {
            "def": "A system in which signals and switches for a given area of track are controlled from a centralized location[62]", 
            "link": "/wiki/Centralized_traffic_control", 
            "name": "Centralized traffic control (CTC) (US)"
        }, 
        {
            "def": "Red colored signal aspects (lights) when mixed with other colors of a signal aspect (e.g. \"Two cherries and a lemon\" would denote a Red over Red over Yellow aspect colors)[citation needed]", 
            "link": null, 
            "name": "Cherry"
        }, 
        {
            "def": "Chessie System's kitten logo; the profile of the Chesapeake and Ohio's sleeping kitten mascot Chessie appears inside the corporate C logo[63][unreliable source?][64][65]", 
            "link": null, 
            "name": "Ches-C"
        }, 
        {
            "def": "Railroad police detective. The term is derived from the fact that railroad police have to walk on ballast, which is sometimes known as \"cinders\" (before dieselization, many railroads used spent steam locomotive cinders for ballast)[66][67]", 
            "link": null, 
            "name": "Cinder dick"
        }, 
        {
            "def": "Loading trailers on flatcars sequentially from the end; the standard method of loading in early piggyback service[68]", 
            "link": null, 
            "name": "Circus loading"
        }, 
        {
            "def": "A train loaded with coal[69]", 
            "link": null, 
            "name": "Coal drag"
        }, 
        {
            "def": "A small, low-capacity hopper car for carrying coal[70]", 
            "link": null, 
            "name": "Coal jimmy"
        }, 
        {
            "def": "A nickname for a passenger car with an engineer's cab. Also known as a cab car or control car. So named due to the alleged additional danger posed to passengers in such cars (which are pushed by the heavier trailing locomotive) in frontal collisions.[71]", 
            "link": null, 
            "name": "Coffin car"
        }, 
        {
            "def": "A type of signal used most prominently by the Baltimore & Ohio and the Norfolk & Western railroads[72][73]", 
            "link": null, 
            "name": "Color position light (CPL)"
        }, 
        {
            "def": "The person in charge of a train and its crew. On passenger trains, a conductor is also responsible for tasks such as assisting passengers and collecting tickets.", 
            "link": "/wiki/Conductor_(transportation)", 
            "name": "Conductor (US)"
        }, 
        {
            "def": "The group of rail vehicles making up a train, or more commonly a group of locomotives connected together for multiple-unit (MU) operation[74][75]", 
            "link": null, 
            "name": "Consist"
        }, 
        {
            "def": "An interlocking, or the location of a track signal or other marker with which dispatchers can specify when controlling trains[62]", 
            "link": null, 
            "name": "Control point (CP) (US)"
        }, 
        {
            "def": "A head-on collision between two trains[76][77][78][79]", 
            "link": null, 
            "name": "Cornfield meet (US)"
        }, 
        {
            "def": "The mechanical connector at either end of a railroad car allowing it to couple together with other cars to form a train[62]", 
            "link": "/wiki/Railway_coupling", 
            "name": "Coupler (US)"
        }, 
        {
            "def": "An EMD E-series or F-series locomotive[42][62]", 
            "link": null, 
            "name": "Covered wagon"
        }, 
        {
            "def": "A switcher locomotive, when paired with a calf[46]", 
            "link": "/wiki/Cow-calf", 
            "name": "Cow"
        }, 
        {
            "def": "A locomotive for which structural strength comes from the underframe instead of the sides and roof", 
            "link": "/wiki/Cowl_unit", 
            "name": "Cowl unit (US)"
        }, 
        {
            "def": "A small industrial locomotive[80][unreliable source?][81]", 
            "link": null, 
            "name": "Critter"
        }, 
        {
            "def": "See Railroad tie.", 
            "link": null, 
            "name": "Cross-tie (US)"
        }, 
        {
            "def": "A caboose[82]", 
            "link": null, 
            "name": "Crummy"
        }, 
        {
            "def": "A set of cars coupled together[83]", 
            "link": null, 
            "name": "Cut (US)"
        }, 
        {
            "def": "The current CSX paint scheme, also known as Yellow Nose 3 (YN3) or Gold Nose 1 (GN1)[84]", 
            "link": null, 
            "name": "Dark Future"
        }, 
        {
            "def": "Rail lines without wayside (train control) signals[85]", 
            "link": "/wiki/Dark_territory", 
            "name": "Dark Territory"
        }, 
        {
            "def": "The lens hood on a modern style of railroad signals, due to its vague resemblance to the helmet of Darth Vader from Star Wars[86][87]", 
            "link": null, 
            "name": "Darth Vader"
        }, 
        {
            "def": "A passenger train that is traveling along a line but is not carrying passengers[88]", 
            "link": "/wiki/Dead_mileage#Deadheading", 
            "name": "Deadheading"
        }, 
        {
            "def": "The logo of Illinois Central Railroad, which has the letter \"i\" inside a circle—based on a vague resemblance to the Death Star battle station in Star Wars[citation needed]", 
            "link": null, 
            "name": "Deathstar"
        }, 
        {
            "def": "Level crossing of two railroad tracks, at any angle from 15° to 90°[88]", 
            "link": "/wiki/Level_junction", 
            "name": "Diamond"
        }, 
        {
            "def": "A nickname given to small locomotives, particularly one running in industrial service or on narrow gauge tracks[89] Also, a small old-fashioned trolley.[90]", 
            "link": null, 
            "name": "Dinky"
        }, 
        {
            "def": "Locomotives at the end or in the middle of a train. Can either be manned or automatically controlled. Manned units are preferred to be called \"helpers\" by railfans and some railroad personnel.[91]", 
            "link": "/wiki/Distributed_power", 
            "name": "Distributed power"
        }, 
        {
            "def": "A configuration in which two steam locomotives are coupled head-to-tail in order to haul a heavy train up a long or steep hill. In the present day, double headers (and occasionally triple headers) are done primarily on large passenger trains or as a show for railfans.", 
            "link": "/wiki/Double_heading", 
            "name": "Double header (US)"
        }, 
        {
            "def": "Nickname for the Canadian-built GMD SD40-2F, SD50F, SD60F, GE C40-8M, and BBD HR-616. These locomotives feature a full-width carbody with improved rear visibility, designed by William L. Draper, an employee of Canadian National Railway.[92]", 
            "link": null, 
            "name": "Draper-Taper"
        }, 
        {
            "def": "A method of braking in which the motors on the locomotive wheels generate electric power from the momentum of the moving train, and this power is dissipated through resistor grids as heat[93][94]", 
            "link": "/wiki/Dynamic_braking", 
            "name": "Dynamic braking or dynamics"
        }, 
        {
            "def": "Causing an emergency brake application (whether intentional or not)[95][96]", 
            "link": null, 
            "name": "Dynamite the train or dynamite"
        }, 
        {
            "def": "Term used to wish train crews well wishes and quick uneventful journey. Comes from notch 8 (the highest power setting of modern locomotive throttles) and to apply sand to prevent wheel slipping.[97]", 
            "link": null, 
            "name": "Eight and sand"
        }, 
        {
            "def": "A consist of multiple locomotives with all units facing forward; resembling the nose-to-tail train of elephants in a circus parade[98][99]", 
            "link": null, 
            "name": "Elephant style"
        }, 
        {
            "def": "Clear aspects (green colored signal lights) indicating maximum allowable speed for that section of track or route. Emeralds are the opposite of \"Rubies\".[citation needed]", 
            "link": null, 
            "name": "Emeralds"
        }, 
        {
            "def": "When a train has made a full brake application due to adverse event, or has lost its train air due to a defective valve (a \"kicker\"), or a broken air line or train separation. The train crew will normally declare that they are \"in emergency\" over the train radio, thus warning other trains and the dispatcher that there is a problem.[100][101]", 
            "link": null, 
            "name": "Emergency"
        }, 
        {
            "def": "A form of electronic caboose with a flashing red light mounted on the end of a train. Also monitors various train functions such as brake-pipe pressure, motion, and GPS location.[102][103][104]", 
            "link": "/wiki/Flashing_rear-end_device", 
            "name": "End of train (EOT) device or flashing rear-end device (FRED)"
        }, 
        {
            "def": "The operator of a locomotive[102]", 
            "link": "/wiki/Railroad_engineer", 
            "name": "Engineer (US)"
        }, 
        {
            "def": "A nickname given to the Southern Pacific railroad by railfans[105]", 
            "link": null, 
            "name": "Espee"
        }, 
        {
            "def": "A former Conrail locomotive[106] or former Conrail employee", 
            "link": null, 
            "name": "Ex-Con"
        }, 
        {
            "def": "A defunct railroad, having either merged or discontinued operations[107]", 
            "link": "/wiki/Fallen_flag", 
            "name": "Fallen flag"
        }, 
        {
            "def": "A U.S. federal law that protects and compensates railroaders injured on the job[108]", 
            "link": "/wiki/Federal_Employers_Liability_Act", 
            "name": "Federal Employers Liability Act (FELA)"
        }, 
        {
            "def": "The agency which oversees rail operation regulations and safety requirements for U.S. freight, passenger and commuter rail operations[103]", 
            "link": "/wiki/Federal_Railroad_Administration", 
            "name": "Federal Railroad Administration (FRA) (US)"
        }, 
        {
            "def": "Converting a double stack container train to single stack by removing the top layer of containers, allowing the rest of the train to proceed along track that lacks double stack clearance. The removed containers can be trucked to local destinations. The opposite process is toupee.[109]", 
            "link": null, 
            "name": "Filet"
        }, 
        {
            "def": "The EMD SD45, with its dynamic brake blisters and radiators that distinctively flare from the top of the unit. Also Flare 45. Both forms distinguish the SD45 from the SD45-2 and SD45T-2, which lack flared radiators.[110] The GP40X and SD70M models also bear similar flared radiators.[citation needed]", 
            "link": null, 
            "name": "Flares"
        }, 
        {
            "def": "A type of rolling stock, which can be a flat-bottomed car with no sides on which freight (including intermodal containers) can be stacked. A bulkhead is a flatcar with walls on the front and rear. A center-beam bulkhead is a bulkhead flatcar with an additional wall dividing one side of the flatcar from the other, but still without any sides.[103]", 
            "link": "/wiki/Flatcar", 
            "name": "Flatcar (US)"
        }, 
        {
            "def": "Industry slang for trailer-on-flatcar service in the 1970s, especially in the trade journal Railway Age[111]", 
            "link": null, 
            "name": "Flatback"
        }, 
        {
            "def": "A railfan, particularly one whose enthusiasm appears excessive. They figuratively \"foam at the mouth\" while railfanning.[112]", 
            "link": null, 
            "name": "Foamer"
        }, 
        {
            "def": "A form of electronic caboose with a flashing red light mounted on the end of a train. Also monitors various train functions such as brake-pipe pressure, motion, and GPS location.[102][103][104]", 
            "link": "/wiki/Flashing_rear-end_device", 
            "name": "Flashing rear-end device (FRED) or end-of-train (EOT) device"
        }, 
        {
            "def": "The practice of uncoupling a locomotive from a car in motion and running over a switch, whereupon an employee on the ground lines the switch to divert the car onto an adjacent track.[113][114] Once commonplace, this practice has led to several lawsuits against railroad companies and is now strictly prohibited due to the high risk to life and property.[115][116][117][118][119]", 
            "link": null, 
            "name": "Flying switch (US)"
        }, 
        {
            "def": "Motive power from one railroad that runs along another railroad[120]", 
            "link": null, 
            "name": "Foreign power"
        }, 
        {
            "def": "The products which are carried", 
            "link": "/wiki/Freight", 
            "name": "Freight (US)"
        }, 
        {
            "def": "A car designed to transport freight", 
            "link": "/wiki/Freight_car", 
            "name": "Freight car (US)"
        }, 
        {
            "def": "A casting with \"X\" shaped grooves used in switches and crossovers[103]", 
            "link": null, 
            "name": "Frog (US)"
        }, 
        {
            "def": "A derogatory term used by some railroaders for railfans[121]", 
            "link": null, 
            "name": "Fucking rail nut (FRN)"
        }, 
        {
            "def": "A track maintenance worker[122][123]", 
            "link": "/wiki/Gandy_dancer", 
            "name": "Gandy dancer"
        }, 
        {
            "def": "A nickname for EMD's GP series of locomotives[123]", 
            "link": null, 
            "name": "Geep"
        }, 
        {
            "def": "A MetroNorth or Amtrak GE P32AC-DM locomotive[citation needed]", 
            "link": null, 
            "name": "Gennie"
        }, 
        {
            "def": "From \"generator set\", a locomotive that uses multiple high-speed diesel engines and generators, rather than a single medium-speed diesel engine and a single generator. Sometimes confused with Green Goat locomotives; the only similarities between the two types are their outward appearance and that both are designed to reduce air pollution and fuel consumption.[124]", 
            "link": null, 
            "name": "Genset"
        }, 
        {
            "def": "A nickname for GE Evolution Series locomotives, in reference to the GEVO-12 engine used in those units[125]", 
            "link": null, 
            "name": "GEVO"
        }, 
        {
            "def": "An unpainted (but usually numbered) locomotive that has not yet been painted with company's livery. A ghost locomotive can be either in transport from the locomotive builder to the paint shop, or an unpainted locomotive may have been placed in revenue service without livery due to power shortage or, in rare cases, pushed out of the factory preemptively due to an impending labor strike. May also refer to an EMD E8, #4261, belonging to the Boston commuter agency, MBTA. This locomotive was known for its unique, plain light-gray paint.[citation needed]", 
            "link": null, 
            "name": "Ghost"
        }, 
        {
            "def": "A locomotive used in yard switching service[35][69][123]", 
            "link": null, 
            "name": "Goat"
        }, 
        {
            "def": "The current CSX paint scheme[citation needed]", 
            "link": null, 
            "name": "Gold Nose 1 (GN1) or YN3"
        }, 
        {
            "def": "A type of rolling stock with a flat bottom and relatively low sides, used to haul material such as ore or scrap, and loaded and unloaded from the top which may be covered or uncovered[123][126]", 
            "link": "/wiki/Gondola_(rail)", 
            "name": "Gondola (US)"
        }, 
        {
            "def": "A type of \"hybrid\" switching locomotive utilizing a small diesel engine and a large bank of rechargeable batteries[127]", 
            "link": "/wiki/Green_Goat", 
            "name": "Green Goat"
        }, 
        {
            "def": "A double rail section of track, sometimes found in train yards and on bridges to prevent derailments or limit damage caused by derailments, by having rail on both sides of the wheel flange. Also found on curves with a tight radius and switches and crossings[123]", 
            "link": "/wiki/Guard_rails_(railroad)", 
            "name": "Guard rail (US)"
        }, 
        {
            "def": "A caboose[128][129]", 
            "link": null, 
            "name": "Hack"
        }, 
        {
            "def": "\n\nA GE locomotive with \"winged\" radiators, when running long hood forward\nA nickname given to certain early ALCO roadswitchers with a high nose, as well as the GE BQ23-7[citation needed]\n\n", 
            "link": null, 
            "name": "Hammerhead"
        }, 
        {
            "def": "A small, hand-powered railroad car used for track inspection", 
            "link": "/wiki/Handcar", 
            "name": "Handcar (US)"
        }, 
        {
            "def": "A city-based transit rail system that runs on its own dedicated track and often underground. Subways are considered heavy rail. Refers to commuter rail and inter-city rail when used by the FRA or in other countries.[130][131]", 
            "link": null, 
            "name": "Heavy rail (US)"
        }, 
        {
            "def": "During the period between about 1910 and the mid nineteen thirties, most passenger cars in the US were built with three axle trucks, concrete floors, and riveted, double walled sides and often weighed 90 tons or more. Heavyweight construction was used to improve ride quality.[132][133]", 
            "link": null, 
            "name": "Heavyweight (US)"
        }, 
        {
            "def": "A locomotive temporarily coupled to heavy-tonnage trains to assist them over steep grades[134]", 
            "link": "/wiki/Bank_engine", 
            "name": "Helper"
        }, 
        {
            "def": "\n\nAnother term for a clear signal, derived from the days of steam where a station operator would hoist a large wooden ball up a standard, signalling that the engineer was authorized to proceed[35][69][132][135]\nA slang term used among railroad employees to convey to the crew of a train that they were clear to proceed[136][137]\n\n", 
            "link": null, 
            "name": "High ball"
        }, 
        {
            "def": "A boxcar whose vertical clearance is excessive[138][139]", 
            "link": null, 
            "name": "High cube (US)"
        }, 
        {
            "def": "The federal hours-of-service law that forbids certain classes of railroad employees, including those operating trains, from working longer than a certain time after reporting for duty—currently 12 hours[140][141]", 
            "link": null, 
            "name": "Hog law"
        }, 
        {
            "def": "A locomotive engineer[35][69][132][142]", 
            "link": null, 
            "name": "Hogger"
        }, 
        {
            "def": "Common term for Alco diesel locomotives, due to their tendency to blow clouds of black smoke when throttling up, due to turbo lag[143][144]", 
            "link": null, 
            "name": "Honorary steam engine"
        }, 
        {
            "def": "A locomotive whose sides and roof are nonstructural and do not extend the full width of the locomotive. Structural strength comes from the underframe.[132]", 
            "link": "/wiki/Hood_unit", 
            "name": "Hood unit (US)"
        }, 
        {
            "def": "Norfolk Southern's current locomotive livery with a horse's head embedded in the NS Logo[145]", 
            "link": "/wiki/Mister_Ed", 
            "name": "Horsehead or 'Mister Ed'"
        }, 
        {
            "def": "How long motive power from another railroad is used on a specific railroad[120]", 
            "link": null, 
            "name": "Horsepower hours"
        }, 
        {
            "def": "A train composed of defective \"bad order\" equipment or locomotives that are en route to a repair shop[146]", 
            "link": null, 
            "name": "Hospital train"
        }, 
        {
            "def": "An overheated wheel bearing. This comes from the era before the widespread use of roller bearings where the ends of an axle rested in solid copper bearings housed in a journal box filled with oil soaked cotton waste. An overheated axle led to a hot journal box that often ignited the oiled waste. The term is used to refer to a railway wheel bearing that has over-heated due to internal friction caused by some fault in the bearing.[132][147][148]", 
            "link": "/wiki/Hot_box", 
            "name": "Hot box"
        }, 
        {
            "def": "\n\nAny section of track over which a train movement is imminent. The closer or faster the approaching train, the \"hotter\" the rail.[149]\nOn some electrified railroads and rapid transit lines, the third rail which supplies power to locomotives or cars[150][151][152]\n\n", 
            "link": null, 
            "name": "Hot rail (US)"
        }, 
        {
            "def": "Electric power used to provide for the comfort of passengers aboard a train en route[153]", 
            "link": null, 
            "name": "Hotel power (US)"
        }, 
        {
            "def": "A fast, long-distance train given priority on the track over other trains[154][155][156]", 
            "link": null, 
            "name": "Hotshot (US)"
        }, 
        {
            "def": "Any location that includes a switch or crossing of two tracks, derived from the early practice of installation of a system of mechanical equipment called an interlocking plant to prevent collisions. See also signal box. Interlocking is also the term for the actual mechanical or electrical apparatus that prevents switch/points and signals from being operated in ways that would allow for conflicting train movements.[157]", 
            "link": "/wiki/Interlocking", 
            "name": "Interlocking (US)"
        }, 
        {
            "def": "On a locomotive, a long, heavy lever that operates the reversing gear[158]", 
            "link": "/wiki/Johnson_Bar_(locomotive)", 
            "name": "Johnson Bar (US)"
        }, 
        {
            "def": "Synonym for the verb \"couple\" used by brakemen when flat switching a yard. Talking on the radio, they will tell the engineer how many car lengths to back up in order to couple to another car (i.e. \"five cars to a joint\")[159]", 
            "link": null, 
            "name": "Joint"
        }, 
        {
            "def": "A metal plate that joins the ends of rails in jointed track", 
            "link": null, 
            "name": "Joint bar (US)"
        }, 
        {
            "def": "A unit train of Tropicana cars[160]", 
            "link": "/wiki/Juice_Train", 
            "name": "Juice Train"
        }, 
        {
            "def": "To pass an absolute signal and thereby change its aspect to stop; originated in the days of semaphore signals whose arms would drop to the stop aspect when passed[161]", 
            "link": null, 
            "name": "Knock down (US)"
        }, 
        {
            "def": "Southern Pacific Santa Fe Railroad's red, yellow, and black paint scheme, which resembled the packaging of Kodachrome color transparency film. This was the scheme instituted when the merger between Southern Pacific and Santa Fe was assumed to be approved. Hundreds of locomotives were painted in Kodachrome colors before the merger was denied.[citation needed]", 
            "link": null, 
            "name": "Kodachrome"
        }, 
        {
            "def": "A portable (often handheld) light source that is used to signal train crews[162]", 
            "link": null, 
            "name": "Lantern (US)"
        }, 
        {
            "def": "A junction in which all track crossings take place at grade and routings must therefore be controlled by signals and interlocking", 
            "link": "/wiki/Level_junction", 
            "name": "Level junction (US)"
        }, 
        {
            "def": "A locomotive unit traveling to a destination without a train attached. Can be a power pool transfer (relocation of a surplus of locomotives from one location to another), or can be a helper locomotive/locomotives being sent or returning from helping a heavy tonnage train over a grade.[163]", 
            "link": null, 
            "name": "Light engine"
        }, 
        {
            "def": "A telegraph operator[69]", 
            "link": null, 
            "name": "Lightning Slinger"
        }, 
        {
            "def": "To have switches aligned correctly before a move (e.g. over the radio, \"Would you call the dispatcher for a lineup so we can get out of here?\")[164][165]", 
            "link": null, 
            "name": "Lineup or lined up"
        }, 
        {
            "def": "A principal artery of a railway system[166]", 
            "link": "/wiki/Main_line_(railway)", 
            "name": "Mainline (US)"
        }, 
        {
            "def": "The drive rod connecting the crosshead to a driving-wheel or axle in a steam locomotive[167]", 
            "link": null, 
            "name": "Main rod (US)"
        }, 
        {
            "def": "The maintenance of a railroad's rights of way, including track[166]", 
            "link": "/wiki/Maintenance_of_way", 
            "name": "Maintenance of way (MOW) (US)"
        }, 
        {
            "def": "A freight train with a mixture of car types and cargoes. Also known as a Mixed Freight Train.[166][168]", 
            "link": null, 
            "name": "Manifest"
        }, 
        {
            "def": "The intertwined P and C letters of the Penn Central logo[citation needed]", 
            "link": null, 
            "name": "Mating Worms"
        }, 
        {
            "def": "Amtrak EMD AEM-7 or ABB ALP-44 electric locomotives; so named for their design being based on the Swedish Rc4.[169]", 
            "link": null, 
            "name": "Meatball or Swedish Meatball"
        }, 
        {
            "def": "Four permanently coupled ore cars (jennies)[170]", 
            "link": null, 
            "name": "Miniquad"
        }, 
        {
            "def": "The name given to the maroon and gold paint scheme applied to Boston & Maine Railroad diesel-electric locomotives from the 1940s to early 1950s, bearing the famous Revolutionary-inspired Minute Man statue[citation needed]", 
            "link": null, 
            "name": "Minuteman"
        }, 
        {
            "def": "A locomotive that is paired with a slug[46]", 
            "link": null, 
            "name": "Mother"
        }, 
        {
            "def": "Someone who walks in the \"mud\" along the rails verifying car lineup[171]", 
            "link": null, 
            "name": "Mud hop (US)"
        }, 
        {
            "def": "A derogatory nickname given to GE Genesis locomotives, in reference to one's involvement in the 1993 Big Bayou Canot train disaster[citation needed]", 
            "link": null, 
            "name": "Mud Missile"
        }, 
        {
            "def": "Named for the Canadian Pacific paint scheme given from 1968 to 1996[172][173][174]", 
            "link": null, 
            "name": "Multimark"
        }, 
        {
            "def": "The ability of diesel and electric locomotives or multiple units to be joined together and controlled from one driving station. Such a set of joined locomotives is called a consist or (colloquially) \"lash-up\" and is said to be \"MUed together\".[166]", 
            "link": "/wiki/Multiple-unit_train_control", 
            "name": "Multiple-unit train control (US)"
        }, 
        {
            "def": "A derisive acronym for \"not in my backyard\" describing residents who are opposed to trains running through their neighborhoods", 
            "link": "/wiki/NIMBY", 
            "name": "NIMBY (US)"
        }, 
        {
            "def": "A group of locomotives that are oriented elephant style[citation needed]", 
            "link": null, 
            "name": "Nose to ass (N2A)"
        }, 
        {
            "def": "A train composed of passenger cars that are privately owned by the railroad corporation and which travels along their rail lines, so that upper level management can review facilities, assess the addition or reconstruction of facilities that are needed for expansion or modernization; as well as streamlining of operations or removal of obsolete infrastructure. Also, these trains are used to escort visiting upper level management from other railroads for the purpose of a proposed purchase or sale of a rail line.[175][176][177]", 
            "link": null, 
            "name": "Office-car special (OCS)"
        }, 
        {
            "def": "Operation of a train by the driver or motorman alone, without a conductor", 
            "link": "/wiki/One-man_operation", 
            "name": "One-man operation (OMO) (US)"
        }, 
        {
            "def": "Train crew members who have reached their daily 12-hour maximum of hours worked and must cease working due to regulations[178]", 
            "link": null, 
            "name": "Outlawed"
        }, 
        {
            "def": "A train of exclusively locomotives, usually retired, that exceeds the ordinary maximum number of locomotives in one train[citation needed]", 
            "link": null, 
            "name": "Overhaul"
        }, 
        {
            "def": "An uncommon nickname for Pennsylvania Railroad's MP54s and related heavyweight MU cars, in reference to their distinctive porthole front windows that give the appearance of a pair of eyes when viewed from the front[179][180]", 
            "link": null, 
            "name": "Owl-eyed Cars"
        }, 
        {
            "def": "A nickname for Canadian Pacific Railway's 1968–1996 logo featuring a black triangle within a white half-circle, which resembles the main character of the video arcade game Pac-Man. It was CP's corporate logo for all business aspects - railway (CP Rail), shipping (CP Ships), telecommunications (CNCP), trucking (CP Express) and airline (CP Air). It was officially known as the Multimark.[181][unreliable source?][87]", 
            "link": null, 
            "name": "Pac-Man"
        }, 
        {
            "def": "Railway vehicle for use in passenger trains[182][183]", 
            "link": "/wiki/Passenger_car_(rail)", 
            "name": "Passenger car (US)"
        }, 
        {
            "def": "A locomotive or car wearing a new reporting mark or number on a \"patch\" over existing paint, usually of the former owner's[184]", 
            "link": null, 
            "name": "Patch"
        }, 
        {
            "def": "A nickname for old Pennsylvania Railroad position light signals[185][unreliable source?]", 
            "link": null, 
            "name": "Pennsy Style"
        }, 
        {
            "def": "An Amtrak GE Dash 8-32BWH, in reference to the units' original paint scheme with large red and blue stripes. Also referred to as \"Cutters\" for the striping's supposed similarity to striping on Coast Guard vessels.[citation needed]", 
            "link": null, 
            "name": "Pepsi Can"
        }, 
        {
            "def": "A train devoted exclusively to intermodal traffic, generally trailers on flatcars (TOFC) or containers on flatcars (COFC)[186][187]", 
            "link": null, 
            "name": "Pig train"
        }, 
        {
            "def": "The measurement of a freight car's vertical clearance. Plate F and above is considered excess height, and such cars must avoid low-clearance routes.[188] See also: Loading gauge", 
            "link": null, 
            "name": "Plate (US)"
        }, 
        {
            "def": "A nickname for the General Electric P30CH locomotives. So termed by the similar appearance of the model name to the word pooch: P30CH / POOCH.[189]", 
            "link": null, 
            "name": "Pooch"
        }, 
        {
            "def": "Signals made by the Pennsylvania Railroad that make use of a circular disc with up to eight lights mounted in a circle, with one light in the center. The lights would line up in a straight line to give the indication.[190][191]", 
            "link": null, 
            "name": "Position light signal (Pennsylvania)"
        }, 
        {
            "def": "Privately owned passenger cars[192][193]", 
            "link": null, 
            "name": "Private varnish (PV)"
        }, 
        {
            "def": "\n\nBNSF Railway's current bright orange paint scheme[citation needed]\nCSX's or Amtrak's maintenance-of-way paint scheme[194]\nFormerly ICG's all-orange scheme[citation needed]\n\n", 
            "link": null, 
            "name": "Pumpkin"
        }, 
        {
            "def": "Shorthand nickname for the old Chicago, Burlington, & Quincy (CB&Q) Railroad[195][196]", 
            "link": null, 
            "name": "Q"
        }, 
        {
            "def": "A federally mandated safety inspection performed on a locomotive every 92 operating days[197]", 
            "link": null, 
            "name": "Q-inspection (US)"
        }, 
        {
            "def": "A designation by the Federal Railroad Administration that removes the requirement for train operators to sound their horn when approaching each public crossing in a certain area, often near residential neighborhoods who have asked for the status. Because the train does not sound its horn while approaching the crossings, safety upgrades to all of the crossings must be made in order to compensate. These upgrades usually include double gates, additional signage, lights, and bells, if they are not already present. Additionally, the residents requesting the status must indemnify the railroad from any resulting crossing mishaps.[198]", 
            "link": null, 
            "name": "Quiet zone (US)"
        }, 
        {
            "def": "\n\nA nickname for a stretch of Metra Commuter Rail line and BNSF freight line between Chicago and Aurora where commuter trains and freight trains commonly attain high speeds.[199]\nThe parallel tracks of the O&W and DL&W north of Norwich.[200]\n\n", 
            "link": null, 
            "name": "Racetrack"
        }, 
        {
            "def": "Norfolk Southern locomotives that have the entire area around the cab windows painted white, resembling the face of a raccoon[citation needed]", 
            "link": null, 
            "name": "Raccoon"
        }, 
        {
            "def": "\n\nMultiple autoracks\nThe portion of an autorack which is attached to a flat car in order to protect the vehicles inside and may contain one, two, or three levels depending on the height of the vehicles being shipped[citation needed]\n\n", 
            "link": null, 
            "name": "Racks"
        }, 
        {
            "def": "A form of wheel chock that slips onto the rail under the wheel of rolling stock which prevents the vehicle from rolling[citation needed]", 
            "link": null, 
            "name": "Rail sled (US)"
        }, 
        {
            "def": "\n\nA group of locomotives of different colors or liveries leading a single train[201]\nA passenger train made up of cars bearing different liveries[202]\n\n", 
            "link": "/wiki/Skittles_(confectionery)", 
            "name": "Rainbow consist, Skittles consist, or Skittles lineup"
        }, 
        {
            "def": "A passenger train traveling over track that does not have regular passenger service[203]", 
            "link": null, 
            "name": "Rare mileage"
        }, 
        {
            "def": "Canadian Pacific's GMD SD40-2F locomotives[citation needed]", 
            "link": null, 
            "name": "Red Barn"
        }, 
        {
            "def": "A refrigerator car[204][205]", 
            "link": null, 
            "name": "Reefer"
        }, 
        {
            "def": "A (usually old) locomotive owned by a leasing company", 
            "link": null, 
            "name": "Rent-a-wreck"
        }, 
        {
            "def": "A code assigned by the Association of American Railroads to identify the owners of rolling stock in North America", 
            "link": "/wiki/Reporting_mark", 
            "name": "Reporting mark"
        }, 
        {
            "def": "A speed not exceeding 20 mph which allows stopping within half the range of vision short of an obstruction on the tracks[206][207]", 
            "link": null, 
            "name": "Restricted speed (US)"
        }, 
        {
            "def": "A \"high nose\" locomotive running with the long hood facing forward. Reminiscent of the Southern Railway and the Norfolk & Western Railway style of running locomotives.[citation needed]", 
            "link": null, 
            "name": "Right way"
        }, 
        {
            "def": "Nickname for HHP-8 electric locomotives used by Amtrak for Northeast Regional service[citation needed]", 
            "link": null, 
            "name": "Rhino"
        }, 
        {
            "def": "The locomotive closest to the train during a double-heading operation", 
            "link": "/wiki/Train_engine", 
            "name": "Road engine (US)"
        }, 
        {
            "def": "Visual inspection of railroad equipment while it is in motion[208][209]", 
            "link": null, 
            "name": "Roll-by or rollby (US)"
        }, 
        {
            "def": "Someone interested in photographing every locomotive road number they can[210][211]", 
            "link": null, 
            "name": "Roster shooter"
        }, 
        {
            "def": "Stop signal aspect (red colored signal lights), or a red aspect in conjunction with other colors[citation needed]", 
            "link": null, 
            "name": "Rubies or cherries"
        }, 
        {
            "def": "The universal rule prohibiting the use of drugs and alcohol", 
            "link": "/wiki/Rule_G", 
            "name": "Rule G (US)"
        }, 
        {
            "def": "The practice of detaching a locomotive from its train, driving it to the other end of the train and re-attaching it, to allow the train to proceed in the direction it has just come from (e.g. when it reaches its destination and forms a service in the other direction).[212][213]", 
            "link": "/wiki/Headshunt#Run-round", 
            "name": "Runaround (US)"
        }, 
        {
            "def": "A train that originates on one railroad, with its destination on another road, that is simply \"run through\" to its destination instead of being exchanged for home road rolling stock at the crew-change point, in order to save expense[214][215]", 
            "link": null, 
            "name": "Run through"
        }, 
        {
            "def": "An event in which a train passes a signal to stop without authorization to do so[citation needed]", 
            "link": "/wiki/Signal_passed_at_danger", 
            "name": "Running a red signal"
        }, 
        {
            "def": "Walkboards found on the tops and ends of rail cars[216]", 
            "link": null, 
            "name": "Running boards or grating"
        }, 
        {
            "def": "A law mandating air brakes, grab bars, and automatic couplers", 
            "link": "/wiki/U.S._Railroad_Safety_Appliance_Act", 
            "name": "Safety Appliance Act (US)"
        }, 
        {
            "def": "A EMD F40PH locomotive, in reference to it operating in a constant state of full throttle (in order to provide head-end power to passenger cars).[217] Coined by MBTA railfans.[citation needed]", 
            "link": null, 
            "name": "Screamer or screaming thunderbox"
        }, 
        {
            "def": "A Canadian National locomotive in the 1970s and 1980s paint scheme featuring light-gray stripes on the locomotive's long hood[218]", 
            "link": null, 
            "name": "Sergeant Stripes"
        }, 
        {
            "def": "A temporary stretch of track that takes trains around construction or an accident scene[219]", 
            "link": null, 
            "name": "Shoofly (US)"
        }, 
        {
            "def": "To push a cut of cars backward with a locomotive[220][221]", 
            "link": null, 
            "name": "Shove"
        }, 
        {
            "def": "A length of track feeding a number of sidings that permits the sidings to be shunted without blocking the main line, or where two lines merge into one before ending with a buffer, to allow a run-round procedure to take place[222]", 
            "link": "/wiki/Headshunt", 
            "name": "Shunting neck (US)"
        }, 
        {
            "def": "A second parallel track (running for a short distance) on single-track railway lines, allowing a train to pass another", 
            "link": "/wiki/Rail_siding", 
            "name": "Siding (US)"
        }, 
        {
            "def": "Adjacently numbered locomotives[citation needed]", 
            "link": null, 
            "name": "Sisters"
        }, 
        {
            "def": "A wheel chock[223][224]", 
            "link": null, 
            "name": "Skate"
        }, 
        {
            "def": "A group of locomotives of different colors or liveries leading a single train—so named for the appearance of various colored Skittles candies[citation needed]", 
            "link": null, 
            "name": "Skittles consist, Skittles lineup, or rainbow consist"
        }, 
        {
            "def": "Looseness in a train caused by mating clearances in couplers[219]", 
            "link": "/wiki/Slack_action", 
            "name": "Slack action (US)"
        }, 
        {
            "def": "A locomotive, with or without an operator's cab, which lacks a diesel engine, and draws power for its traction motors from a normal locomotive, known as a \"mate\" or \"mother\"[42][46]", 
            "link": null, 
            "name": "Slug"
        }, 
        {
            "def": "A chimney[225]", 
            "link": "/wiki/Smokestack", 
            "name": "Smokestack or stack (US)"
        }, 
        {
            "def": "A locomotive with a diesel engine, but does not have traction motors, often used for external power for a rotary snow plow[226]", 
            "link": null, 
            "name": "Snail"
        }, 
        {
            "def": "A small, motorized track inspection vehicle[227]", 
            "link": "/wiki/Speeder", 
            "name": "Speeder, motorcar, trackcar, putt putt, or golf cart"
        }, 
        {
            "def": "A stretch of rail that branches off the main line[219]", 
            "link": null, 
            "name": "Spur (US)"
        }, 
        {
            "def": "A nickname for double-stacked cars or trains[219]", 
            "link": null, 
            "name": "Stacks"
        }, 
        {
            "def": "The early CSX gray and blue paint scheme. So named for their virtual invisibility in poor light. Also refers to NS D9-40CWs in light gray primer paint, and a scheme used on some Metro-North locomotives.[citation needed]", 
            "link": null, 
            "name": "Stealth Unit"
        }, 
        {
            "def": "An electric locomotive with a central cab and sloping \"noses\" on each end", 
            "link": "/wiki/Steeplecab", 
            "name": "Steeplecab (US)"
        }, 
        {
            "def": "A relatively short section of track that ends at a bumper or wheelstop, most often found in a terminal[citation needed]", 
            "link": null, 
            "name": "Stub"
        }, 
        {
            "def": "A railroad that runs underground, generally in a large city", 
            "link": "/wiki/Rapid_transit", 
            "name": "Subway (US)"
        }, 
        {
            "def": "Points[219]", 
            "link": "/wiki/Railroad_switch", 
            "name": "Switch (US)"
        }, 
        {
            "def": "A small locomotive used for assembling trains and moving railroad cars around[219]", 
            "link": "/wiki/Switcher", 
            "name": "Switcher (US)"
        }, 
        {
            "def": "A nickname for Massachusetts Bay Transportation Authority (MBTA)—the Subway service through Boston, Massachusetts", 
            "link": null, 
            "name": "The T (US)"
        }, 
        {
            "def": "A nickname for a Reading Railroad T-1 4-8-4 steam locomotive[citation needed]", 
            "link": null, 
            "name": "T-Hog"
        }, 
        {
            "def": "A nickname for the new Southern Belle-inspired paint scheme on Kansas City Southern Railway locomotives assigned to subsidiary KCS de Mexico", 
            "link": null, 
            "name": "Taco Belle"
        }, 
        {
            "def": "A steam locomotive with a 4-6-0 wheel arrangement[citation needed]", 
            "link": null, 
            "name": "Ten-wheeler (US)"
        }, 
        {
            "def": "A station sited where a railway line or service ends or terminates", 
            "link": "/wiki/Terminal_station", 
            "name": "Terminal station (US)"
        }, 
        {
            "def": "A nickname for the orange paint scheme on the BNSF locomotives[citation needed]", 
            "link": null, 
            "name": "Thunder Pumpkin"
        }, 
        {
            "def": "Bars of wood or concrete placed beneath and perpendicular to track to support the rails[228]", 
            "link": "/wiki/Railroad_tie", 
            "name": "Tie (US)"
        }, 
        {
            "def": "To apply hand brakes to the trainset[229][230][231]", 
            "link": null, 
            "name": "Tie down"
        }, 
        {
            "def": "An iron or steel plate used to spread the weight of rail over a larger area of sleeper (tie) and facilitate a secure, low maintenance, fastening with bolts or clips", 
            "link": "/wiki/Tie_plate", 
            "name": "Tie plate (US)"
        }, 
        {
            "def": "Amtrak AEM-7, New Jersey Transit ABB ALP-44, or GE P42DC locomotives, due to its visual appearance and tendency to emit sparking and clicking sounds when idling. Also sometimes used to refer to any GE locomotive, due both to their tendency to shoot flames out of the exhaust stack during Turbo Lag and to General Electric's historic involvement in the manufacture of household appliances.[citation needed]", 
            "link": null, 
            "name": "Toaster"
        }, 
        {
            "def": "A small explosive device strapped to the top of a rail to alert an approaching train of danger ahead by creating a loud noise upon contact with a locomotive wheel[228]", 
            "link": "/wiki/Detonator_(railway)", 
            "name": "Torpedo (US)"
        }, 
        {
            "def": "When a single stack train coming from reduced clearance territory has additional containers placed on top for the rest of its trip; the opposite of filet[109]", 
            "link": null, 
            "name": "Toupee"
        }, 
        {
            "def": "The legal right of one railroad company to use the tracks of another, as agreed to by the companies concerned or their predecessors[228]", 
            "link": "/wiki/Trackage_rights", 
            "name": "Trackage rights (US)"
        }, 
        {
            "def": "Small explosive charges placed on the running rail which detonate when run over—used to warn drivers in following trains of an incident ahead", 
            "link": "/wiki/Detonator_(railway)", 
            "name": "Track torpedo (US)"
        }, 
        {
            "def": "A system for authorizing main track occupancy using defined points such as mileposts, switches, or stations[228]", 
            "link": "/wiki/Track_warrant", 
            "name": "Track warrant (TWC) (US) or occupancy control system (OCS) (CA)"
        }, 
        {
            "def": "A system for authorizing main track occupancy using telephone, telegraph, and wayside stations to pass authority to train crews", 
            "link": "/wiki/Train_order", 
            "name": "Train order (US)"
        }, 
        {
            "def": "Tropicana reefer boxcar. Shortened from Tropicana, referring to the orange or white refrigerated boxcars used to haul frozen concentrated orange juice to packaging facilities north of Florida. Term is specifically used by CSX crews in Cincinnati Terminal where a large such packaging facility is located.[citation needed]", 
            "link": null, 
            "name": "Trops"
        }, 
        {
            "def": "The undercarriage assembly of rolling stock incorporating the train wheels, suspension, brakes and, in powered units, the traction motors", 
            "link": "/wiki/Bogie", 
            "name": "Truck"
        }, 
        {
            "def": "Southern Pacific EMD SD40T-2 or EMD SD45T-2. Named for the lower-located air intakes to prevent the locomotive from pulling diesel exhaust in with clean air while traveling through a tunnel.[228]", 
            "link": null, 
            "name": "Tunnel Motor"
        }, 
        {
            "def": "A local freight train that makes a round trip, returning to originating station[232][233]", 
            "link": null, 
            "name": "Turn"
        }, 
        {
            "def": "A GE Universal Series locomotive[234]", 
            "link": null, 
            "name": "U-Boat"
        }, 
        {
            "def": "The common name and reporting mark for the Union Pacific Railroad[235]", 
            "link": null, 
            "name": "UP (US)"
        }, 
        {
            "def": "A railway station or terminal at which tracks and facilities are shared by two or more railway companies[236]", 
            "link": "/wiki/Union_station", 
            "name": "Union station or union terminal (US)"
        }, 
        {
            "def": "A caboose[citation needed]", 
            "link": null, 
            "name": "Van (Eastern CA)"
        }, 
        {
            "def": "A derogatory name for BNSF's first attempt at a paint scheme, which used olive and beige as its principal colors but in the configuration of the traditional AT&SF \"Warbonnet\" scheme[237]", 
            "link": null, 
            "name": "Vomit Bonnet"
        }, 
        {
            "def": "Santa Fe's red and silver paint scheme.[238] The scheme first appeared in 1937 on the railroad's E1 passenger locomotives for the Super Chief train.[239] It is widely considered the most famous and the most recognizable of railroad color schemes.[240][241] The Santa Fe phased out its use from the early 1970s on, then revived it in 1989.[242] It has become less common since the BNSF Railway merger in 1995.[243]", 
            "link": null, 
            "name": "Warbonnet"
        }, 
        {
            "def": "The BNSF orange and black update of the classic Santa Fe Warbonnet scheme[citation needed]", 
            "link": null, 
            "name": "Warpumpkin"
        }, 
        {
            "def": "M.U. cars, subway cars, and other equipment made with corrugated side panels that resembled washboards[244][245]", 
            "link": null, 
            "name": "Washboards"
        }, 
        {
            "def": "A device used for delivering a large volume of water into the tank or tender of a steam locomotive", 
            "link": "/wiki/Water_column_(railroad)", 
            "name": "Water column (US)"
        }, 
        {
            "def": "Canadian National's stylized CN logo, in use since 1961[citation needed]", 
            "link": null, 
            "name": "Wet Noodle"
        }, 
        {
            "def": "The first version of Norfolk Southern's \"Horsehead\" paint scheme.[citation needed] High visibility paint scheme used on various Burlington Northern locomotives, primarily SD60Ms, SD40-2s, GP50s, GP39 rebuilds, and GP28 rebuilds.[246]", 
            "link": null, 
            "name": "Whiteface"
        }, 
        {
            "def": "A nickname for the DL&W electric multiple unit cars because of their wicker lined seats[247]", 
            "link": null, 
            "name": "Wickerliners"
        }, 
        {
            "def": "Characteristics used to designate Union Pacific's paint scheme and engine type. Wings = \"Wing\" Decal on the engine nose, Flags = \"American Flag\" Decal on engine body, Flares = \"Flared Radiators\" of certain SD70Ms on the long hood. Some UP engines have one or more of these characteristics.[citation needed]", 
            "link": null, 
            "name": "Wings/Flags/Flares (W/F/F)"
        }, 
        {
            "def": "A nickname for Metra's fleet of EMD F40PHM-2 locomotives, in reference to that model's resemblance to the popular recreational vehicle[citation needed]", 
            "link": null, 
            "name": "Winnebago"
        }, 
        {
            "def": "Three railroad tracks in a triangular form with switches at all three corners—can be used to turn a train around[248]", 
            "link": "/wiki/Wye_(rail)", 
            "name": "Wye (US)"
        }, 
        {
            "def": "Crossing[citation needed]", 
            "link": null, 
            "name": "X-ing (US)"
        }, 
        {
            "def": "One of two Santa Fe paint schemes. The standard freight scheme from 1972 until the BNSF merger was dark blue with yellow on the front, with the same color division as the warbonnet scheme. It is also known as Bluebonnet. Yellowbonnet can also mean a warbonnet unit with only the red painted over, resulting in a silver and yellow locomotive; this was used on passenger engines transferred to freight service after the formation of Amtrak.[249]", 
            "link": null, 
            "name": "Yellowbonnet"
        }, 
        {
            "def": "CSX's first yellow-nose paint scheme; gray overall with dark blue on the top half of the cab and yellow on the front of the nose; blue \"CSX\" lettering[250]", 
            "link": null, 
            "name": "YN1"
        }, 
        {
            "def": "CSX's second yellow-nose paint scheme; more yellow on the nose; the whole cab is dark blue, along with a stripe on the side; blue or yellow \"CSX\" lettering[250]", 
            "link": null, 
            "name": "YN2"
        }, 
        {
            "def": "CSX's third yellow-nose paint scheme; dark blue overall with a yellow nose; yellow \"CSX\" lettering[citation needed]", 
            "link": null, 
            "name": "YN3"
        }, 
        {
            "def": "A Santa Fe locomotive in the early black scheme with white warning stripes.[251] CN Rail has also used this scheme on earlier locomotives.[252][253]", 
            "link": null, 
            "name": "Zebra Stripes"
        }, 
        {
            "def": "An intermodal train (such as the ZBRLC or ZLTLC). Such trains are commonly operated by BNSF and Union Pacific. Usually the hottest (fastest), highest priority train.[254]", 
            "link": null, 
            "name": "Z-Train"
        }
    ]
}