{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_cycling", 
    "words": [
        {
            "def": "a mountain bike with wheels that are approximately 27.5 inches in diameter, including a 2-inch-wide tire, and are based on ISO 584 mm (aka 650B) rims.a mountain bike with wheels that are approximately 29 inches in diameter, including a 2-inch-wide tire, and are based on ISO 622 mm (aka 700C) rims.a UCI rule stating the length and the width of the bicycle tubes cannot exceed the ratio of 3:1.[1][2]", 
            "link": "/wiki/27.5_Mountain_bike", 
            "name": " 27.5 Mountain bike 29er (bicycle)3:1 rule"
        }, 
        {
            "def": "Riding or going \"à bloc\" means giving it all you've got, going all out, riding as hard as one possibly can (which can be risky for it leaves one in a state where recovery is needed, and therefore vulnerable to being attacked). Example: \"I really gave it all in the last kilometers, although I didn't think it was possible until I crossed the line. I just went \"à bloc\".[3]", 
            "link": null, 
            "name": " À bloc"
        }, 
        {
            "def": "Extension of the handlebars usually allowing the rider to rest his elbows and benefit from improved aerodynamics. Often found on Time trial bicycles.[4]", 
            "link": "/wiki/Aero_bars", 
            "name": " Aero bars"
        }, 
        {
            "def": "A type of racing bike that combines the aerodynamic features of a time trial bicycle with a road racing bicycle.[5]", 
            "link": null, 
            "name": " Aero racing bicycle"
        }, 
        {
            "def": "A racing cyclist who excels in both climbing and time trialing, and may also be a decent sprinter. In stage races, an all-rounder is likely to place well in the General classification. Fausto Coppi, Eddy Merckx and Miguel Indurain were notable all-rounders; Bradley Wiggins, Alberto Contador, Vincenzo Nibali and Chris Froome are more contemporary examples. All-rounders are usually Team Leaders in both stage races and classics cycle races. The term all-rounder is also applied to a bicycle designed to function well for varied terrain and uses, unlike the typical bike today which is specifically designed for a narrow range of use and terrain.", 
            "link": null, 
            "name": " All-rounder"
        }, 
        {
            "def": "A bicycle race typically organized by bicycle messengers or couriers. Alleycat races seek to replicate some of the duties that a working messenger might encounter during a typical day. The races usually consist of previously undisclosed checkpoints, which are listed on a manifest, that a racer will have to go to; once at the checkpoint the racer will have his/her manifest updated. First racer to return with a completed manifest wins. Alleycats were first formalized in Toronto, Canada in 1989; however, messengers have been racing against each other for much longer. Recently, with the boom in urban cycling, many non-messengers have been participating in and organizing alleycat races.[6]", 
            "link": "/wiki/Alleycat_races", 
            "name": " Alleycat race"
        }, 
        {
            "def": "Endearing term to designate a cyclist's child. The latter tends to \"anchor\" the rider at his home. Not a pejorative term.[7]", 
            "link": null, 
            "name": " Anchor"
        }, 
        {
            "def": "From French, literally the \"rear of the peloton\" (main group of riders). Also called the Feu Rouge (red tail light) or Lanterne rouge.", 
            "link": null, 
            "name": " Arrière du peloton"
        }, 
        {
            "def": "To quickly accelerate while riding in a pack, or in smaller numbers, with a view to create a gap between yourself and other riders.[4]", 
            "link": null, 
            "name": " Attack"
        }, 
        {
            "def": "A bicycle built for randonneuring and audax rides. Functionally in-between a road racing bike and a touring bike. Usually equipped with fenders, dynamo-based lights and a small front or rear luggage rack.[8]", 
            "link": null, 
            "name": " Audax bicycle"
        }, 
        {
            "def": "A group of riders in a stage race (typically non-climbers and suffering domestiques) who ride together as a group on the mountain stages with the sole intention of finishing within the stage's time limit to allow them to start the next day. Also known by the Italian term gruppetto.[9]", 
            "link": "/wiki/Autobus_(cycling)", 
            "name": " Autobus"
        }, 
        {
            "def": "Colloquial noun meaning to a ride given to a second person on a bicycle. Not actually a real term. The correct term is 'CROGGIE' (UK English), see pump.[10]", 
            "link": "/wiki/Pillion", 
            "name": " Backie"
        }, 
        {
            "def": "Marks of road rash on a cyclist's body.[7]", 
            "link": null, 
            "name": " Bacon"
        }, 
        {
            "def": "A shift lever mounted as a bar-end plug. Used with drop bars on road bikes,[11] and on various under- and over-seat bars on recumbent bicycles or tricycles.[12]", 
            "link": null, 
            "name": " Bar-end shifter"
        }, 
        {
            "def": "See bar-end shifter.", 
            "link": null, 
            "name": " Barcon"
        }, 
        {
            "def": "A season-long time trial competition held in the UK.[13]", 
            "link": "/wiki/British_Best_All-Rounder", 
            "name": " British Best All-Rounder (BBAR)"
        }, 
        {
            "def": "Designates the part of the tire that clinches to the wheel's rim.[4]", 
            "link": null, 
            "name": " Bead"
        }, 
        {
            "def": "See Hors catégorie.", 
            "link": null, 
            "name": " Beyond category"
        }, 
        {
            "def": "Also department store bicycle or abbreviated as BSO, a cheaply produced but poor quality bicycle commonly sold in flat packs at big-box stores, mainstream stores and anywhere else but local bike shops.[14][15][16]", 
            "link": null, 
            "name": " Bicycle shaped object"
        }, 
        {
            "def": "A water bottle.[17]", 
            "link": null, 
            "name": " Bidon"
        }, 
        {
            "def": "A bike throw occurs in the final moments of a bike race, usually within the last few feet. A sprint is involved, and at the end of the sprint, the rider pushes his arms forward, stretches his back out, and attempts to move his bike as far forward as possible, getting to the finish line before his competitors.[18]", 
            "link": null, 
            "name": " Bike throw"
        }, 
        {
            "def": "Riders of one team who set a relatively slow tempo at the front of a group to control the speed, often to the advantage of one of their teammates who may be in a break.[4]", 
            "link": null, 
            "name": " Blocking"
        }, 
        {
            "def": "A rider who has gone into oxygen debt and loses the ability to maintain pace is said to have blown up, variations include popping, exploding and detonating. This is a more temporary condition than cracking or hitting the wall.[19]", 
            "link": null, 
            "name": " Blow up"
        }, 
        {
            "def": "Sunday afternoon riders who wear team-replica clothing but are highly inexperienced.", 
            "link": null, 
            "name": " Bonnie T-shirt Brigade"
        }, 
        {
            "def": "Fabric shoe covers worn by cyclists to protect their feet from rain.[20]", 
            "link": null, 
            "name": " Booties"
        }, 
        {
            "def": "The bearing assembly which allows the crank to rotate relative to the frame. May or may not include the spindle which connects the two arms, depending on the standard to which it was designed.[4][19]", 
            "link": null, 
            "name": " Bottom bracket"
        }, 
        {
            "def": "Breakaway, or break in short, is when a small group of riders or an individual have successfully opened a gap ahead of the peloton.[4]", 
            "link": null, 
            "name": " Breakaway"
        }, 
        {
            "def": "A breakaway specialist is a rider who is specialized in attacking the race from the start in order to show off his sponsor and to try his luck in winning the stage without having to fight with the whole peloton at the finish line.", 
            "link": "/wiki/Breakaway_specialist", 
            "name": " Breakaway specialist"
        }, 
        {
            "def": "see randonnée.", 
            "link": null, 
            "name": " Brevet"
        }, 
        {
            "def": "(randonneuring) The card or booklet used for collecting stamps that certify that you have visited the controls on a brevet ride.", 
            "link": null, 
            "name": " Brevet card"
        }, 
        {
            "def": "A rider who is a slow climber but an efficient descender.[9]", 
            "link": null, 
            "name": " Brick"
        }, 
        {
            "def": "When a lone rider or smaller group of riders closes the space between them and the rider or group in front of them. This term often refers to when riders catch up with the main pack (or peloton) of riders or those who are leading the race.[19]", 
            "link": null, 
            "name": " Bridge"
        }, 
        {
            "def": "A support vehicle following a group of cyclists in a race, tour or recreational ride that may carry equipment, food, rider luggage, or mechanics. May also pick up riders unable to continue. Also called a SAG wagon.[19][21][22][23]", 
            "link": "/wiki/Broom_wagon", 
            "name": " Broom wagon"
        }, 
        {
            "def": "Synonym of Peloton.[19]", 
            "link": null, 
            "name": " Bunch"
        }, 
        {
            "def": "The riders arrive near the finish in massive numbers to contest the victory and attempt to draft their sprinters in a good position to claim the victory. Speeds higher than 60 km/h are to be expected.[17]", 
            "link": null, 
            "name": " Bunch sprint"
        }, 
        {
            "def": "To cause one's bicycle to become airborne by lifting the front wheel and then the rear wheel into the air with such timing that both wheels are simultaneously airborne for a period. Bunny hops are performed either to navigate course features, to perform tricks or to avoid obstacles, depending on the discipline of competition.[4]", 
            "link": "/wiki/Bunny_Hop", 
            "name": " Bunny Hop"
        }, 
        {
            "def": "The rate at which a cyclist pedals (in revolutions per minute).[4]", 
            "link": "/wiki/Cadence_(cycling)", 
            "name": " Cadence"
        }, 
        {
            "def": "The rider on a tandem bike steering the bike.[24] Also pilot.", 
            "link": null, 
            "name": " Captain"
        }, 
        {
            "def": "The team cars following behind the peloton in support of their racers. Also designates the publicity cars that precede.[17]", 
            "link": null, 
            "name": " Caravane"
        }, 
        {
            "def": "The rear cog cluster on a derailleur bicycle, that fits on a freehub. It consists only of cogs, with no ratcheting mechanism, as the ratcheting mechanism is in the freehub.[19]", 
            "link": "/wiki/Cogset", 
            "name": " Cassette"
        }, 
        {
            "def": "A group of cyclists cycling in a close knit formation akin to a road race, normally for the purposes of training.[9]", 
            "link": "/wiki/Chain_gang_(cycling)", 
            "name": " Chain gang"
        }, 
        {
            "def": "Annoying slapping of the bike's chain against the chainstays while riding over rough terrain.[25]", 
            "link": null, 
            "name": " Chain slap"
        }, 
        {
            "def": "The tendency of a chain to stick to chain rings and be sucked up into the bike instead of coming off the chainring. Primarily caused by worn chainrings and rust on small chain rings, under high loads, and in dirty conditions.[4]", 
            "link": null, 
            "name": " Chain suck"
        }, 
        {
            "def": "The front part of the drivetrain where the chain engages. May be composed of one to three gears.[4]", 
            "link": "/wiki/Crankset", 
            "name": " Chainring(s) "
        }, 
        {
            "def": "One of the two frame tubes that run horizontally from the bottom bracket shell back to the rear dropouts.[4]", 
            "link": null, 
            "name": " Chainstay"
        }, 
        {
            "def": "A group of one or more riders who are ahead of the peloton trying to join the race or stage leader(s). There may be none, one, or many chases at any given point in a race.[4]", 
            "link": null, 
            "name": " Chase"
        }, 
        {
            "def": "A sequence of tight turns, often s-shaped, usually most important near the finish of a road-race or during a criterium.", 
            "link": null, 
            "name": " Chicane"
        }, 
        {
            "def": "The stage of the 1910 Tour de France in the Pyrenees that included the cols: Peyresourde, Aspin, Tourmalet and Aubisque, was named the \"Circle of Death\". Now the hardest mountain stage in the Tour takes on this name.[26]", 
            "link": null, 
            "name": " Circle of death"
        }, 
        {
            "def": "A one-day race of great prestige. Some classics date back to the 19th century.[3][17]", 
            "link": "/wiki/Cycling_classic", 
            "name": " Classic "
        }, 
        {
            "def": "A rider who specializes in riding uphill quickly, usually due to having a high power-to-weight ratio.", 
            "link": "/wiki/Climbing_specialist", 
            "name": " Climber"
        }, 
        {
            "def": "Pedals with a locking mechanism for cleats.", 
            "link": "/wiki/Clipless_pedals", 
            "name": " Clipless pedals"
        }, 
        {
            "def": "A type of tire that uses a bead around the edge of the tire to attach to the rim of the wheel when inflated. The inner tube is separate.[4]", 
            "link": null, 
            "name": " Clincher"
        }, 
        {
            "def": "A strategic move during a sprint where the leader is less than a bike length ahead of a stronger sprinter and said stronger sprinter is between the leader and the course wall. Leader angles towards the wall narrowing the lane thus making it impossible for the stronger sprinter to get past the leader.", 
            "link": null, 
            "name": " Closing the door"
        }, 
        {
            "def": "A dented gear that is part of the cassette.[19]", 
            "link": null, 
            "name": " Cog"
        }, 
        {
            "def": "A race judge, in road-racing they are usually based in a car following the event.[3]", 
            "link": "/wiki/Commissaire_(cycling)", 
            "name": " Commissaire"
        }, 
        {
            "def": "An attack that is made when a break has been caught by chasers or the peloton.[27]", 
            "link": null, 
            "name": " Counterattack"
        }, 
        {
            "def": "Literally \"Jackal Trick\",[28] also known as \"Cancellara's Trick\". Surprise attack in the two last kilometers to detach from the peloton and, finally, win the race.", 
            "link": null, 
            "name": " Coup de Chacal"
        }, 
        {
            "def": "When a cyclist runs out of strength or energy, they are said to have cracked. Compare with hit the wall.[29]", 
            "link": null, 
            "name": " Crack"
        }, 
        {
            "def": "A crank. One of the two arms of a crankset. Each arm connects a pedal to the bottom bracket.", 
            "link": "/wiki/Crank_arm", 
            "name": " Crank arm"
        }, 
        {
            "def": "The bicycle drivetrain assembly that converts the rider's reciprocating pedaling action to rotating motion. It consists of two cranks (or arms), one or more chainwheels (or chainrings), plus the stack bolts that connect them. Sometimes the bottom bracket is included.[30]", 
            "link": "/wiki/Crankset", 
            "name": " Crankset"
        }, 
        {
            "def": "A race on a closed short distance course with multiple laps. Often but not always a 4-cornered course; often includes primes (short for premiums and rhymes with 'seems') which are points or prizes for intermediate laps. Course length varies from 800 meters to 5 kilometers.[4]", 
            "link": "/wiki/Criterium", 
            "name": " Criterium"
        }, 
        {
            "def": "Short for cyclocross bicycle.[31]", 
            "link": "/wiki/Cross_bike", 
            "name": " Cross bike"
        }, 
        {
            "def": "A form of bicycle racing that consists of many laps of a short course featuring pavement, wooded trails, grass, steep hills and obstacles requiring the rider to quickly dismount, carry the bike past some obstacles and remount.[19]", 
            "link": "/wiki/Cyclocross", 
            "name": " Cyclocross"
        }, 
        {
            "def": "(French: danser - to dance) - riding out of the saddle, standing up, usually in a taller gear than normal, and rocking side to side for leverage. The phrase dancing on the pedals is related.[9]", 
            "link": null, 
            "name": " Danseuse"
        }, 
        {
            "def": "A device used to change gears, activated by shifters.[17]", 
            "link": "/wiki/Derailleur", 
            "name": " Derailleur "
        }, 
        {
            "def": "A cyclist who excels at fast descents, often using them to break away from a group, or bridge a gap.[32]:66", 
            "link": null, 
            "name": " Descender"
        }, 
        {
            "def": "Colloquial name for an Elimination race, an endurance track event where the last rider across the finish line is eliminated every two laps (from the phrase \"the Devil takes the hindmost\").[17]", 
            "link": "/wiki/Elimination_race", 
            "name": " Devil "
        }, 
        {
            "def": "A rider who has an even energy output, without any bursts of speed, is said to be a diesel or diesel engine.[9]", 
            "link": null, 
            "name": " Diesel"
        }, 
        {
            "def": "Team manager.[17]", 
            "link": "/wiki/Directeur_sportif", 
            "name": " Directeur sportif"
        }, 
        {
            "def": "A rider whose job it is to support and work for other riders in their team (literally \"servant\" in French). Today the term has lost its bad connotation and serves as an acknowledgement of the true nature of racing tactics. See also water carrier.[21]", 
            "link": "/wiki/Cycling_domestique", 
            "name": " Domestique"
        }, 
        {
            "def": "A term used when a rider collides with the open door of a parked car while cycling.[33]", 
            "link": "/wiki/Door_zone", 
            "name": " Door prize"
        }, 
        {
            "def": "To ride closely behind another rider to make maximum use of their slipstream, reducing wind resistance and effort required to ride at the same speed.[19]", 
            "link": "/wiki/Drafting_(racing)", 
            "name": " Drafting"
        }, 
        {
            "def": "To be dropped is to be left behind a breakaway or the peloton for whatever reason (usually because the rider cannot sustain the tempo required to stay with the group). To drop someone is to accelerate strongly with the intent of causing following riders to no longer gain the benefit of drafting.[27]:238", 
            "link": null, 
            "name": " Drop"
        }, 
        {
            "def": "A steep section of a mountain bike trail.[34]", 
            "link": null, 
            "name": " Drop-off"
        }, 
        {
            "def": "The slot, of various sizes and orientations, in the frame that the axles of the wheels attach to.[4]", 
            "link": "/wiki/Dropout_(bicycle_part)", 
            "name": " Dropout"
        }, 
        {
            "def": "(French) a line of riders seeking maximum drafting in a crosswind, resulting in a diagonal line across the road.[4][19]", 
            "link": "/wiki/Echelon_formation", 
            "name": " Echelon"
        }, 
        {
            "def": "An Endo (short for end-over-end), is when the back wheel of the bike is lifted off the ground and the bike goes up onto its front wheel only. It can also be used to designate a crash that is similar to an unintended front flip.[4]", 
            "link": null, 
            "name": " Endo"
        }, 
        {
            "def": "see sportive", 
            "link": null, 
            "name": " Endurance bicycle"
        }, 
        {
            "def": "(French: hope) Age class for riders 19 to 22.[35] Also called U23.[36]", 
            "link": null, 
            "name": " Espoir"
        }, 
        {
            "def": "A stage of a stage race.[17]", 
            "link": null, 
            "name": " Étape"
        }, 
        {
            "def": "A low-gradient climb, usually occurring partway up a steeper climb. So-called because while it may look deceptively flat and easy (especially after the steep climb preceding it), it is still a climb.[37]", 
            "link": null, 
            "name": " False flat"
        }, 
        {
            "def": "A rider who has superior sprinting speed over the last few hundred meters of a race.[38]", 
            "link": null, 
            "name": " Fast finisher"
        }, 
        {
            "def": "In road bicycle racing, a location along the course of a long race where team personnel hand musettes containing food and beverages to passing riders. In mountain bicycle racing, a limited section of the course in which riders may accept food from non-racing assistants. Sometimes this is combined with the technical assistance zone if one exists.[19]", 
            "link": null, 
            "name": " Feed zone"
        }, 
        {
            "def": "A group of riders, also known as a peloton.[4]", 
            "link": null, 
            "name": " Field"
        }, 
        {
            "def": "Slang for a fixed-gear bicycle.[39]", 
            "link": null, 
            "name": " Fixed"
        }, 
        {
            "def": "Slang for a fixed-gear bicycle.[40]", 
            "link": null, 
            "name": " Fixie"
        }, 
        {
            "def": "A red flag displayed with one kilometer remaining from the finish line of a race. Usually suspended over the road.[17]", 
            "link": null, 
            "name": " Flamme rouge"
        }, 
        {
            "def": "The ability to follow a wheel is the ability to match the pace of riders who are setting the tempo. Following is easier than pulling or setting the tempo and the term can be used in a derogatory manner, e.g. \"He only ever followed\".[17]", 
            "link": null, 
            "name": " Follow a wheel"
        }, 
        {
            "def": "Part of the frameset that holds the front wheel. Can be equipped with a suspension on mountain bikes.[17]", 
            "link": null, 
            "name": " Fork"
        }, 
        {
            "def": "The bicycle frame plus the front fork.[41]", 
            "link": "/wiki/Frameset", 
            "name": " Frameset"
        }, 
        {
            "def": "Disparaging term for any cyclist who \"is marching to the beat of a different drummer\", or a novice cyclist.[9]", 
            "link": null, 
            "name": " Fred"
        }, 
        {
            "def": "Alternatively wanton and furious cycling or furious riding; a minor statutory offence in England and Wales and Northern Ireland applied to cyclists who cycle over the national speed limit.[42]", 
            "link": "/wiki/Causing_bodily_harm_by_wanton_or_furious_driving", 
            "name": " Furious cycling"
        }, 
        {
            "def": "A distance between two or more riders large enough for drafting to no longer be effective. Also used as verb (US English), for example: \"Contador has gapped Armstrong!\". It's much easier for a stronger rider to pull ahead of others once a gap has been achieved; without a gap, the others can draft along using significantly less power to sustain the same speed as the rider in front. While gaps are usually achieved through attacks, on mountain climbs, where slower speeds means the advantage of drafting is much less significant, riders are often gapped who simply cannot maintain the tempo of the faster riders. A gap can also refer to the space in between a jump and the landing, which is common in mountain biking.[21]", 
            "link": null, 
            "name": " Gap"
        }, 
        {
            "def": "Abbr.: general classification. the timing splits used to determine who is winning in a stage race. calculated from the first rider over the line each day time is then measured back by gaps from the winner of the day. Time gaps are then calculated back between riders and added to the overall position of riders relative to each other. Riders can attack in stage races for time rather than winning the days stage. They are said to be \"riding for G.C.\". In such circumstances alliances can form where some riders in a breakaway will work to help others win the days stage despite not contesting the finish as the overall gap the breakaway gains helps them \"on G.C.\"[19][21]", 
            "link": null, 
            "name": " G.C."
        }, 
        {
            "def": "Two meanings related to each other:", 
            "link": null, 
            "name": " Granny Gear"
        }, 
        {
            "def": "A type of racing bicycle similar to one used in cyclo-cross but geared towards gravel roads common in the United States and Europe.[44]", 
            "link": null, 
            "name": " Gravel bike"
        }, 
        {
            "def": "A set of parts usually from a single manufacturer, usually consisting of, at least, bottom bracket, brakes, derailleurs, hubs and shifters, and may also include headset, pedals, and seatpost. A kit is a group, plus everything else a frameset needs to make a complete bicycle.[45]", 
            "link": "/wiki/Groupset", 
            "name": " Group or Groupset"
        }, 
        {
            "def": "see autobus.[9]", 
            "link": null, 
            "name": " Gruppetto"
        }, 
        {
            "def": "In an echelon, where the size of a draft is limited by the width of the road, to be left with no good position to join the group and be sheltered from the crosswind.[46]", 
            "link": null, 
            "name": " Guttered"
        }, 
        {
            "def": "A rider that rides half a wheel in front of another on training rides and group rides. No matter how much the pursuer speeds up to keep up with him/her, s/he stays that distance ahead. Usually these people are frowned upon and less desirable to ride with.[47]", 
            "link": null, 
            "name": " Half-wheel or Half-wheeler"
        }, 
        {
            "def": "To ride fast.[4][19][48]", 
            "link": null, 
            "name": " Hammer"
        }, 
        {
            "def": "A style of road racing in Australasia where riders are given different start times, calculated based on their previous performance, so that slower riders have a chance of winning.[49]", 
            "link": null, 
            "name": " Handicap"
        }, 
        {
            "def": "A bicycle that does not have a rear suspension system.[4][7]", 
            "link": null, 
            "name": " Hardtail"
        }, 
        {
            "def": "The bearing system in the head tube within which the handlebars rotate.[4][19]", 
            "link": "/wiki/Headset_(bicycle_part)", 
            "name": " Headset"
        }, 
        {
            "def": "A short distance uphill race, usually an individual time trial over approx. 3–5 km. See Hillclimbing (cycling).", 
            "link": null, 
            "name": " Hill climb (race)"
        }, 
        {
            "def": "To completely run out of energy on a long ride, also known as \"bonking\".[9]", 
            "link": "/wiki/Hit_the_wall", 
            "name": " Hit the wall"
        }, 
        {
            "def": "The French term primarily used in cycle races (most notably, the Tour de France) to designate a climb that is \"beyond categorization\", an incredibly tough climb. Most climbs are designated from Category 1 (hardest) to Category 4 (easiest), based on both steepness and length. A climb that is harder than Category 1 is designated as hors catégorie.[17]", 
            "link": null, 
            "name": " Hors catégorie (HC)"
        }, 
        {
            "def": "French for \"out of time\", when a rider has finished outside the time limit in a race and is eliminated.[50]", 
            "link": null, 
            "name": " Hors délai (HD)"
        }, 
        {
            "def": "Also shortened to \"the knock\". See hit the wall.[9]", 
            "link": null, 
            "name": " Hunger knock"
        }, 
        {
            "def": "A bicycle that is a compromise between a road bike and a mountain bike. Often chosen by cyclists for its comfort.[19]", 
            "link": "/wiki/Hybrid_bicycle", 
            "name": " Hybrid"
        }, 
        {
            "def": "Race where riders set off at fixed intervals and complete the course against the clock.[27]:19", 
            "link": "/wiki/Individual_time_trial", 
            "name": " Individual time trial"
        }, 
        {
            "def": "To keep a race or a tour active there may be points along the course where the riders will sprint for time bonuses or other prizes.[27]:52 Also known as the \"Traguardo Volante\" (TV) in Italian.", 
            "link": null, 
            "name": " Intermediate sprint"
        }, 
        {
            "def": "A class of independent rider in the Tour de France. Also called a Touriste-Routier or Individuel.[51][52]", 
            "link": null, 
            "name": " Isolés"
        }, 
        {
            "def": "To aggressively increase speed without warning, hopefully creating a substantial advantage over your opponents. Also (more usually) denoting an attempt to bridge a gap from the peloton or gruppetto to a breakaway. For example: \"he is trying to jump across\".[citation needed]A bike shop jargon used usually by customers to explain vaguely how the bicycle got damaged when it get bought back in to claim manufacturer's warranty.[53]", 
            "link": null, 
            "name": " Jump Just riding along (JRA)"
        }, 
        {
            "def": "The keirin is a 2000-meter track event where the riders start the race in a group behind a motorised derny. The derny paces the riders for 1400 meters and then pulls off the track, at which time the cyclists begin a sprint to the finish line. Keirin racing has traditionally been practised in Japan, where it has been a professional sport for over 20 years, and only in which pari-mutuel betting on the riders is permitted.", 
            "link": "/wiki/Keirin", 
            "name": " Keirin"
        }, 
        {
            "def": "Accelerating quickly with a few pedal strokes in an effort to break away from other riders (e.g. \"Contador kicks again to try to rid himself of Rasmussen\")[54]", 
            "link": null, 
            "name": " Kick"
        }, 
        {
            "def": "The title given to the best climber in a cycling road race. Also known as Gran Premio della Montagna (GPM) in Italian cycling.", 
            "link": "/wiki/King_of_the_Mountains", 
            "name": " King of the Mountains"
        }, 
        {
            "def": "A group, plus everything else a frameset needs to make a complete bicycle.[45]", 
            "link": null, 
            "name": " Kit"
        }, 
        {
            "def": "Is said of a rider who climbs very well but is a poor descender.[9]", 
            "link": null, 
            "name": " Kite"
        }, 
        {
            "def": "Referred to as \"the knock\". Short for \"hunger knock\". See hit the wall.[9]", 
            "link": null, 
            "name": " Knock"
        }, 
        {
            "def": "French for \"released\", see drop.", 
            "link": null, 
            "name": " Laché"
        }, 
        {
            "def": "French for \"red lantern\", as found at the end of a railway train, and the name given to the rider placed last in a race.[9][17]", 
            "link": "/wiki/Lanterne_rouge", 
            "name": " Lanterne rouge"
        }, 
        {
            "def": "Same as autobus. Riders who collect together in a road race just concerned with making it to the finish \"in the time\" so as not to be disqualified or \"swept up\". Members of the laughing group are not concerned with contesting the finish.", 
            "link": null, 
            "name": " Laughing group"
        }, 
        {
            "def": "Sprinting technique often used by the lead out man where the rider will accelerate to maximum speed close to the sprint point with a teammate, the sprinter, drafting behind, hoping to create space between the sprinter and the pack. When the lead out man is exhausted he will move to the side to allow his teammate to race in the sprint. Often a line of lead out men will be used to form a lead out train to drive the speed higher and higher (and to reduce the chances of other riders attacking) over the closing stages of a race. The purpose of a lead out is for the sprinter to achieve high speed at the sprint approach using as little of his own energy as possible, so he has as much energy as possible for the final sprint.[4][17]", 
            "link": null, 
            "name": " Lead out"
        }, 
        {
            "def": "A rider who drafts behind others to reduce his effort, but does not reciprocate. Also wheelsucking.[55]", 
            "link": null, 
            "name": " Leech"
        }, 
        {
            "def": "First riders to depart in a handicap race.[9]", 
            "link": null, 
            "name": " Limit"
        }, 
        {
            "def": "The madison is a mass-start track event comprising teams of two riders per team. It is similar to a team points race, as points are awarded to the top finishers at the intermediate sprints and for the finishing sprint. Only one of the two team riders is racing on the track at any one time, riding for a number of laps, and then exchanging with his partner by a hand sling. The name comes from the original Madison Square Garden, which was constructed as a velodrome.[56][57]", 
            "link": "/wiki/Madison_(cycling)", 
            "name": " Madison"
        }, 
        {
            "def": "The situation where a mechanic in a support vehicle will appear to be making adjustments to the bike but in reality they are giving fatigued riders a break by holding onto the car and getting a massive push-off when the commissaires get too close.[58]", 
            "link": null, 
            "name": " Magic spanner"
        }, 
        {
            "def": "French for Yellow Jersey.", 
            "link": null, 
            "name": "Maillot Jaune"
        }, 
        {
            "def": "Abbreviation of middle-aged men in lycra, a popular bicycle buying demographic for high-end bicycles[59][60][61][62]", 
            "link": "/wiki/MAMIL", 
            "name": " MAMIL"
        }, 
        {
            "def": "Lifting the front wheel off the ground by the shifting of the rider's weight.[63]", 
            "link": null, 
            "name": " Manual"
        }, 
        {
            "def": "The cyclist starting in a time trial either a minute ahead or behind another rider.[64]", 
            "link": null, 
            "name": " Minute man"
        }, 
        {
            "def": "Mountain biking, or a mountain bike.[4]", 
            "link": null, 
            "name": " MTB"
        }, 
        {
            "def": "Small lightweight cotton shoulder bag, containing food and drink given to riders in a feed zone during a cycle race. The bag is designed so that it can be easily grabbed by a moving rider. The shoulder strap is placed over the head and one shoulder, the contents are then removed and placed into jersey pockets or bottles (bidons) are placed into bottle cages. The bag is then discarded.[65]", 
            "link": null, 
            "name": " Musette"
        }, 
        {
            "def": "Dutch for wall. A short, steep climb. Originates from the Tour of Flanders locations such as Muur van Geraardsbergen and Koppenberg.[66]", 
            "link": null, 
            "name": " Muur"
        }, 
        {
            "def": "A first year professional.[54]", 
            "link": null, 
            "name": " Neo-pro"
        }, 
        {
            "def": "A non-competitive segment of a bicycle race during which competitors have to stay behind the lead vehicles[67]", 
            "link": null, 
            "name": " Neutral zone"
        }, 
        {
            "def": "To win a race solo, without any competitors in view. The \"victory pose\" shows only the winner.[54]", 
            "link": null, 
            "name": " No One Else In The Picture"
        }, 
        {
            "def": "lifting the rear wheel of the bike using the front brake and shifting the rider's weight forward.[68] A stoppie in motorcycling.", 
            "link": null, 
            "name": " nose wheelie"
        }, 
        {
            "def": "Getting dropped from the group/peloton.[4][19]", 
            "link": null, 
            "name": " Off The Back"
        }, 
        {
            "def": "A multi-stage track cycling event whose composition has varied in the past. When reintroduced to the UCI World Championships in 2007, six omnium events have been held, while the European Track Championships have a different set omnium events.[32]:149", 
            "link": "/wiki/Omnium", 
            "name": " Omnium"
        }, 
        {
            "def": "Is said of a rider who relies exclusively on good diet and exercise to perform in races. This type of rider refuses to use any form of doping. Can also be said of a performance realised while racing clean at the time the result was achieved. (Example: \"I won the criterium on bread and water but then the big race came and ...\")[citation needed]", 
            "link": null, 
            "name": " On Bread And Water"
        }, 
        {
            "def": "A rider who is riding at maximum speed. When riding at maximum power output, a road racer often perches on the front tip of the saddle (seat), where the shell of an old-style leather saddle would be attached to the saddle frame with a rivet.[54]", 
            "link": null, 
            "name": " On the rivet"
        }, 
        {
            "def": "The condition of being very close to the rear wheel of the rider ahead of you. Used to inform the rider that you have positioned yourself in their slipstream for optimum drafting. For example: \"I'm on your wheel\".[69]", 
            "link": null, 
            "name": " On your wheel"
        }, 
        {
            "def": "Unexpected and sudden dismount, either caused by braking too hard with the front wheel or by a road hazard.[4]", 
            "link": null, 
            "name": " Over the bars"
        }, 
        {
            "def": "Riding in a position such that the leading edge of one's front wheel is ahead of the trailing edge of the rear wheel of the bicycle immediately ahead. Overlap is potentially dangerous because of the instability that results if the wheels rub, and the simple fact that it allows the trailing rider to turn only in one direction (away from the wheel of the rider ahead). In road bicycle racing, overlap can be a significant cause of crashes, so beginning riders are instructed to \"protect your front wheel\" (avoid overlap) whenever riding in a pack.[citation needed]", 
            "link": null, 
            "name": " Overlap"
        }, 
        {
            "def": "Group of riders riding at high speed by drafting one another. Riders will take turns at the front to break the wind, then rotate to the back of the line to rest in the draft. Larger group rides will often form double pacelines with two columns of riders. Sometimes referred to as \"bit and bit\".[70]", 
            "link": null, 
            "name": " Paceline"
        }, 
        {
            "def": "Verb, meaning to quit a ride (typically a race) prematurely.[citation needed]", 
            "link": null, 
            "name": " Pack"
        }, 
        {
            "def": "A list of races a rider has won. (French, meaning list of achievements or list of winners).", 
            "link": null, 
            "name": " Palmarès"
        }, 
        {
            "def": "Style and/or courage, displayed for example by breaking away, taking pulls at the front of the group, remounting after a crash or riding while suffering injuries. Example: \"This rider insisted on continuing the race after the crash. After he crossed the line 100 kilometers later, doctors found out that he had 3 cracked vertebrae and 2 broken ribs.\"[19]", 
            "link": null, 
            "name": " Panache"
        }, 
        {
            "def": "A basket, bag, box, or similar container, carried in pairs attached to the frame, handle bars, or on racks attached above the wheels of a bicycle. Panniers are used by commuters and touring cyclists in the same way hikers and campers use backpacks, as a means to pack and carry gear, clothing and other supplies and items. The term derives from the Old French, from Classical Latin, word for bread basket.[71]", 
            "link": "/wiki/Pannier", 
            "name": " Pannier"
        }, 
        {
            "def": "The profile of the race or stage route. (French, course, nm.)[citation needed]", 
            "link": null, 
            "name": " Parcours"
        }, 
        {
            "def": "Pedaling smoothly and efficiently.[citation needed]", 
            "link": null, 
            "name": " Pedaling circles"
        }, 
        {
            "def": "Riding with considerable fatigue such that the rider is unable to maintain an efficient pedaling form that is strong and smooth.[54]", 
            "link": null, 
            "name": " Pedaling squares"
        }, 
        {
            "def": "(from French, literally meaning little ball or platoon and also related to the English word pellet) is the large main group in a road bicycle race. May also be called the field, bunch, or pack. Riders in a group save energy by riding close (drafting or slipstreaming) near and, particularly behind, other riders. The reduction in drag is dramatic; in the middle of a well-developed group it can be as much as 40%.[72]", 
            "link": "/wiki/Peloton", 
            "name": " Peloton"
        }, 
        {
            "def": "Originating from the popular nickname of a famous Latin American cyclist, \"pep\" is used as a verb meaning \"to carelessly and heedlessly ford (as in a small body of water).\" For example, \"pep\" could be used in the sentence \"I'm going to pep this creek\".[citation needed]", 
            "link": null, 
            "name": " Pep"
        }, 
        {
            "def": "See captain.", 
            "link": null, 
            "name": " Pilot"
        }, 
        {
            "def": "(UK) A form of theft that specialises in stealing parts from parked and locked bicycles to the eventual point that very little is left of the bike.[73]", 
            "link": null, 
            "name": " Piranha (piranha’d)"
        }, 
        {
            "def": "Lifting the front wheel of the bicycle in the air and jumping up and down on the rear wheel while in a stationary position.[4]", 
            "link": null, 
            "name": " Pogo"
        }, 
        {
            "def": "A randonneuring ride shorter than 200 km. Sometimes organized as an introduction to randonneuring.", 
            "link": null, 
            "name": " Populaire"
        }, 
        {
            "def": "From French, literally \"pursuing\" - refers to a cyclist or group of cyclists who are separated from and behind the leader(s) (tête de la course) but in front of the main group (peloton). This usually occurs when a small number of riders attempt to catch up to the leaders, either to join with them or to \"bring them back to the pack\" by encouraging the main group to chase them down.[17]", 
            "link": null, 
            "name": " Poursuivant"
        }, 
        {
            "def": "The rate at which effective energy is being transferred by the cyclist's legs. Measured through a power meter and normally expressed in watts.[citation needed]", 
            "link": "/wiki/Power_(physics)", 
            "name": " Power"
        }, 
        {
            "def": "Primes (pronounced preems, after the French word for \"gift\" (often incorrectly spelled \"premes\") are intermediate sprints within a race, usually offering a prize and/or points. Primes are a way to encourage more competitive riding, and also an opportunity for companies to gain publicity by sponsoring a prime. In a criterium, a bell is sounded on the lap preceding the prime sprint at the appropriate line for that prime sprint. The line used for prime sprints need not be the same as the start or finish line. Primes may be either predetermined for certain laps or spontaneously designated under the supervision of the Chief Referee. All primes won shall be awarded to riders even if they withdraw from the race. Lapped riders are not eligible for primes except in the following situation: when a breakaway has lapped the main field, riders in the main field and the breakaway riders are then both eligible for primes. When primes are announced for a given group, only riders in that group or behind it at the beginning of the prime lap are eligible. Prizes can be cash, merchandise, or points, depending on the race.[19]", 
            "link": null, 
            "name": " Prime"
        }, 
        {
            "def": "An individual time trial of usually less than 8 km (5 mi) before a stage race, used to determine which rider wears the leader's jersey on the first stage.[27]", 
            "link": null, 
            "name": " Prologue"
        }, 
        {
            "def": "To take the lead on a paceline or echelon.[4]", 
            "link": null, 
            "name": " Pull"
        }, 
        {
            "def": "To pull back time is to make up time on another rider who is ahead on G.C. \"he needs to \"pull back\" two minutes if he wants to get in yellow\".[citation needed]", 
            "link": null, 
            "name": " Pull back time"
        }, 
        {
            "def": "to work to reduce the lead of a breakaway, also used as \"he needs to pull him back\" or \"they need to pull him back\".[citation needed]", 
            "link": null, 
            "name": " Pull it back"
        }, 
        {
            "def": "colloquial verb meaning to give a second person a ride on a bicycle, also known as giving a hike. The passenger may balance on the handlebars or the seat, while the biker stands to pedal.[citation needed]", 
            "link": null, 
            "name": " Pump"
        }, 
        {
            "def": "It is a type of road bicycle racer that specializes in rolling terrain with short but steep climbs. Ideal races for this type of rider are the one-day classics in spring. These races are characterized by hills that are a 10-20% grade and 1–2 km long, examples include the Liège–Bastogne–Liège, the Mur de Huy in the Flèche Wallonne and the Manayunk Wall in the Philadelphia International Championship. The physique of this type of rider allows them to escape from the peloton through quick bursts usually with the assistance of a teammate. Examples of such racers include Philippe Gilbert, Paolo Bettini, Danilo Di Luca and Peter Sagan, who are able to sprint their way up the shorter climbs to win a stage or a single-day race. However, their lower endurance is a disadvantage in stage races where the climbs are usually longer 5–20 km, albeit at lower gradients 5-10%.[74][75][76]", 
            "link": "/wiki/Puncheur", 
            "name": " Puncheur"
        }, 
        {
            "def": "The stage of a multi-day road race which is deemed the hardest, most demanding and most prestigious stage of the race.[77][78]", 
            "link": null, 
            "name": " Queen stage"
        }, 
        {
            "def": "A ride in the randonneuring discipline of cycling, usually 200–600 km long. Also known as a brevet.", 
            "link": null, 
            "name": " Randonnée"
        }, 
        {
            "def": "A long-distance discipline of cycling where riders attempt courses from 200 to over 1200 km, collecting stamps at controls with the clock running constantly. Every participant finishing within minimum and maximum time limits is considered winner regardless of finishing order. Rides may ride in a group or solo as they please, and are expected to be self-sufficient between controls. Randonneuring is not regulated by UCI.", 
            "link": "/wiki/Randonneuring", 
            "name": " Randonneuring"
        }, 
        {
            "def": "A bicycle or tricycle where the rider is placed in a laid-back position, feet first and sitting in a seat instead of on a saddle. Usually used for ergonomics or aerodynamics. All world land speed records are held by (enclosed) recumbent bicycles, but they are not allowed in races governed by the UCI.[79]", 
            "link": "/wiki/Recumbent_bicycle", 
            "name": " Recumbent"
        }, 
        {
            "def": "A bicycle without any suspension system.[7]", 
            "link": "/wiki/Stiffness", 
            "name": " Rigid"
        }, 
        {
            "def": "An experienced rider who organises and marshals the team's riders in a road race, including instructing team-mates regarding tactical decisions and improvising new tactics when pre-race plans are overtaken by events on the road. They are the key link between the directeur sportif and the rest of the team. Road captains are normally selected on a race-by-race basis depending on the demands of the event and their relationship with the team leader. Notable road captains in recent years include Bernhard Eisel, Luca Paolini, Mick Rogers and David Millar.[80][81]", 
            "link": null, 
            "name": " Road captain"
        }, 
        {
            "def": "A race on pavement. Longer in distance than criteriums.[19]", 
            "link": null, 
            "name": " Road race"
        }, 
        {
            "def": "Severe skin abrasions caused from sliding on the asphalt in a crash.[4][7]", 
            "link": "/wiki/Road_rash", 
            "name": " Road rash"
        }, 
        {
            "def": "A type of trainer composed of rolling cylinders under the rear wheel linked to a single rolling cylinder under the front wheel which allow the rider to practice balance while training indoors.[19]", 
            "link": null, 
            "name": " Rollers"
        }, 
        {
            "def": "Weight (more correctly mass) that is rotating while the bike is moving, particularly the wheels. Mass near the outside edge of a wheel has about twice the stored energy of a similar non-rotating mass moving at the same speed. A bicycle wheel can be considered to be a good approximation of a hollow cylinder with most of its mass at or near the rim. The rotation of cranks, wheel hubs, and other parts are of less significance because both their radius and speed of rotation (angular velocity) are small. All mass resists changes in velocity (acceleration or deceleration) due to inertia. This resistance is noticeably greater where rotational inertia is also a significant component, so lighter wheel rims, spoke nipples, and tires will permit faster acceleration (or the same acceleration for less expenditure of energy). This effect is much reduced at lower speeds such as during hill climbing.[citation needed]", 
            "link": null, 
            "name": " Rotating weight"
        }, 
        {
            "def": "A rider who is strong on flat and undulating roads. The rider is well suited for races such as Paris–Roubaix and the Tour of Flanders. Tom Boonen and Fabian Cancellara are examples of this.[17]", 
            "link": null, 
            "name": " Rouleur"
        }, 
        {
            "def": "Bike seat.[4]", 
            "link": null, 
            "name": " Saddle"
        }, 
        {
            "def": "A broom wagon.[19][21][22] Probably from the word \"sag\", i.e. droop, but sometimes explained as an acronym for \"support and gear\" or \"support and grub\".[23]", 
            "link": null, 
            "name": " Sag wagon"
        }, 
        {
            "def": "Last riders to depart in a handicap race. Also referred to as the \"scratch bunch\" or \"scratchies\". Also, a straightforward type of track race with a predetermined number of laps (except in the case of an \"unknown scratch,\" when officials ring a bell to signify one lap to go) until the finish line.[citation needed]", 
            "link": null, 
            "name": " Scratch"
        }, 
        {
            "def": "A command center where bicycles are maintained between races in preparation for the next race, a service course car is a car (such as those famously provided by Mavic) that carry spare bicycles or wheels in a race should the competing cyclist require it.[82][83]", 
            "link": null, 
            "name": " Service course"
        }, 
        {
            "def": "To pull or throw shapes (origin: Irish slang for acting the \"hard man\") is to pedal in an ungainly and un-fluid manner, usually due to exertion; a sign that a rider is about to crack or has cracked. Can be used in expressive ways: \"He's throwing a whole basket of shapes\".[citation needed]", 
            "link": null, 
            "name": " Shapes"
        }, 
        {
            "def": "A rider who is having extreme difficulty keeping up with a fast pace race in a way they did not anticipate. A rider who is shelled will use up all their energy so they have nothing left for the finishing sprint, drop back out of contention, or abandon the race altogether.[citation needed]", 
            "link": null, 
            "name": " Shelled"
        }, 
        {
            "def": "A component used by the rider to control the gearing mechanisms and select the desired gear ratio. It is usually connected to the derailleur by a mechanical actuation cable. Electronic shifting systems also exist.", 
            "link": "/wiki/Shifter_(bicycle_part)", 
            "name": " Shifter"
        }, 
        {
            "def": "Australian English for tubular tyres.[9]", 
            "link": null, 
            "name": " Singles"
        }, 
        {
            "def": "To ride behind another rider without taking a turn on the front (thus tiring the lead rider), often in preparation for an attack or sprint finish. \"Sitting in the wheels\" is to take an easy ride drafted by the peloton or gruppetto. Often a strategic decision to save energy in races.[4]", 
            "link": null, 
            "name": " Sit-on and Sit-in"
        }, 
        {
            "def": "In a race, if a rider eases his or her efforts and stops pulling or maintaining the pace of the group, the rider is said to have sat up.[citation needed]", 
            "link": null, 
            "name": " Sit up"
        }, 
        {
            "def": "A breakaway that is allowed to go from the peloton in a stage race because it poses no strategic threat to any of the main contenders on GC. In French terminology a soft break is a \"dishonest break\".[citation needed]", 
            "link": null, 
            "name": " Soft break"
        }, 
        {
            "def": "A non-riding member of a team whose role is to provide support for the riders, possibly including transportation and organization of supplies, preparation of the team's food, post-ride massages and personal encouragement.[17]", 
            "link": null, 
            "name": " Soigneur"
        }, 
        {
            "def": "Also known as comfort or endurance bicycle. A type of racing bicycle intended for less serious cyclosportive and long distance riding with comfortable (more upright) riding geometry in comparison to dedicated racing bikes in addition to longer wheelbase, higher handlebar position as well as in recent years, disk brakes.[84][85]", 
            "link": null, 
            "name": " Sportive bicycle"
        }, 
        {
            "def": "Rider with the ability to generate very high power over short periods (a few seconds to a minute) allowing for great finishing speeds, but usually unable to sustain sufficiently high power over long periods to be a good time triallist, and is usually too big to have a high enough power-to-weight ratio to be a good climber.[17]", 
            "link": "/wiki/Cycling_sprinter", 
            "name": " Sprinter"
        }, 
        {
            "def": "British term for tubular tyres.[citation needed]", 
            "link": null, 
            "name": " Sprints"
        }, 
        {
            "def": "Similar to shapes. pedaling squares is pedaling without fluid rhythm. Pedaling in a labored fashion.[citation needed]", 
            "link": null, 
            "name": " Squares"
        }, 
        {
            "def": "A cyclist who has a tendency to swerve unexpectedly and maintain inconsistent speed. Considered dangerous to follow at close range for the purpose of drafting.[19]", 
            "link": null, 
            "name": " Squirrel"
        }, 
        {
            "def": "One part of a multi-day race, such as the Tour de France.[citation needed]", 
            "link": "/wiki/Race_stage", 
            "name": " Stage"
        }, 
        {
            "def": "An amateur rider, who is taken in by a professional team during the season. This lets the rider get some experience at riding a few pro races, and the team gets a chance to assess the abilities of the rider.[54]", 
            "link": "/wiki/Stagiaire_(cycling)", 
            "name": " Stagiaire"
        }, 
        {
            "def": "A freeride term for a landing in terms of when cycling off a set of stairs.[citation needed]", 
            "link": null, 
            "name": " Stair gap"
        }, 
        {
            "def": "A cyclist that excels at maintaining high speed on a relatively flat course alone. The stayer, climber and sprinter make up the three types of mass start road racing specialists. The stayer is some times referred to as a time trial-ist, since the qualities of one and the other are similar. Since a mass start road race is not a time trial, the term stayer is used. (Ref: CONI Book)", 
            "link": null, 
            "name": " Stayer"
        }, 
        {
            "def": "Colloquial name for a bicycle.[4]", 
            "link": null, 
            "name": " Steed"
        }, 
        {
            "def": "The part of the fork that is inserted into the head tube of the frame, and is used to attach the fork to the frame using a headset.[86]", 
            "link": "/wiki/Bicycle_fork", 
            "name": " Steerer tube"
        }, 
        {
            "def": "The component that attaches the handlebars to the steer tube of the bicycle. They come in two major types, quill and threadless. The angle and length plays a major part in how the bicycle fits the rider.[4]", 
            "link": "/wiki/Stem_(bicycle_part)", 
            "name": " Stem"
        }, 
        {
            "def": "A technique often used by the rider who takes food and water from the team car during a race. The rider holds on for a variable amount of time to the bottle handed to him by the car occupant, who maintains his grasp on the object, effectively dragging the athlete. This concerted act gives the cyclist a moment to relax. Usually tolerated by the race commissaire if the bottle is held for 1-2 second, but may result in a sanction if an exaggeration is perceived.[87]", 
            "link": null, 
            "name": " Sticky bottle"
        }, 
        {
            "def": "The rider on a tandem bike not steering.[24]", 
            "link": null, 
            "name": " Stoker"
        }, 
        {
            "def": "A race that ends at the top of a mountain climb. Such stages favour the climbers and are normally decisive in major stage races like the Giro d'Italia and the Tour de France.[88]", 
            "link": null, 
            "name": " Summit finish"
        }, 
        {
            "def": "A cyclist fending the air in front of a group of riders, then leaving the front after producing his effort by steering his bike to the side is said to \"swing off\". Example: \"Ivan Basso swings off to let Peter Sagan go!\"[4]", 
            "link": null, 
            "name": " Swing off"
        }, 
        {
            "def": "A bicycle built for two. Strictly only a bike where the riders are positioned in-line, otherwise it is a sociable.", 
            "link": "/wiki/Tandem_bicycle", 
            "name": " Tandem"
        }, 
        {
            "def": "A team of professional cyclists. Usually one rider will be the team leader and the others will support him, though the team itself will be composed of a mix of riders from the various specialisations.[citation needed]", 
            "link": "/wiki/Cycling_team", 
            "name": " Team"
        }, 
        {
            "def": "Riders start in groups or teams, usually of a fixed size. The time of the nth rider of a team counts for the classification for each team member. In the 2009 edition of Tour de France, riders who are dropped from their team's group would be scored with their own time, instead of the team time.[19]", 
            "link": null, 
            "name": " Team time trial"
        }, 
        {
            "def": "A trail or patch of road that requires good balance and concentration since it is very uneven. Can also be said of a bend or a series of bends.[7]", 
            "link": null, 
            "name": " Technical"
        }, 
        {
            "def": "A designated section along the course of a mountain bike or cyclocross race along which riders are allowed to accept technical assistance (tools, spare parts, or mechanical work) from another person. In cyclocross racing the technical assistance zone is called the \"pit\". Not all mountain bike races contain a technical assistance zone, instead requiring riders to carry whatever tools and spare parts they may need. A rider accepting technical assistance outside of the designated zone risks disqualification.[citation needed]", 
            "link": null, 
            "name": " Technical Assistance Zone"
        }, 
        {
            "def": "Steady pace at the front of a group of riders. A relatively fast tempo can be used by a group or team to control the peloton, often to make up time to a break. The group will ride at the head of the bunch and set a fast enough pace to stretch the peloton out (also known as stringing out) and discourage other riders from attacking. Setting a slower tempo can be done for the purpose of blocking.[89] A tempo is also a type of track race where two points are awarded to the first person to cross the line each lap, and one point is awarded to the second person to cross the line each lap. The winner is the person with the most points at the end of the race.[citation needed]", 
            "link": null, 
            "name": " Tempo"
        }, 
        {
            "def": "A level of exertion just below the rider's anaerobic threshold. Used as a reference point in training, this is the highest level of exertion that a given rider can sustain.[90]", 
            "link": null, 
            "name": " Tempo pace"
        }, 
        {
            "def": "A time-trialist who tends to over-specialize in the discipline. Slightly derogatory.[citation needed]", 
            "link": null, 
            "name": " Tester"
        }, 
        {
            "def": "From French, literally \"head of the race\" - the leading cyclist or group of cyclists, when separated from (in front of) the peloton.[citation needed]", 
            "link": null, 
            "name": " Tête de la course"
        }, 
        {
            "def": "A rider that sits at the back of a breakaway but doesn't take a pull. Thus the rider gets a free ride similar to a ticket collector on a train who rides for free.[citation needed]", 
            "link": null, 
            "name": " Ticket collector"
        }, 
        {
            "def": "The word commonly refers to fans along the roadside at professional road cycling races in Italy such as Tirreno–Adriatico, Milan–San Remo, the Giro d'Italia, and the Giro di Lombardia.[citation needed]", 
            "link": null, 
            "name": " Tifosi"
        }, 
        {
            "def": "A race against the clock where riders are started separately (ranging from 30 seconds to 5 minutes apart). The winner of the race is determined by the fastest person across the course. No drafting may be employed in a time trial as it is a solo race event.[4]", 
            "link": "/wiki/Time_trial", 
            "name": " Time trial"
        }, 
        {
            "def": "A rider that can generate relatively high power over long periods of time (5 minutes to an hour or more) in a race against the clock.[citation needed]", 
            "link": "/wiki/Time_trialist", 
            "name": " Time trialist"
        }, 
        {
            "def": "To finish off a group of riders who are about to crack. The perpetrator knows (or guesses) he has better overall energy than his competitors, presumably after making them suffer with numerous accelerations. The ensuing violent acceleration is referred to as \"sticking the knife in\" while a number of riders, if not all, are dropped.[91]", 
            "link": null, 
            "name": " To Stick The Knife In"
        }, 
        {
            "def": "An oval cycling track for races, banked at up to 50 degrees. Cycling tracks are usually, but not always indoors. Bicycling or cycle tracks are also called velodromes. An Olympic track is generally 250m long.[citation needed]", 
            "link": null, 
            "name": " Track"
        }, 
        {
            "def": "a generous individual or group of individuals that provide acts of kindness to participants of outdoor events, on hiking trails or various biking routes. Trail angels are closely associated with trail magic. \"Trail Angels\" are commonly described in online hiking journals as friends of hikers, relatives or others persons who will often provide food, transportation, etc. to hikers on the trail.[citation needed]", 
            "link": null, 
            "name": " Trail angel"
        }, 
        {
            "def": "a method in stage races to get a sprinter to the front of a bunch sprint and launched. The sprinter's team riders will form a line, usually within 5k of the finish and take turns to build up speed - the last rider in the train will be protected (drafting) until a short distance from the finish. Perfected by HTC and Mark Cavendish.", 
            "link": null, 
            "name": " Train"
        }, 
        {
            "def": "A piece of equipment that a bicycle stands on so that the rear wheel can spin while the bicycle is stationary, allowing stationary riding. These are usually used when the conditions outside are bad.[92]", 
            "link": "/wiki/Bicycle_trainer", 
            "name": " Trainer"
        }, 
        {
            "def": "Like a bicycle but with three wheels. Comes in both upright and recumbent versions.", 
            "link": "/wiki/Tricycle", 
            "name": " Tricycle"
        }, 
        {
            "def": "See tricycle.", 
            "link": null, 
            "name": " Trike"
        }, 
        {
            "def": "Also known as old school sprinter. A rider who excels primarily in sprint finishes on flat to mildly uphill terrain. Often too heavy to compete in longer or steeper uphill courses.[citation needed]", 
            "link": null, 
            "name": " True sprinter"
        }, 
        {
            "def": "Tubular tyres are cycle tyres that have the inner tube permanently stitched inside the casing. They are held in place using glue or glue-tape, and are affixed to rims which lack the sidewalls characteristic of a hook-bead rim. Tubulars take very high pressure (up to 10 bar or 145 psi, or higher for racing and track-specific tires) which reduces their rolling resistance. They typically result in wheelsets that are lower in overall weight than comparable clincher wheels, because of the shape of the rim, the tire construction, and the lack of rim strips. Tubulars can be ridden at lower pressures than clinchers without the risk of pinch flats, because of the shape of the rim. This makes them well-suited to cyclo-cross, especially in muddy conditions where low tire pressures are used. However, they are difficult to replace and repair and are generally more expensive than clinchers. Also called sew-ups, tubies, or tub.[4]", 
            "link": "/wiki/Tubular_tyres", 
            "name": " Tubular tyres"
        }, 
        {
            "def": "A trainer that spins a fan assembly at the same time (for pedal resistance and air flow). See Bicycle trainer.[citation needed]", 
            "link": null, 
            "name": " Turbo-trainer"
        }, 
        {
            "def": "A turn is a rider sharing the workload on a pace line \"he took a turn\" or \"he is doing a lot of turns on the front\". Missing turns can be expressed thus \"he has missed a few turns now and has stopped working\". In a breakaway the riders expect to share the work equally in \"turns\". A rider who doesn't take his turn is \"sitting on the break\".[citation needed]", 
            "link": null, 
            "name": " Turn"
        }, 
        {
            "def": "Alternatively known as a city bike, a bicycle that is designed to be ridden on the road sometimes utilizing components of a mountain bike and in most cases, hydraulic disc brakes; similar to a hybrid bicycle.[93]", 
            "link": null, 
            "name": " Urban bicycle"
        }, 
        {
            "def": "A cycling track for races. See track.[17][19]", 
            "link": null, 
            "name": " Velodrome"
        }, 
        {
            "def": "An enclosed recumbent tricycle, usually designed with aerodynamics in mind. Can be fully enclosed or with a head-out configuration.[94]", 
            "link": "/wiki/Velomobile", 
            "name": " Velomobile"
        }, 
        {
            "def": "Race spectators who gather at a technical point of the course where a crash is more likely to occur.[4]", 
            "link": null, 
            "name": " Vultures"
        }, 
        {
            "def": "The edge of the course.", 
            "link": null, 
            "name": " Wall"
        }, 
        {
            "def": "Referred to in French as a 'Domestique'- these are the members of a team who chase down competitors and try to neutralize their efforts and they will often protect their team leader from the wind by surrounding him. When a leader has to get a repair or stop to answer nature his domestiques will stay with him and pace him back up to the peloton. They are called \"water carriers\" because they are the ones designated to go back to the team car and pick up water bottles and bring them back up to the leader and other members of the team. In Italian the term is \"gregario\".[citation needed]", 
            "link": null, 
            "name": " Water carrier"
        }, 
        {
            "def": "A cyclist that is concerned about the weight of his or her bicycle or its components.[95]", 
            "link": null, 
            "name": " Weight weenie"
        }, 
        {
            "def": "Lifting the front wheel of the bicycle in the air - through force transmitted through the pedals - whilst riding and continuing to ride on only the back wheel. The rider maintains the wheelie by applying pedalstrokes and rear brake in order to balance the bicycle on only the rear wheel.[19]", 
            "link": "/wiki/Wheelie", 
            "name": " Wheelie"
        }, 
        {
            "def": "A rider who sits on the rear wheel of others in a group or on another rider, enjoying the draft but not working. Also leech, leeching.[19][55]", 
            "link": null, 
            "name": " Wheelsucker, wheelsucking"
        }, 
        {
            "def": "A racing bicycle adapted for use in winter seasons. Typically these are less expensive and incorporate mudguards, which are rarely present on their modern summer counterparts.[96][97]", 
            "link": null, 
            "name": " Winter bike"
        }, 
        {
            "def": "A crash. Can be used as a verb: \"This rider wiped out pretty bad on the wet corner.\"[4]", 
            "link": "/wiki/Collision", 
            "name": " Wipe out"
        }, 
        {
            "def": "An outside lane on a roadway that is wide enough to be safely shared side-by-side by a bicycle and motor vehicle. The road may be marked with partial lane markings to designate the portion of the lane to be used by bicycles.[citation needed]", 
            "link": "/wiki/Wide_outside_lane", 
            "name": " Wide Outside Lane (WOL)"
        }, 
        {
            "def": "To work is to do \"turns on the front\", to aid a group of riders by sharing the workload of working against air resistance by \"pulling on the front\" of the group. Similar to pull. Often used expressively in combination with other expressions: e.g. \"He hasn't done any work all day, he has just sat on the breakaway.\" Working is used in many contexts in the peloton and road racing.[54]", 
            "link": null, 
            "name": " Work"
        }, 
        {
            "def": "Worn by the rider who is leading in the general classification in the Tour de France; also referred to as the maillot jaune.[17]", 
            "link": "/wiki/Yellow_Jersey", 
            "name": " Yellow Jersey"
        }
    ]
}