{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_biology", 
    "words": [
        {
            "def": "Abscisic acid - a plant hormone with the formula C15H20O4", 
            "link": "/wiki/Abscisic_acid", 
            "name": "Abscisic acid"
        }, 
        {
            "def": "Abscission - shedding of flowers and leaves and fruit following formation of scar tissue in a plant", 
            "link": "/wiki/Abscission", 
            "name": "Abscission"
        }, 
        {
            "def": "Absolute zero - the lowest theoretically attainable temperature (at which the kinetic energy of atoms and molecules is minimal); 0 Kelvin or -273.15 Celsius of -459.67 Fahrenheit", 
            "link": "/wiki/Absolute_zero", 
            "name": "Absolute zero"
        }, 
        {
            "def": "Absorption - a process in which one substance permeates another; a fluid permeates or is dissolved by a liquid or solid. Skin absorption is a route by which substances can enter the body through the skin.", 
            "link": "/wiki/Absorption_(skin)", 
            "name": "Absorption"
        }, 
        {
            "def": "Absorption spectrum - the spectrum of electromagnetic radiation that has passed through a medium that absorbed radiation of certain wavelengths.", 
            "link": "/wiki/Absorption_spectrum", 
            "name": "Absorption spectrum"
        }, 
        {
            "def": "Abyssal zone - the deep sea (2000 meters or more) where there is no light.", 
            "link": "/wiki/Abyssal_zone", 
            "name": "Abyssal zone"
        }, 
        {
            "def": "Acclimatization - adaptation to a new climate (a new temperature or altitude or environment).", 
            "link": "/wiki/Acclimatization", 
            "name": "Acclimatization"
        }, 
        {
            "def": "Acid precipitation - rain containing acids that form in the atmosphere when industrial gas emissions (especially sulfur dioxide and nitrogen oxides) combine with water.", 
            "link": "/wiki/Acid_precipitation", 
            "name": "Acid precipitation"
        }, 
        {
            "def": "Acoelomate - animals, like flatworms and jellyfish, that have no body cavity (coelom). Semi-solid mesodermal tissues between the gut and body wall hold their organs in place.", 
            "link": "/wiki/Acoelomate", 
            "name": "Acoelomate"
        }, 
        {
            "def": "Actin - one of the proteins into which actomyosin can be split; can exist in either a globular or a fibrous form.", 
            "link": "/wiki/Actin", 
            "name": "Actin"
        }, 
        {
            "def": "Action potential - the local voltage change across the cell wall as a nerve impulse is transmitted.", 
            "link": "/wiki/Action_potential", 
            "name": "Action potential"
        }, 
        {
            "def": "Activation energy - the energy that an atomic system must acquire before a process (such as an emission or reaction) can occur.", 
            "link": "/wiki/Activation_energy", 
            "name": "Activation energy"
        }, 
        {
            "def": "Active site - the part of an enzyme or antibody where the chemical reaction occurs", 
            "link": "/wiki/Active_site", 
            "name": "Active site"
        }, 
        {
            "def": "Active transport - transport of a substance (as a protein or drug) across a cell membrane against the concentration gradient; requires an expenditure of energy", 
            "link": "/wiki/Active_transport", 
            "name": "Active transport"
        }, 
        {
            "def": "Autotropic - auto means \"self\" and tropic means \"producing\"", 
            "link": "/wiki/Autotropic", 
            "name": "Autotropic"
        }, 
        {
            "def": "Adenosine triphosphate - a nucleotide derived from adenosine that occurs in muscle tissue; the major source of energy for cellular reactions. The chemical formula for ATP is C10H16N5O13P3", 
            "link": "/wiki/Adenosine_triphosphate", 
            "name": "Adenosine triphosphate"
        }, 
        {
            "def": "Adenylate cyclase - An enzyme that catalyzes the formation of cyclic AMP from ATP.", 
            "link": "/wiki/Adenylate_cyclase", 
            "name": "Adenylate cyclase"
        }, 
        {
            "def": "Aerobic - depending on free oxygen or air.", 
            "link": "/wiki/Aerobic_organism", 
            "name": "Aerobic"
        }, 
        {
            "def": "Aerobiology - the study of organic particles, such as bacteria, fungal spores, very small insects, pollen grains and viruses, which are passively transported by the air.", 
            "link": "/wiki/Aerobiology", 
            "name": "Aerobiology"
        }, 
        {
            "def": "Agriculture - the practice of cultivating land, growing food, and raising stock.", 
            "link": "/wiki/Agriculture", 
            "name": "Agriculture"
        }, 
        {
            "def": "Agrobiology - the study of plant nutrition and growth especially as a way to increase crop yield", 
            "link": "/wiki/Agrobiology", 
            "name": "Agrobiology"
        }, 
        {
            "def": "Amino acid - a class of organic compounds containing an amino group and a carboxylic acid group", 
            "link": "/wiki/Amino_acid", 
            "name": "Amino acid"
        }, 
        {
            "def": "Amniote - organisms that produce an egg composed of shell and membranes that creates a protected environment in which the embryo can develop out of water", 
            "link": "/wiki/Amniote", 
            "name": "Amniote"
        }, 
        {
            "def": "Anatomy - the branch of morphology that deals with the structure of animals", 
            "link": "/wiki/Anatomy", 
            "name": "Anatomy"
        }, 
        {
            "def": "Anticodon -", 
            "link": "/wiki/Transfer_RNA#Anticodon", 
            "name": "Anticodon"
        }, 
        {
            "def": "Arachnology - scientific study of spiders, scorpions, pseudoscorpions, and harvestmen, collectively called arachnids.", 
            "link": "/wiki/Arachnology", 
            "name": "Arachnology"
        }, 
        {
            "def": "Artificial selection - professionals study the genotype and phenotype of parent organisms in the hope of producing a hybrid that possesses many of the desirable characteristics found in their parents. Also known as selective breeding.", 
            "link": "/wiki/Selective_breeding", 
            "name": "Artificial selection"
        }, 
        {
            "def": "Asexual reproduction - process of reproduction involving a single parent that results in offspring that are genetically identical to the parent", 
            "link": "/wiki/Asexual_reproduction", 
            "name": "Asexual reproduction"
        }, 
        {
            "def": "Astrobiology - the branch of biology concerned with the effects of outer space on living organisms and the search for extraterrestrial life", 
            "link": "/wiki/Astrobiology", 
            "name": "Astrobiology"
        }, 
        {
            "def": "Atom - the smallest component of an element having the chemical properties of the element", 
            "link": "/wiki/Atom", 
            "name": "Atom"
        }, 
        {
            "def": "Autoimmunity -", 
            "link": "/wiki/Autoimmunity", 
            "name": "Autoimmunity"
        }, 
        {
            "def": "B cell - type of lymphocyte in the humoral immunity of the adaptive immune system.", 
            "link": "/wiki/B_cell", 
            "name": "B cell"
        }, 
        {
            "def": "Bacteria - Single-cell microscopic organisms which lack a true nucleus. They represent one of the three domains.", 
            "link": "/wiki/Bacteria", 
            "name": "Bacteria"
        }, 
        {
            "def": "Bacteriophage - Virus that infects and multiplies within bacteria.", 
            "link": "/wiki/Bacteriophage", 
            "name": "Bacteriophage"
        }, 
        {
            "def": "Barr body - the inactive X chromosome in a female somatic cell,[2] rendered inactive in a process called lyonization, in those species in which sex is determined by the presence of the Y (including humans) or W chromosome rather than the diploidy of the X or Z.", 
            "link": "/wiki/Barr_body", 
            "name": "Barr body"
        }, 
        {
            "def": "Basal body - (synonymous with basal granule, kinetosome, and in older cytological literature with blepharoplast) is an organelle formed from a centriole, and a short cylindrical array of microtubules.", 
            "link": "/wiki/Basal_body", 
            "name": "Basal body"
        }, 
        {
            "def": "Behavioral ecology - the study of the evolutionary basis for animal behavior due to ecological pressures.", 
            "link": "/wiki/Behavioral_ecology", 
            "name": "Behavioral ecology"
        }, 
        {
            "def": "Benthic zone -The benthic zone is the ecological region at the lowest level of a body of water such as an ocean or a lake, including the sediment surface and some sub-surface layers. Organisms living in this zone are called benthos, e.g. the benthic invertebrate community, including crustaceans and polychaetes.", 
            "link": "/wiki/Benthic_zone", 
            "name": "Benthic zone"
        }, 
        {
            "def": "Bile -Bile or gall is a dark green to yellowish brown fluid, produced by the liver of most vertebrates, that aids the digestion of lipids in the small intestine.", 
            "link": "/wiki/Bile", 
            "name": "Bile"
        }, 
        {
            "def": "Binary fission - One cell dividing into two identical daughter cells.", 
            "link": "/wiki/Fission_(biology)", 
            "name": "Binary fission"
        }, 
        {
            "def": "Biocatalysis -catalysis in living (biological) systems. In biocatalytic processes, natural catalysts, such as protein enzymes, perform chemical transformations on organic compounds.", 
            "link": "/wiki/Biocatalysis", 
            "name": "Biocatalysis"
        }, 
        {
            "def": "Biochemistry-Biochemistry is the branch of science that explores the chemical processes within and related to living organisms. It is a laboratory based science that brings together biology and chemistry. By using chemical knowledge and techniques, biochemists can understand and solve biological problems", 
            "link": "/wiki/Biochemistry", 
            "name": "Biochemistry"
        }, 
        {
            "def": "Biodiversity -", 
            "link": "/wiki/Biodiversity", 
            "name": "Biodiversity"
        }, 
        {
            "def": "Bioengineering -Biological engineering or bioengineering is the application of concepts and methods of biology to solve real-world problems related to SSBS life sciences or the application thereof, using engineering's", 
            "link": "/wiki/Bioengineering", 
            "name": "Bioengineering"
        }, 
        {
            "def": "Bioenergetics -the study of the transformation of energy in living organisms.", 
            "link": "/wiki/Bioenergetics", 
            "name": "Bioenergetics"
        }, 
        {
            "def": "Biogeography -is the study of the distribution of species and ecosystems in geographic space and through (geological) time. Organisms and biological communities often vary in a regular fashion along geographic gradients of latitude, elevation, isolation and habitat area.", 
            "link": "/wiki/Biogeography", 
            "name": "Biogeography"
        }, 
        {
            "def": "Bioinformatics -Bioinformatics is the application of computer technology to the management of biological information.", 
            "link": "/wiki/Bioinformatics", 
            "name": "Bioinformatics"
        }, 
        {
            "def": "Biology - Study of living organisms.", 
            "link": "/wiki/Biology", 
            "name": "Biology"
        }, 
        {
            "def": "Biomass Biomass is organic matter derived from living, or recently living organisms. Biomass can be used as a source of energy and it most often refers to plants or plant-based materials which are not used for food or feed, and are specifically called lignocellulosic biomass", 
            "link": "/wiki/Biomass", 
            "name": "Biomass"
        }, 
        {
            "def": "Biomathematics -The field is also called mathematical biology or biomathematics to stress the mathematical side, or theoretical biology to stress the biological side.", 
            "link": "/wiki/Biomathematics", 
            "name": "Biomathematics"
        }, 
        {
            "def": "Biome -Biomes are very large ecological areas on the earth's surface, with fauna and flora (animals and plants) adapting to their environment. Biomes are often defined by abiotic factors such as climate, relief, geology, soils and vegetation.", 
            "link": "/wiki/Biome", 
            "name": "Biome"
        }, 
        {
            "def": "Biomechanics -Biomechanics is the study of the structure and function of biological systems by means of the methods of \"mechanics.\" – which is the branch of physics involving analysis of the actions of forces.", 
            "link": "/wiki/Biomechanics", 
            "name": "Biomechanics"
        }, 
        {
            "def": "Biomedical engineering -Biomedical engineering (BME) is the application of engineering principles and design concepts to medicine and biology for healthcare purposes (e.g. diagnostic or therapeutic).", 
            "link": "/wiki/Biomedical_engineering", 
            "name": "Biomedical engineering"
        }, 
        {
            "def": "Biomedical research -Biomedical research is the pursuit of answers to medical questions. These investigations lead to discoveries, which in turn lead to the development of new preventions, therapies and cures for human and veterinary health. Biomedical research generally takes two forms: basic science and applied research", 
            "link": "/wiki/Biomedical_research", 
            "name": "Biomedical research"
        }, 
        {
            "def": "Biomimetic - See Bionics.", 
            "link": "/wiki/Biomimetic", 
            "name": "Biomimetic"
        }, 
        {
            "def": "Biomolecule -", 
            "link": "/wiki/Biomolecule", 
            "name": "Biomolecule"
        }, 
        {
            "def": "Bionics - Application of biological methods and systems found in nature to the study and design of engineering systems and modern technology. Also known as biomimetics, biognosis, biomimicry, or bionical creativity engineering", 
            "link": "/wiki/Bionics", 
            "name": "Bionics"
        }, 
        {
            "def": "Biophysics -Biophysics is an interdisciplinary science that applies the approaches and methods of physics to study biological systems. Biophysics covers all scales of biological organization, from molecular to organismic and populations", 
            "link": "/wiki/Biophysics", 
            "name": "Biophysics"
        }, 
        {
            "def": "Biotechnology -Biotechnology is the use of living systems and organisms to develop or make products, or \"any technological application that uses biological systems, living organisms or derivatives thereof, to make or modify products or processes for specific use\" (UN Convention on Biological Diversity,", 
            "link": "/wiki/Biotechnology", 
            "name": "Biotechnology"
        }, 
        {
            "def": "Bipedal -Bipedalism is a form of terrestrial locomotion where an organism moves by means of its two rear limbs or legs.", 
            "link": "/wiki/Bipedal", 
            "name": "Bipedal"
        }, 
        {
            "def": "Blastocyst -a mammalian blastula in which some differentiation of cells has occurred", 
            "link": "/wiki/Blastocyst", 
            "name": "Blastocyst"
        }, 
        {
            "def": "Blood -the red liquid that circulates in the arteries and veins of humans and other vertebrate animals, carrying oxygen to and carbon dioxide from the tissues of the body.", 
            "link": "/wiki/Blood", 
            "name": "Blood"
        }, 
        {
            "def": "Blood-brain barrier -a semipermeable membrane separating the blood from the cerebrospinal fluid, and constituting a barrier to the passage of cells, particles, and large molecules.", 
            "link": "/wiki/Blood-brain_barrier", 
            "name": "Blood-brain barrier"
        }, 
        {
            "def": "Botany - the study of plants", 
            "link": "/wiki/Botany", 
            "name": "Botany"
        }, 
        {
            "def": "Bowman's capsule -Bowman's capsule (or the Bowman capsule, capsula glomeruli, or glomerular capsule) is a cup-like sac at the beginning of the tubular component of a nephron in the mammalian kidney that performs the first step in the filtration of blood to form urine. A glomerulus is enclosed in the sac", 
            "link": "/wiki/Bowman%27s_capsule", 
            "name": "Bowman's capsule"
        }, 
        {
            "def": "Building biology -Building Biology is science that leads to natural healthy ecological homes, schools, and workplaces that exist in harmony with the environment", 
            "link": "/wiki/Building_biology", 
            "name": "Building biology"
        }, 
        {
            "def": "Capsid -is a covering of viroids", 
            "link": "/wiki/Capsid", 
            "name": "Capsid"
        }, 
        {
            "def": "Carbon fixation -", 
            "link": "/wiki/Carbon_fixation", 
            "name": "Carbon fixation"
        }, 
        {
            "def": "Carbonate -Carbonate, any member of two classes of chemical compounds derived from carbonic acid or carbon dioxide.", 
            "link": "/wiki/Carbonate", 
            "name": "Carbonate"
        }, 
        {
            "def": "Cell - the structural and functional unit of all organisms; an autonomous self-replicating unit that may exist as functional independent unit of life (as in the case of unicellular organism), or as sub-unit in a multicellular organism that is specialized into carrying out particular functions towards the cause of the organism as a whole.", 
            "link": "/wiki/Cell_(biology)", 
            "name": "Cell"
        }, 
        {
            "def": "Cell biology -Cell biology explains the structure, organization of the organelles they contain, their physiological properties, metabolic processes, signaling pathways, life cycle, and interactions with their environment. This is done both on a microscopic and molecular level as it encompasses prokaryotic cells and eukaryotic cells.", 
            "link": "/wiki/Cell_biology", 
            "name": "Cell biology"
        }, 
        {
            "def": "Cell membrane -the semipermeable membrane surrounding the cytoplasm of a cell.", 
            "link": "/wiki/Cell_membrane", 
            "name": "Cell membrane"
        }, 
        {
            "def": "Cell nucleus - the \"control room\" for the cell. the nucleus gves out all the orders.", 
            "link": "/wiki/Cell_nucleus", 
            "name": "Cell nucleus"
        }, 
        {
            "def": "Cell plate -", 
            "link": "/wiki/Cell_plate", 
            "name": "Cell plate"
        }, 
        {
            "def": "Cell theory - the theory that all living things are made up of cells.", 
            "link": "/wiki/Cell_theory", 
            "name": "Cell theory"
        }, 
        {
            "def": "Centriole -", 
            "link": "/wiki/Centriole", 
            "name": "Centriole"
        }, 
        {
            "def": "Centroid -The centroid of a triangle is the intersection of the three medians of the triangle (each median connecting a vertex with the midpoint of the opposite side). It lies on the triangle's Euler line, which also goes through various other key points including the orthocenter and the circumcenter", 
            "link": "/wiki/Centroid", 
            "name": "Centroid"
        }, 
        {
            "def": "Centrosome -In cell biology, the centrosome is an organelle that is the main place where cell microtubules get organized. They occur only in plant and animal cells. Also, it regulates the cell division cycle, the stages which lead up to cell division", 
            "link": "/wiki/Centrosome", 
            "name": "Centrosome"
        }, 
        {
            "def": "Chemical bond -A chemical bond is a lasting attraction between atoms that enables the formation of chemical compounds. The bond may result from the electrostatic force of attraction between atoms with opposite charges, or through the sharing of electrons as in the covalent bonds.", 
            "link": "/wiki/Chemical_bond", 
            "name": "Chemical bond"
        }, 
        {
            "def": "Chemical compound -A chemical compound is a chemical substance consisting of two or more different chemically bonded chemical elements, with a fixed ratio determining the composition. The ratio of each element is usually expressed by chemical formula", 
            "link": "/wiki/Chemical_compound", 
            "name": "Chemical compound"
        }, 
        {
            "def": "Chemical equilibrium -In a chemical reaction, chemical equilibrium is the state in which both reactants and products are present in concentrations which have no further tendency to change with time.", 
            "link": "/wiki/Chemical_equilibrium", 
            "name": "Chemical equilibrium"
        }, 
        {
            "def": "Chemical kinetics -Chemical kinetics is the study and discussion of chemical reactions with respect to reaction rates, effect of various variables, re-arrangement of atoms, formation of intermediates etc. There are many topics to be discussed, and each of these topics is a tool for the study of chemical reactions", 
            "link": "/wiki/Chemical_kinetics", 
            "name": "Chemical kinetics"
        }, 
        {
            "def": "Chemical reaction - The substance (or substances) initially involved in a chemical reaction are called reactants or reagents. Chemical reactions are usually characterized by a chemical change, and they yield one or more products, which usually have properties different from the reactants", 
            "link": "/wiki/Chemical_reaction", 
            "name": "Chemical reaction"
        }, 
        {
            "def": "Chemistry -Chemistry is a branch of physical science that studies the composition, structure, properties and change of matter.", 
            "link": "/wiki/Chemistry", 
            "name": "Chemistry"
        }, 
        {
            "def": "Chloride -a compound of chlorine with another element or group, especially a salt of the anion Cl− or an organic compound with chlorine bonded to an alkyl group", 
            "link": "/wiki/Chloride", 
            "name": "Chloride"
        }, 
        {
            "def": "Chloroplast -Animal cells do not have chloroplasts. Chloroplasts work to convert light energy of the Sun into sugars that can be used by cells. The entire process is called photosynthesis and it all depends on the little green chlorophyll molecules in each chloroplast", 
            "link": "/wiki/Chloroplast", 
            "name": "Chloroplast"
        }, 
        {
            "def": "Cholesterol -", 
            "link": "/wiki/Cholesterol", 
            "name": "Cholesterol"
        }, 
        {
            "def": "Chromate -Chromate salts contain the chromate anion, CrO₄2−. Dichromate salts contain the dichromate anion, Cr₂O₇2−. They are oxoanions of chromium in the oxidation state +6. They are moderately strong oxidizing agents", 
            "link": "/wiki/Chromate", 
            "name": "Chromate"
        }, 
        {
            "def": "Chromosome - a threadlike strand of DNA in the cell nucleus that carries the genes in a linear order", 
            "link": "/wiki/Chromosome", 
            "name": "Chromosome"
        }, 
        {
            "def": "Cloning -", 
            "link": "/wiki/Cloning", 
            "name": "Cloning"
        }, 
        {
            "def": "Conservation biology -Conservation biology is the scientific study of nature and of Earth's biodiversity with the aim of protecting species, their habitats, and ecosystems from excessive rates of extinction and the erosion of biotic interactions", 
            "link": "/wiki/Conservation_biology", 
            "name": "Conservation biology"
        }, 
        {
            "def": "Cryobiology -Cryobiology is the branch of biology that studies the effects of low temperatures on living things within Earth's cryosphere or in science. The word cryobiology is derived from the Greek words κρῧος [kryos], « cold », βίος [bios], « life », and λόγος [logos], « word » (hence science).", 
            "link": "/wiki/Cryobiology", 
            "name": "Cryobiology"
        }, 
        {
            "def": "Cyclin-dependent kinase -", 
            "link": "/wiki/Cyclin-dependent_kinase", 
            "name": "Cyclin-dependent kinase"
        }, 
        {
            "def": "Cytosine -", 
            "link": "/wiki/Cytosine", 
            "name": "Cytosine"
        }, 
        {
            "def": "Dalton -A unit of mass (also known as an atomic mass unit, amu), equal to the mass of a hydrogen atom (1.67 x 1024 g). When measured in grams, it is equal to the reciprocal of Avagadro's number.", 
            "link": "/wiki/Dalton_(unit)", 
            "name": "Dalton"
        }, 
        {
            "def": "Darwinian fitness -the genetic contribution of an individual to the next generation's gene pool relative to the average for the population, usually measured by the number of offspring or close kin that survive to reproductive age", 
            "link": "/wiki/Darwinian_fitness", 
            "name": "Darwinian fitness"
        }, 
        {
            "def": "Deciduous -Deciduous means \"falling off at maturity\" or \"tending to fall off\", and it is typically used in order to refer to trees or shrubs that lose their leaves seasonally (most commonly during autumn) and to the shedding of other plant structures such as petals after flowering or fruit when ripe", 
            "link": "/wiki/Deciduous", 
            "name": "Deciduous"
        }, 
        {
            "def": "Dehydration reaction -", 
            "link": "/wiki/Dehydration_reaction", 
            "name": "Dehydration reaction"
        }, 
        {
            "def": "Denaturation -Denaturation is a process in which proteins or nucleic acids lose the quaternary structure, tertiary structure and secondary structure which is present in their native state, by application of some external stress or compound such as a strong acid or base, a concentrated inorganic salt, an organic solvent", 
            "link": "/wiki/Denaturation_(biochemistry)", 
            "name": "Denaturation"
        }, 
        {
            "def": "Dendrite -a short branched extension of a nerve cell, along which impulses received from other cells at synapses are transmitted to the cell body", 
            "link": "/wiki/Dendrite", 
            "name": "Dendrite"
        }, 
        {
            "def": "Denitrification -Nitrogen cycle. Denitrification is a microbially facilitated process of nitrate reduction (performed by a large group of heterotrophic facultative anaerobic bacteria) that may ultimately produce molecular nitrogen (N2) through a series of intermediate gaseous nitrogen oxide products", 
            "link": "/wiki/Denitrification", 
            "name": "Denitrification"
        }, 
        {
            "def": "Deoxyribonucleic acid -The four bases found in DNA are adenine (abbreviated A), cytosine (C), guanine (G) and thymine (T). These four bases are attached to the sugar/phosphate to form the complete nucleotide, as shown for adenosine monophosphate.", 
            "link": "/wiki/Deoxyribonucleic_acid", 
            "name": "Deoxyribonucleic acid"
        }, 
        {
            "def": "Deoxyribose -Deoxyribose, or more precisely 2-deoxyribose, is a monosaccharide with idealized formula H−(C=O)−(CH2)−(CHOH)3−H. Its name indicates that it is a deoxy sugar, meaning that it is derived from the sugar ribose by loss of an oxygen atom.", 
            "link": "/wiki/Deoxyribose", 
            "name": "Deoxyribose"
        }, 
        {
            "def": "Depolarization -the process of reversing the charge across a cell membrane (usually a NEURON), so causing an ACTION POTENTIAL. In depolarization, the inside of the membrane, which is normally negatively charged, becomes positive and the outside negative. This is brought about by positive sodium ions rapidly passing into the axon.", 
            "link": "/wiki/Depolarization", 
            "name": "Depolarization"
        }, 
        {
            "def": "Desmosome -A desmosome (/ˈdɛzməˌsoʊm/; \"binding body\"), also known as a macula adhaerens (plural: maculae adhaerentes) (Latin for adhering spot), is a cell structure specialized for cell-to-cell adhesion", 
            "link": "/wiki/Desmosome", 
            "name": "Desmosome"
        }, 
        {
            "def": "DNA -DNA, or deoxyribonucleic acid, is the hereditary material in humans and almost all other organisms.", 
            "link": "/wiki/DNA", 
            "name": "DNA"
        }, 
        {
            "def": "DNA replication - DNA replication. The double helix is unwound and each strand acts as a template for the next strand. Bases are matched to synthesize the new partner strands. DNA replication is the process of producing two identical replicas from one original DNA molecule", 
            "link": "/wiki/DNA_replication", 
            "name": "DNA replication"
        }, 
        {
            "def": "DNA sequencing -", 
            "link": "/wiki/DNA_sequencing", 
            "name": "DNA sequencing"
        }, 
        {
            "def": "Dynein -Dynein is a motor protein (also called molecular motor or motor molecule) in cells which converts the chemical energy contained in ATP into the mechanical energy of movement", 
            "link": "/wiki/Dynein", 
            "name": "Dynein"
        }, 
        {
            "def": "Ecdysone -Ecdysone is a steroidal prohormone of the major insect molting hormone 20-hydroxyecdysone, which is secreted from the prothoracic glands. Insect molting hormones are generally called ecdysteroids", 
            "link": "/wiki/Ecdysone", 
            "name": "Ecdysone"
        }, 
        {
            "def": "Ecological efficiency -Ecological efficiency describes the efficiency with which energy is transferred from one trophic level to the next. It is determined by a combination of efficiencies relating to organismic resource acquisition and assimilation in an ecosystem. Primary production occurs in autotrophic organisms of an ecosystem", 
            "link": "/wiki/Ecological_efficiency", 
            "name": "Ecological efficiency"
        }, 
        {
            "def": "Ecological niche -An ecological niche is the role and position a species has in its environment; how it meets its needs for food and shelter, how it survives, and how it reproduces. A species' niche includes all of its interactions with the biotic and abiotic factors of its environment.", 
            "link": "/wiki/Ecological_niche", 
            "name": "Ecological niche"
        }, 
        {
            "def": "Ecological pyramid -An ecological pyramid (also trophic pyramid, eltonian pyramid, energy pyramid, or sometimes food pyramid) is a graphical representation designed to show the biomass or bio productivity at each trophic level in a given ecosystem. Biomass is the amount of living or organic matter present in an organism", 
            "link": "/wiki/Ecological_pyramid", 
            "name": "Ecological pyramid"
        }, 
        {
            "def": "Ecological succession -Ecological succession is the term used to describe what happens to an ecological community over time. It refers to more or less predictable and orderly set of changes that happen in the composition or structure of ecological community", 
            "link": "/wiki/Ecological_succession", 
            "name": "Ecological succession"
        }, 
        {
            "def": "Ecology -Ecology (from Greek: οἶκος, \"house\", or \"environment\"; -λογία, \"study of\" [A]) is the scientific analysis and study of interactions among organisms and their environment. It is an interdisciplinary field that includes biology, geography and Earth science", 
            "link": "/wiki/Ecology", 
            "name": "Ecology"
        }, 
        {
            "def": "Ecophysiology -", 
            "link": "/wiki/Ecophysiology", 
            "name": "Ecophysiology"
        }, 
        {
            "def": "Ecosystem - an interaction of living things and non living things in a physical environment", 
            "link": "/wiki/Ecosystem", 
            "name": "Ecosystem"
        }, 
        {
            "def": "Ecotype -In evolutionary ecology, an ecotype, [note 1] sometimes called ecospecies, describes a genetically distinct geographic variety, population or race within a species, which is adapted to specific environmental conditions", 
            "link": "/wiki/Ecotype", 
            "name": "Ecotype"
        }, 
        {
            "def": "Ectoderm -the outermost layer of cells or tissue of an embryo in early development, or the parts derived from this, which include the epidermis, nerve tissue, and nephridia", 
            "link": "/wiki/Ectoderm", 
            "name": "Ectoderm"
        }, 
        {
            "def": "Ectotherm -An ectotherm, from the Greek εκτός (ektós) \"outside\" and θερμός (thermós) \"hot\", is an organism in which internal physiological sources of heat are of relatively small or quite negligible importance in controlling body temperature. Some refer to these organisms as \"cold blooded\".", 
            "link": "/wiki/Ectotherm", 
            "name": "Ectotherm"
        }, 
        {
            "def": "Effector -", 
            "link": "/wiki/Effector_(biology)", 
            "name": "Effector"
        }, 
        {
            "def": "Effector cell -Plasma cells, also called plasma B cells, plasmocytes, plasmacytes, or effector B cells, are white blood cells that secrete large volumes of antibodies. They are transported by the blood plasma and the lymphatic system.", 
            "link": "/wiki/Plasma_cell", 
            "name": "Effector cell"
        }, 
        {
            "def": "Efferent -conducted or conducting outwards or away from something (for nerves, the central nervous system; for blood vessels, the organ supplied).", 
            "link": "/wiki/Efferent", 
            "name": "Efferent"
        }, 
        {
            "def": "Electric potential -Electric potential, the amount of work needed to move a unit charge from a reference point to a specific point against an electric field.", 
            "link": "/wiki/Electric_potential", 
            "name": "Electric potential"
        }, 
        {
            "def": "Electrochemical gradient -An electrochemical gradient is a gradient of electrochemical potential, usually for an ion that can move across a membrane. The gradient consists of two parts, the electrical potential and a difference in the chemical concentration across a membrane", 
            "link": "/wiki/Electrochemical_gradient", 
            "name": "Electrochemical gradient"
        }, 
        {
            "def": "Electromagnetic spectrum -The electromagnetic spectrum is the collective term for all possible frequencies of electromagnetic radiation. The \"electromagnetic spectrum\" of an object has a different meaning, and is instead the characteristic distribution of electromagnetic radiation emitted or absorbed by that particular object.", 
            "link": "/wiki/Electromagnetic_spectrum", 
            "name": "Electromagnetic spectrum"
        }, 
        {
            "def": "Electron -The electron is a subatomic particle, symbol e− or β−, with a negative elementary electric charge. Electrons belong to the first generation of the lepton particle family, and are generally thought to be elementary particles because they have no known components or substructure", 
            "link": "/wiki/Electron", 
            "name": "Electron"
        }, 
        {
            "def": "Electron acceptor -An electron acceptor is a chemical entity that accepts electrons transferred to it from another compound. It is an oxidizing agent that, by virtue of its accepting electrons, is itself reduced in the process.", 
            "link": "/wiki/Electron_acceptor", 
            "name": "Electron acceptor"
        }, 
        {
            "def": "Electron carrier -electron carrier. Any of various molecules that are capable of accepting one or two electrons from one molecule and donating them to another in the process of electron transport. As the electrons are transferred from one electron carrier to another, their energy level decreases, and energy is released", 
            "link": "/wiki/Electron_carrier", 
            "name": "Electron carrier"
        }, 
        {
            "def": "Electron donor -An electron donor is a chemical entity that donates electrons to another compound. It is a reducing agent that, by virtue of its donating electrons, is itself oxidized in the process", 
            "link": "/wiki/Electron_donor", 
            "name": "Electron donor"
        }, 
        {
            "def": "Electron microscope -The electron microscope is a type of microscope that uses a beam of electrons to create an image of the specimen. It is capable of much higher magnifications and has a greater resolving power than a light microscope, allowing it to see much smaller objects in finer detail.", 
            "link": "/wiki/Electron_microscope", 
            "name": "Electron microscope"
        }, 
        {
            "def": "Electron shell - An electron shell is the outside part of an atom around the atomic nucleus. It is a group of atomic orbitals with the same value of the principal quantum number n.", 
            "link": "/wiki/Electron_shell", 
            "name": "Electron shell"
        }, 
        {
            "def": "Electron transport chain -The electron transport chain in the mitochondrion is the site of oxidative phosphorylation in eukaryotes. The NADH and succinate generated in the citric acid cycle are oxidized, providing energy to power ATP synthase. Photosynthetic electron transport chain of the thylakoid membrane", 
            "link": "/wiki/Electron_transport_chain", 
            "name": "Electron transport chain"
        }, 
        {
            "def": "Electronegativity -Electronegativity is a measure of the tendency of an atom to attract a bonding pair of electrons. The Pauling scale is the most commonly used. Fluorine (the most electronegative element) is assigned a value of 4.0, and values range down to caesium and francium which are the least electronegative at 0.7.", 
            "link": "/wiki/Electronegativity", 
            "name": "Electronegativity"
        }, 
        {
            "def": "Element -A chemical element or element is a species of atoms having the same number of protons in their atomic nuclei (i.e. the same atomic number, Z). There are 118 elements that have been identified, of which the first 94 occur naturally on Earth with the remaining 24 being synthetic elements", 
            "link": "/wiki/Chemical_element", 
            "name": "Element"
        }, 
        {
            "def": "Embryo - developing stage of a multicellular organism", 
            "link": "/wiki/Embryo", 
            "name": "Embryo"
        }, 
        {
            "def": "Embryo sac -The female gametophyte of a seed plant, within which the embryo develops. ... (in flowering plants) a large cell of the rudimentary seed, within which the embryo develops. ... An oval structure within an ovule of a flowering plant that contains the egg cell", 
            "link": "/wiki/Embryo_sac", 
            "name": "Embryo sac"
        }, 
        {
            "def": "Embryology -s the branch of biology that studies the development of gametes (sex cells), fertilization, and development of embryos and fetuses. Additionally, embryology is the study of congenital disorders that occur before birth", 
            "link": "/wiki/Embryology", 
            "name": "Embryology"
        }, 
        {
            "def": "Enantiomer -Enantiomers are stereoisomers that are non-superimposable mirror images. A molecule with 1 chiral carbon atom exists as 2 stereoisomers termed enantiomers (see the example below). Enantiomers differ in their configuration (R or S) at the stereogenic center.", 
            "link": "/wiki/Enantiomer", 
            "name": "Enantiomer"
        }, 
        {
            "def": "Endangered species -Endangered species are threatened by factors such as habitat loss, hunting, disease and climate change, and usually, endangered species, have a declining population or a very limited range", 
            "link": "/wiki/Endangered_species", 
            "name": "Endangered species"
        }, 
        {
            "def": "Endemism -Endemism is the ecological state of a species being unique to a defined geographic location, such as an island, nation, country or other defined zone, or habitat type; organisms that are indigenous to a place are not endemic to it if they are also found elsewhere.", 
            "link": "/wiki/Endemism", 
            "name": "Endemism"
        }, 
        {
            "def": "Endemic species -Endemism is the ecological state of a species being unique to a defined geographic location, such as an island, nation, country or other defined zone, or habitat type; organisms that are indigenous to a place are not endemic to it if they are also found elsewhere.", 
            "link": "/wiki/Endemic_species", 
            "name": "Endemic species"
        }, 
        {
            "def": "Endergonic reaction -In chemical thermodynamics, an endergonic reaction (also called a nonspontaneous reaction or an unfavorable reaction) is a chemical reaction in which the standard change in free energy is positive, and energy is absorbed", 
            "link": "/wiki/Endergonic_reaction", 
            "name": "Endergonic reaction"
        }, 
        {
            "def": "Endocrine gland -Endocrine glands are glands of the endocrine system that secrete their products, hormones, directly into the blood rather than through a duct. The major glands of the endocrine system include the pineal gland, pituitary gland, pancreas, ovaries, testes, thyroid gland, parathyroid gland, hypothalamus and adrenal glands.", 
            "link": "/wiki/Endocrine_gland", 
            "name": "Endocrine gland"
        }, 
        {
            "def": "Endocrine system -The endocrine system is the collection of glands that produce hormones that regulate metabolism, growth and development, tissue function, sexual function, reproduction, sleep, and mood, among other things.", 
            "link": "/wiki/Endocrine_system", 
            "name": "Endocrine system"
        }, 
        {
            "def": "Endocytosis -Endocytosis is a form of active transport in which a cell transports molecules (such as proteins) into the cell (endo- + cytosis) by engulfing them in an energy-using process.", 
            "link": "/wiki/Endocytosis", 
            "name": "Endocytosis"
        }, 
        {
            "def": "Endoderm -Endoderm is one of the three primary germ layers in the very early human embryo. The other two layers are the ectoderm (outside layer) and mesoderm (middle layer), with the endoderm being the innermost layer", 
            "link": "/wiki/Endoderm", 
            "name": "Endoderm"
        }, 
        {
            "def": "Endodermis -", 
            "link": "/wiki/Endodermis", 
            "name": "Endodermis"
        }, 
        {
            "def": "Endoplasmic reticulum -", 
            "link": "/wiki/Endoplasmic_reticulum", 
            "name": "Endoplasmic reticulum"
        }, 
        {
            "def": "Endosperm -", 
            "link": "/wiki/Endosperm", 
            "name": "Endosperm"
        }, 
        {
            "def": "Endosymbiotic theory -", 
            "link": "/wiki/Endosymbiotic_theory", 
            "name": "Endosymbiotic theory"
        }, 
        {
            "def": "Endotherm -", 
            "link": "/wiki/Endotherm", 
            "name": "Endotherm"
        }, 
        {
            "def": "Entomology -Entomology is the study of insects, but etymology is the study of words", 
            "link": "/wiki/Entomology", 
            "name": "Entomology"
        }, 
        {
            "def": "Environmental biology - the branch of biology concerned with the relations between organisms and their environment. bionomics, ecology. biological science, biology - the science that studies living organisms. palaeoecology, paleoecology - the branch of ecology that studies ancient ecology.", 
            "link": "/wiki/Environmental_biology", 
            "name": "Environmental biology"
        }, 
        {
            "def": "Enzyme -Enzymes are biological molecules (proteins) that act as catalysts and help complex reactions occur everywhere in life. Let's say you ate a piece of meat. Proteases would go to work and help break down the peptide bonds between the amino acids.", 
            "link": "/wiki/Enzyme", 
            "name": "Enzyme"
        }, 
        {
            "def": "Epicotyl -", 
            "link": "/wiki/Epicotyl", 
            "name": "Epicotyl"
        }, 
        {
            "def": "Epidemiology -Epidemiology is the study and analysis of the patterns, causes, and effects of health and disease conditions in defined populations. It is the cornerstone of public health, and shapes policy decisions and evidence-based practice by identifying risk factors for disease and targets for preventive healthcare.", 
            "link": "/wiki/Epidemiology", 
            "name": "Epidemiology"
        }, 
        {
            "def": "Epigenetics -Epigenetics is the study, in the field of genetics, of cellular and physiological phenotypic trait variations that are caused by external or environmental factors that switch genes on and off and affect how cells read genes instead of being caused by changes in the DNA sequence.", 
            "link": "/wiki/Epigenetics", 
            "name": "Epigenetics"
        }, 
        {
            "def": "Epinephrine -", 
            "link": "/wiki/Epinephrine", 
            "name": "Epinephrine"
        }, 
        {
            "def": "Epiphyte -", 
            "link": "/wiki/Epiphyte", 
            "name": "Epiphyte"
        }, 
        {
            "def": "Epistasis -", 
            "link": "/wiki/Epistasis", 
            "name": "Epistasis"
        }, 
        {
            "def": "Estrogen -", 
            "link": "/wiki/Estrogen", 
            "name": "Estrogen"
        }, 
        {
            "def": "Ethology -Ethology is the scientific and objective study of non-human animal behaviour rather than human behaviour and usually with a focus on behaviour under natural conditions, and viewing behaviour as an evolutionarily adaptive trait.", 
            "link": "/wiki/Ethology", 
            "name": "Ethology"
        }, 
        {
            "def": "Eukaryote -", 
            "link": "/wiki/Eukaryote", 
            "name": "Eukaryote"
        }, 
        {
            "def": "Evolution - the change in genetic composition of a population over successive generations, which may be caused by natural selection, inbreeding, hybridization, or mutation.", 
            "link": "/wiki/Evolution", 
            "name": "Evolution"
        }, 
        {
            "def": "Evolutionary biology -Evolutionary biology is the subfield of biology that studies the evolutionary processes that produced the diversity of life on Earth starting from a single origin of life. These processes include the descent of species, and the origin of new species.", 
            "link": "/wiki/Evolutionary_biology", 
            "name": "Evolutionary biology"
        }, 
        {
            "def": "Exocytosis -", 
            "link": "/wiki/Exocytosis", 
            "name": "Exocytosis"
        }, 
        {
            "def": "Exon -", 
            "link": "/wiki/Exon", 
            "name": "Exon"
        }, 
        {
            "def": "Exponential growth -", 
            "link": "/wiki/Exponential_growth", 
            "name": "Exponential growth"
        }, 
        {
            "def": "Expressivity -", 
            "link": "/wiki/Expressivity_(genetics)", 
            "name": "Expressivity"
        }, 
        {
            "def": "External fertilization - sperm units with egg in the open, rather than inside the body of the parents", 
            "link": "/wiki/External_fertilization", 
            "name": "External fertilization"
        }, 
        {
            "def": "Facultative anaerobe - organism which is capable of producing energy through aerobic respiration and then switching to anaerobic respiration depending on the amounts of oxygen and fermentable material in the environment", 
            "link": "/wiki/Facultative_anaerobic_organism", 
            "name": "Facultative anaerobe"
        }, 
        {
            "def": "Fetus - a human embryo after eight weeks of development", 
            "link": "/wiki/Fetus", 
            "name": "Fetus"
        }, 
        {
            "def": "FIRST - For Inspiration and Recognition of Science and Technology - is an organization founded by inventor Dean Kamen in 1989 in order to develop ways to inspire students in engineering and technology fields.", 
            "link": "/wiki/FIRST", 
            "name": "FIRST"
        }, 
        {
            "def": "Food chain -", 
            "link": "/wiki/Food_chain", 
            "name": "Food chain"
        }, 
        {
            "def": "Founder effect -", 
            "link": "/wiki/Founder_effect", 
            "name": "Founder effect"
        }, 
        {
            "def": "Ganglion - ganglion pl. ganglia (gang-lee-un) (gang-lee-ah) [Gk. ganglion, a swelling] A cluster (functional group) of nerve cell bodies in a centralized nervous system.", 
            "link": "/wiki/Ganglion", 
            "name": "Ganglion"
        }, 
        {
            "def": "Gene -A gene is a locus (or region) of DNA that encodes a functional RNA or protein product, and is the molecular unit of heredity. The transmission of genes to an organism's offspring is the basis of the inheritance of phenotypic traits", 
            "link": "/wiki/Gene", 
            "name": "Gene"
        }, 
        {
            "def": "Gene pool -", 
            "link": "/wiki/Gene_pool", 
            "name": "Gene pool"
        }, 
        {
            "def": "Genetic code -", 
            "link": "/wiki/Genetic_code", 
            "name": "Genetic code"
        }, 
        {
            "def": "Genetic drift -", 
            "link": "/wiki/Genetic_drift", 
            "name": "Genetic drift"
        }, 
        {
            "def": "Genetics - the study of heredity", 
            "link": "/wiki/Genetics", 
            "name": "Genetics"
        }, 
        {
            "def": "Genetic variation - variations of genomes between members of species, or between groups of species thriving in different parts of the world as a result of genetic mutation. Genetic diversity in a population or species is a result of new gene combinations (e.g. crossing over of chromosomes), genetic mutations, genetic drift, etc.", 
            "link": "/wiki/Genetic_variation", 
            "name": "Genetic variation"
        }, 
        {
            "def": "Genome -", 
            "link": "/wiki/Genome", 
            "name": "Genome"
        }, 
        {
            "def": "Guanine -", 
            "link": "/wiki/Guanine", 
            "name": "Guanine"
        }, 
        {
            "def": "Gular -of or pertaining to the throat", 
            "link": "/wiki/Gular_(disambiguation)", 
            "name": "Gular"
        }, 
        {
            "def": "Habitat- Habitat is a place for animals, people and plants and non living things", 
            "link": "/wiki/Habitat", 
            "name": "Habitat"
        }, 
        {
            "def": "Hadron -A hadron is any particle that is made from quarks, anti-quarks and gluons. (If you want to learn more about quarks and gluons.", 
            "link": "/wiki/Hadron", 
            "name": "Hadron"
        }, 
        {
            "def": "Hermaphrodite - organism with both male and female reproductive organs", 
            "link": "/wiki/Hermaphrodite", 
            "name": "Hermaphrodite"
        }, 
        {
            "def": "Herpetology -the branch of zoology concerned with reptiles and amphibians.", 
            "link": "/wiki/Herpetology", 
            "name": "Herpetology"
        }, 
        {
            "def": "Heterosis -", 
            "link": "/wiki/Heterosis", 
            "name": "Heterosis"
        }, 
        {
            "def": "Histology -Histology, is the study of the microscopic anatomy of cells and tissues of plants and animals.", 
            "link": "/wiki/Histology", 
            "name": "Histology"
        }, 
        {
            "def": "Hormone -", 
            "link": "/wiki/Hormone", 
            "name": "Hormone"
        }, 
        {
            "def": "Human nutrition -", 
            "link": "/wiki/Human_nutrition", 
            "name": "Human nutrition"
        }, 
        {
            "def": "Hydrocarbon -In organic chemistry, a hydrocarbon is an organic compound consisting entirely of hydrogen and carbon. Hydrocarbons from which one hydrogen atom has been removed are functional groups, called hydrocarbyls.", 
            "link": "/wiki/Hydrocarbon", 
            "name": "Hydrocarbon"
        }, 
        {
            "def": "Ichthyology -Ichthyology (from Greek: ἰχθύς, ikhthus, \"fish\"; and λόγος, logos, \"study\"), also known as Fish Science, is the branch of biology devoted to the study of fish. This includes bony fishes (Osteichthyes), cartilaginous fish (Chondrichthyes), and jawless fish (Agnatha)", 
            "link": "/wiki/Ichthyology", 
            "name": "Ichthyology"
        }, 
        {
            "def": "Immune response -The immune response is how your body recognizes and defends itself against bacteria, viruses, and substances that appear foreign and harmful.", 
            "link": "/wiki/Immune_response", 
            "name": "Immune response"
        }, 
        {
            "def": "Immunogloblin -Immunoglobulins, also known as antibodies, are glycoprotein molecules produced by plasma cells (white blood cells). They act as a critical part of the immune response by specifically recognizing and binding to particular antigens, such as bacteria or viruses and aiding in their destruction.", 
            "link": "/wiki/Immunogloblin", 
            "name": "Immunogloblin"
        }, 
        {
            "def": "Incomplete dominance - Incomplete dominance is a form of intermediate inheritance in which one allele for a specific trait is not completely expressed over its paired allele. This results in a third phenotype in which the expressed physical trait is a combination of the phenotypes of both alleles", 
            "link": "/wiki/Incomplete_dominance", 
            "name": "Incomplete dominance"
        }, 
        {
            "def": "Insulin -Insulin helps keeps your blood sugar level from getting too high (hyperglycemia) or too low (hypoglycemia). ... After you eat food and your blood sugar level rises, cells in your pancreas (known as beta cells) are signaled to release insulin into your bloodstream.", 
            "link": "/wiki/Insulin", 
            "name": "Insulin"
        }, 
        {
            "def": "Interferon -Interferons (IFNs) are a group of signaling proteins[1] made and released by host cells in response to the presence of several pathogens, such as viruses, bacteria, parasites, and also tumor cells. In a typical scenario, a virus-infected cell will release interferons causing nearby cells to heighten their anti-viral defenses.", 
            "link": "/wiki/Interferon", 
            "name": "Interferon"
        }, 
        {
            "def": "Integrative biology -Integrative biology is a label frequently used to describe various forms of cross-disciplinary and multitaxon research. The term is ill defined, but in fact it does rely on principles that are transforming 21st-century science", 
            "link": "/wiki/Integrative_biology", 
            "name": "Integrative biology"
        }, 
        {
            "def": "Interleukin -Interleukin are a group of cytokines (secreted proteins and signal molecules) that were first seen to be expressed by white blood cells (leukocytes)", 
            "link": "/wiki/Interleukin", 
            "name": "Interleukin"
        }, 
        {
            "def": "Internal fertilization - fertilization takes place inside the egg-producing individual.", 
            "link": "/wiki/Internal_fertilization", 
            "name": "Internal fertilization"
        }, 
        {
            "def": "International System of Units -The International System of Units (French: Système international d'unités, SI) is the modern form of the metric system, and is the most widely used system of measurement.", 
            "link": "/wiki/International_System_of_Units", 
            "name": "International System of Units"
        }, 
        {
            "def": "Invertebrate -Invertebrates are a group of animals that have no backbone, unlike animals such as reptiles, amphibians, fish, birds and mammals who all have a backbone.", 
            "link": "/wiki/Invertebrate", 
            "name": "Invertebrate"
        }, 
        {
            "def": "Ion -an atom or molecule with a net electric charge due to the loss or gain of one or more electrons.", 
            "link": "/wiki/Ion", 
            "name": "Ion"
        }, 
        {
            "def": "Ionic bond -Ionic bonding is the complete transfer of valence electron(s) between atoms. It is a type of chemical bond that generates two oppositely charged ions. In ionic bonds, the metal loses electrons to become a positively charged cation, whereas the nonmetal accepts those electrons to become a negatively charged anion.", 
            "link": "/wiki/Ionic_bond", 
            "name": "Ionic bond"
        }, 
        {
            "def": "Isomer -An isomer is a molecule with the same chemical formula as another molecule, but with a different chemical structure. That is, isomers contain the same number of atoms of each element, but have different arrangements of their atoms.", 
            "link": "/wiki/Isomer", 
            "name": "Isomer"
        }, 
        {
            "def": "Isotonic solution -An isotonic solution refers to two solutions having the same osmotic pressure across a semipermeable membrane. This state allows for the free movement of water across the membrane without changing the concentration of solutes on either side", 
            "link": "/wiki/Isotonic_solutions", 
            "name": "Isotonic solution"
        }, 
        {
            "def": "Isotope -Each atomic number identifies a specific element, but not the isotope; an atom of a given element may have a wide range in its number of neutrons. The number of nucleons (both protons and neutrons) in the nucleus is the atom's mass number, and each isotope of a given element has a different mass number", 
            "link": "/wiki/Isotope", 
            "name": "Isotope"
        }, 
        {
            "def": "Jejunum - The midsection of the small intestine of many higher vertebrates like mammals, birds, reptiles is called as jejunum. It is present between the duodenum and the ileum.", 
            "link": "/wiki/Jejunum", 
            "name": "Jejunum"
        }, 
        {
            "def": "Krebs cycle -The citric acid cycle – also known as the tricarboxylic acid (TCA) cycle or the Krebs cycle[1][2] – is a series of chemical reactions used by all aerobic organisms to generate energy through the oxidation of acetyl-CoA derived from carbohydrates, fats and proteins into carbon dioxide and chemical energy in the form of guanosine triphosphate (GTP). In addition, the cycle provides precursors of certain amino acids as well as the reducing agent NADH that is used in numerous other biochemical reactions. Its central importance to many biochemical pathways suggests that it was one of the earliest established components of cellular metabolism and may have originated abiogenically.[", 
            "link": "/wiki/Krebs_cycle", 
            "name": "Krebs cycle"
        }, 
        {
            "def": "Lacteal -A lacteal is a lymphatic capillary that absorbs dietary fats in the villi of the small intestine.", 
            "link": "/wiki/Lacteal", 
            "name": "Lacteal"
        }, 
        {
            "def": "Lagging strand -On the lagging strand template, a primase \"reads\" the template DNA and initiates synthesis of a short complementary RNA primer. A DNA polymerase extends the primed segments, forming Okazaki fragments. The RNA primers are then removed and replaced with DNA, and the fragments of DNA are joined together by DNA ligase", 
            "link": "/wiki/Lagging_strand", 
            "name": "Lagging strand"
        }, 
        {
            "def": "Larva -A larva (plural larvae /ˈlɑːrviː/) is a distinct juvenile form many animals undergo before metamorphosis into adults. Animals with indirect development such as insects, amphibians, or cnidarians typically have a larval phase of their life cycle.", 
            "link": "/wiki/Larva", 
            "name": "Larva"
        }, 
        {
            "def": "Law of independent assortment -law of independent assortment. the principle, originated by Gregor Mendel, stating that when two or more characteristics are inherited, individual hereditary factors assort independently during gamete production, giving different traits an equal opportunity of occurring together.", 
            "link": "/wiki/Law_of_independent_assortment", 
            "name": "Law of independent assortment"
        }, 
        {
            "def": "Lepton -A lepton is an elementary, half-integer spin (spin 1⁄2) particle that does not undergo strong interactions. Two main classes of leptons exist: charged leptons (also known as the electron-like leptons), and neutral leptons (better known as neutrinos", 
            "link": "/wiki/Lepton", 
            "name": "Lepton"
        }, 
        {
            "def": "Leukocyte -a colourless cell which circulates in the blood and body fluids and is involved in counteracting foreign substances and disease; a white (blood) cell. There are several types, all amoeboid cells with a nucleus, including lymphocytes, granulocytes, and monocytes.", 
            "link": "/wiki/Leukocyte", 
            "name": "Leukocyte"
        }, 
        {
            "def": "Ligament -a ligament is the fibrous connective tissue that connects bones to other bones and is also known as articular ligament, articular larua,[1] fibrous ligament, or true ligament.", 
            "link": "/wiki/Ligament", 
            "name": "Ligament"
        }, 
        {
            "def": "Linked genes -When two genes are close together on the same chromosome, they do not assort independently and are said to be linked", 
            "link": "/wiki/Linked_genes", 
            "name": "Linked genes"
        }, 
        {
            "def": "Lipid -A lipid is chemically defined as a substance that is insoluble in water and soluble in alcohol, ether, and chloroform. Lipids are an important component of living cells. Together with carbohydrates and proteins, lipids are the main constituents of plant and animal cells. Cholesterol and triglycerides are lipids.", 
            "link": "/wiki/Lipid", 
            "name": "Lipid"
        }, 
        {
            "def": "Lipoprotein - A lipoprotein is a biochemical assembly that contains both proteins and lipids, bound to the proteins, which allow fats to move through the water inside and outside cells. The proteins serve to emulsify the lipid molecules.", 
            "link": "/wiki/Lipoprotein", 
            "name": "Lipoprotein"
        }, 
        {
            "def": "M phase -Mitosis and cytokinesis together define the mitotic (M) phase of an animal cell cycle—the division of the mother cell into two daughter cells, genetically identical to each other and to their parent cell.", 
            "link": "/wiki/M_phase", 
            "name": "M phase"
        }, 
        {
            "def": "Macroevolution -Macroevolution is evolution on a scale of separated gene pools. Macroevolutionary studies focus on change that occurs at or above the level of species, in contrast with microevolution, which refers to smaller evolutionary changes (typically described as changes in allele frequencies) within a species or population.", 
            "link": "/wiki/Macroevolution", 
            "name": "Macroevolution"
        }, 
        {
            "def": "Macromolecule -A macromolecule is a very large molecule, such as protein, commonly created by polymerization of smaller subunits (monomers). They are typically composed of thousands or more atoms.", 
            "link": "/wiki/Macromolecule", 
            "name": "Macromolecule"
        }, 
        {
            "def": "Macronutrient -Macronutrients are nutrients that provide calories or energy. Nutrients are substances needed for growth, metabolism, and for other body functions. Since \"macro\" means large, macronutrients are nutrients needed in large amounts. There are three macronutrients: Carbohydrate.", 
            "link": "/wiki/Macronutrient", 
            "name": "Macronutrient"
        }, 
        {
            "def": "Macrophage -A macrophage is a kind of swallowing cell, which means it functions by literally swallowing up other particles or smaller cells. Macrophages engulf and digest debris (like dead cells) and foreign particles through the process of phagocytosis, so macrophages act like scavengers", 
            "link": "/wiki/Macrophage", 
            "name": "Macrophage"
        }, 
        {
            "def": "Mammalogy -mammalogy is the study of mammals – a class of vertebrates with characteristics such as homeothermic metabolism, fur, four-chambered hearts, and complex nervous systems.", 
            "link": "/wiki/Mammalogy", 
            "name": "Mammalogy"
        }, 
        {
            "def": "Marine biology -Marine biology is the scientific study of organisms in the ocean or other marine bodies of water. Given that in biology many phyla, families and genera have some species that live in the sea and others that live on land, marine biology classifies species based on the environment rather than on taxonomy.", 
            "link": "/wiki/Marine_biology", 
            "name": "Marine biology"
        }, 
        {
            "def": "Mass balance -A mass balance, also called a material balance, is an application of conservation of mass to the analysis of physical systems. By accounting for material entering and leaving a system, mass flows can be identified which might have been unknown, or difficult to measure without this technique", 
            "link": "/wiki/Mass_balance", 
            "name": "Mass balance"
        }, 
        {
            "def": "Mass density -Density is mass per volume. Lead is dense, Styrofoam is not. The metric system was designed so that water will have a density of one gram per cubic centimeter or 1000 kilograms per cubic meter.", 
            "link": "/wiki/Mass_density", 
            "name": "Mass density"
        }, 
        {
            "def": "Mass number -The mass number (A), also called atomic mass number or nucleon number, is the total number of protons and neutrons (together known as nucleons) in an atomic nucleus", 
            "link": "/wiki/Mass_number", 
            "name": "Mass number"
        }, 
        {
            "def": "Mast cell -a cell filled with basophil granules, found in numbers in connective tissue and releasing histamine and other substances during inflammatory and allergic reactions.", 
            "link": "/wiki/Mast_cell", 
            "name": "Mast cell"
        }, 
        {
            "def": "Medulla - the continuation of the spinal cord within the skull, forming the lowest part of the brainstem and containing control centres for the heart and lungs.", 
            "link": "/wiki/Medulla_oblongata", 
            "name": "Medulla"
        }, 
        {
            "def": "Meiosis - Meiosis is a type of cell division that reduces the number of chromosomes in the parent cell by half and produces four gamete cells. This process is required to produce egg and sperm cells for sexual reproduction.", 
            "link": "/wiki/Meiosis", 
            "name": "Meiosis"
        }, 
        {
            "def": "Membrane potential - When a nerve or muscle cell is at \"rest\", its membrane potential is called the resting membrane potential. In a typical neuron, this is about –70 millivolts (mV). The minus sign indicates that the inside of the cell is negative with respect to the surrounding extracellular fluid", 
            "link": "/wiki/Membrane_potential", 
            "name": "Membrane potential"
        }, 
        {
            "def": "Meson -mesons (/ˈmiːzɒnz/ or /ˈmɛzɒnz/) are hadronic subatomic particles composed of one quark and one antiquark, bound together by the strong interaction.", 
            "link": "/wiki/Meson", 
            "name": "Meson"
        }, 
        {
            "def": "Messenger RNA -", 
            "link": "/wiki/Messenger_RNA", 
            "name": "Messenger RNA"
        }, 
        {
            "def": "Metaphase -Metaphase is the third phase of mitosis, the process that separates duplicated genetic material carried in the nucleus of a parent cell into two identical daughter cells. During metaphase, the cell's chromosomes align themselves in the middle of the cell through a type of cellular \"tug of war", 
            "link": "/wiki/Metaphase", 
            "name": "Metaphase"
        }, 
        {
            "def": "Microbiology -Microbiology is the study of microscopic organisms, such as bacteria, viruses, archaea, fungi and protozoa. This discipline includes fundamental research on the biochemistry, physiology, cell biology, ecology, evolution and clinical aspects of microorganisms, including the host response to these agents.", 
            "link": "/wiki/Microbiology", 
            "name": "Microbiology"
        }, 
        {
            "def": "Microevolution -", 
            "link": "/wiki/Microevolution", 
            "name": "Microevolution"
        }, 
        {
            "def": "Microtome -", 
            "link": "/wiki/Microtome", 
            "name": "Microtome"
        }, 
        {
            "def": "Mitosis -Mitosis is the process in which a eukaryotic cell nucleus splits in two, followed by division of the parent cell into two daughter cells. The word \"mitosis\" means \"threads,\" and it refers to the threadlike appearance of chromosomes as the cell prepares to divide.", 
            "link": "/wiki/Mitosis", 
            "name": "Mitosis"
        }, 
        {
            "def": "Molarity -Molarity is a unit of concentration measuring the number of moles of a solute per liter of solution", 
            "link": "/wiki/Molarity", 
            "name": "Molarity"
        }, 
        {
            "def": "Mole -Mole is the SI unit of measurement used to measure the number of things, usually atoms or molecules. One mole of something is equal to Avogadro's number.", 
            "link": "/wiki/Mole_(unit)", 
            "name": "Mole"
        }, 
        {
            "def": "Molecule - A molecule is the smallest particle in a chemical element or compound that has the chemical properties of that element or compound. Molecules are made up of atom s that are held together by chemical bonds. These bonds form as a result of the sharing or exchange of electron s among atoms", 
            "link": "/wiki/Molecule", 
            "name": "Molecule"
        }, 
        {
            "def": "Molecular biology -Molecular biology is a branch of science concerning biological activity at the molecular level. The field of molecular biology overlaps with biology and chemistry and in particular, genetics and biochemistry.", 
            "link": "/wiki/Molecular_biology", 
            "name": "Molecular biology"
        }, 
        {
            "def": "Molecular physics -Molecular physics is the study of the physical properties of molecules, the chemical bonds between atoms as well as the molecular dynamics. Its most important experimental techniques are the various types of spectroscopy; scattering is also used. The field is closely related to atomic physics and overlaps greatly with theoretical chemistry, physical chemistry and chemical physics.", 
            "link": "/wiki/Molecular_physics", 
            "name": "Molecular physics"
        }, 
        {
            "def": "Monomer -", 
            "link": "/wiki/Monomer", 
            "name": "Monomer"
        }, 
        {
            "def": "Motor neuron -", 
            "link": "/wiki/Motor_neuron", 
            "name": "Motor neuron"
        }, 
        {
            "def": "Mucous membrane -", 
            "link": "/wiki/Mucous_membrane", 
            "name": "Mucous membrane"
        }, 
        {
            "def": "Multicellular organism -", 
            "link": "/wiki/Multicellular_organism", 
            "name": "Multicellular organism"
        }, 
        {
            "def": "Muon -The muon is an unstable subatomic particle with a mean lifetime of 2.2 µs. Among all known unstable subatomic particles, only the neutron (lasting around 15 minutes) and some atomic nuclei have a longer decay lifetime; others decay significantly faster.", 
            "link": "/wiki/Muon", 
            "name": "Muon"
        }, 
        {
            "def": "Mycology -Mycology is the branch of biology concerned with the study of fungi, including their genetic and biochemical properties, their taxonomy and their use to humans as a source for tinder, medicine, food, and entheogens, as well as their dangers, such as poisoning or infection", 
            "link": "/wiki/Mycology", 
            "name": "Mycology"
        }, 
        {
            "def": "Myofibril -", 
            "link": "/wiki/Myofibril", 
            "name": "Myofibril"
        }, 
        {
            "def": "Myosin -", 
            "link": "/wiki/Myosin", 
            "name": "Myosin"
        }, 
        {
            "def": "Natural selection - a process in nature in which organisms possessing certain genotypic characteristics that make them better adjusted to an environment tend to survive, reproduce, increase in number or frequency, and therefore, are able to transmit and perpetuate their essential genotypic qualities to succeeding generations.", 
            "link": "/wiki/Natural_selection", 
            "name": "Natural selection"
        }, 
        {
            "def": "Neurobiology -Neurobiology is the study of cells of the nervous system and the organization of these cells into functional circuits that process information and mediate behavior. It is a subdiscipline of both biology and neuroscience.", 
            "link": "/wiki/Neurobiology", 
            "name": "Neurobiology"
        }, 
        {
            "def": "Neuromuscular junction -", 
            "link": "/wiki/Neuromuscular_junction", 
            "name": "Neuromuscular junction"
        }, 
        {
            "def": "Neuron -", 
            "link": "/wiki/Neuron", 
            "name": "Neuron"
        }, 
        {
            "def": "Neurotransmitter -", 
            "link": "/wiki/Neurotransmitter", 
            "name": "Neurotransmitter"
        }, 
        {
            "def": "Neutrino -A neutrino (/nuːˈtriːnoʊ/ or /njuːˈtriːnoʊ/) (denoted by the Greek letter ν) is a lepton, an elementary particle with half-integer spin, that interacts only via the weak subatomic force and gravity. The mass of the neutrino is tiny compared to other subatomic particles.", 
            "link": "/wiki/Neutrino", 
            "name": "Neutrino"
        }, 
        {
            "def": "Nucleic acid -", 
            "link": "/wiki/Nucleic_acid", 
            "name": "Nucleic acid"
        }, 
        {
            "def": "Nucleic acid sequence -", 
            "link": "/wiki/Nucleic_acid_sequence", 
            "name": "Nucleic acid sequence"
        }, 
        {
            "def": "Nucleobase -", 
            "link": "/wiki/Nucleobase", 
            "name": "Nucleobase"
        }, 
        {
            "def": "Nucleoid -", 
            "link": "/wiki/Nucleoid", 
            "name": "Nucleoid"
        }, 
        {
            "def": "Nucleolus -", 
            "link": "/wiki/Nucleolus", 
            "name": "Nucleolus"
        }, 
        {
            "def": "Nucleotide -", 
            "link": "/wiki/Nucleotide", 
            "name": "Nucleotide"
        }, 
        {
            "def": "Organ -", 
            "link": "/wiki/Organ_(anatomy)", 
            "name": "Organ"
        }, 
        {
            "def": "Organism -", 
            "link": "/wiki/Organism", 
            "name": "Organism"
        }, 
        {
            "def": "Oncology -Oncology is a branch of medicine that deals with the prevention, diagnosis and treatment of cancer.", 
            "link": "/wiki/Oncology", 
            "name": "Oncology"
        }, 
        {
            "def": "Ornithology -Ornithology is a branch of zoology that concerns the study of birds. Etymologically, the word \"ornithology\" derives from the ancient Greek ὄρνις ornis (\"bird\") and λόγος logos (\"rationale\" or \"explanation\").", 
            "link": "/wiki/Ornithology", 
            "name": "Ornithology"
        }, 
        {
            "def": "Osmosis -Osmosis is the spontaneous net movement of solvent molecules through a semi-permeable membrane into a region of higher solute concentration, in the direction that tends to equalize the solute concentrations on the two sides.", 
            "link": "/wiki/Osmosis", 
            "name": "Osmosis"
        }, 
        {
            "def": "Paleontology -Paleontology is the study of the history of life on Earth as reflected in the fossil record. Fossils are the remains or traces of organisms (plants, animals, fungi, bacteria and other single-celled living things) that lived in the geological past and are preserved in the crust of the Earth.", 
            "link": "/wiki/Paleontology", 
            "name": "Paleontology"
        }, 
        {
            "def": "Parallel evolution -", 
            "link": "/wiki/Parallel_evolution", 
            "name": "Parallel evolution"
        }, 
        {
            "def": "Parasitology -Parasitology is the study of parasites, their hosts, and the relationship between them. As a biological discipline, the scope of parasitology is not determined by the organism or environment in question, but by their way of life.", 
            "link": "/wiki/Parasitology", 
            "name": "Parasitology"
        }, 
        {
            "def": "Pathobiology - The study or practice of pathology with greater emphasis on the biological than on the medical aspects.", 
            "link": "/wiki/Pathobiology", 
            "name": "Pathobiology"
        }, 
        {
            "def": "Pathology -Pathology is a medical specialty that is concerned with the diagnosis of disease based on the laboratory analysis of bodily fluids such as blood and urine, as well as tissues, using the tools of chemistry, clinical microbiology, hematology and molecular pathology", 
            "link": "/wiki/Pathology", 
            "name": "Pathology"
        }, 
        {
            "def": "pH -pH (/piːˈeɪtʃ/) is a numeric scale used to specify the acidity or basicity (alkalinity) of an aqueous solution. It is roughly the negative of the logarithm to base 10 of the concentration, measured in units of moles per liter, of hydrogen ions.", 
            "link": "/wiki/PH", 
            "name": "pH"
        }, 
        {
            "def": "Pharmacology - pharmacology is the science of drug action on biological systems. In its entirety, it embraces knowledge of the sources, chemical properties, biological effects and therapeutic uses of drugs.", 
            "link": "/wiki/Pharmacology", 
            "name": "Pharmacology"
        }, 
        {
            "def": "Phenotype -", 
            "link": "/wiki/Phenotype", 
            "name": "Phenotype"
        }, 
        {
            "def": "Pheromone -", 
            "link": "/wiki/Pheromone", 
            "name": "Pheromone"
        }, 
        {
            "def": "Phloem -", 
            "link": "/wiki/Phloem", 
            "name": "Phloem"
        }, 
        {
            "def": "Physiology -the branch of biology dealing with the functions and activities of living organisms and their parts, including all physical and chemical processes.", 
            "link": "/wiki/Physiology", 
            "name": "Physiology"
        }, 
        {
            "def": "Phytochemistry -", 
            "link": "/wiki/Phytochemistry", 
            "name": "Phytochemistry"
        }, 
        {
            "def": "Phytopathology -Phytopathology or plant pathology is the science of diagnosing and managing plant diseases.", 
            "link": "/wiki/Phytopathology", 
            "name": "Phytopathology"
        }, 
        {
            "def": "Placebo -", 
            "link": "/wiki/Placebo", 
            "name": "Placebo"
        }, 
        {
            "def": "Plant nutrition -", 
            "link": "/wiki/Plant_nutrition", 
            "name": "Plant nutrition"
        }, 
        {
            "def": "Plasmolysis -", 
            "link": "/wiki/Plasmolysis", 
            "name": "Plasmolysis"
        }, 
        {
            "def": "Pollination -", 
            "link": "/wiki/Pollination", 
            "name": "Pollination"
        }, 
        {
            "def": "Polygene -", 
            "link": "/wiki/Polygene", 
            "name": "Polygene"
        }, 
        {
            "def": "Polymer -", 
            "link": "/wiki/Polymer", 
            "name": "Polymer"
        }, 
        {
            "def": "Polymerase chain reaction -", 
            "link": "/wiki/Polymerase_chain_reaction", 
            "name": "Polymerase chain reaction"
        }, 
        {
            "def": "Polyploid -", 
            "link": "/wiki/Polyploid", 
            "name": "Polyploid"
        }, 
        {
            "def": "Population biology -Population biology is the study of populations of organisms, especially the regulation of population size, life history traits such as clutch size, and extinction", 
            "link": "/wiki/Population_biology", 
            "name": "Population biology"
        }, 
        {
            "def": "Population ecology -Population ecology or autoecology is a sub-field of ecology that deals with the dynamics of species populations and how these populations interact with the environment. It is the study of how the population sizes of species change over time and space.", 
            "link": "/wiki/Population_ecology", 
            "name": "Population ecology"
        }, 
        {
            "def": "Population genetics -Population genetics is the study of genetic variation within populations, and involves the examination and modelling of changes in the frequencies of genes and alleles in populations over space and time", 
            "link": "/wiki/Population_genetics", 
            "name": "Population genetics"
        }, 
        {
            "def": "Predation -", 
            "link": "/wiki/Predation", 
            "name": "Predation"
        }, 
        {
            "def": "Primase -", 
            "link": "/wiki/Primase", 
            "name": "Primase"
        }, 
        {
            "def": "Prokaryote -", 
            "link": "/wiki/Prokaryote", 
            "name": "Prokaryote"
        }, 
        {
            "def": "Protein -", 
            "link": "/wiki/Protein", 
            "name": "Protein"
        }, 
        {
            "def": "Psychobiology -Behavioral neuroscience, also known as biological psychology, biopsychology, or psychobiology is the application of the principles of biology to the study of physiological, genetic, and developmental mechanisms of behavior in humans and other animals.", 
            "link": "/wiki/Psychobiology", 
            "name": "Psychobiology"
        }, 
        {
            "def": "Quark -A quark (/ˈkwɔːrk/ or /ˈkwɑːrk/) is an elementary particle and a fundamental constituent of matter. Quarks combine to form composite particles called hadrons, the most stable of which are protons and neutrons, the components of atomic nuclei.", 
            "link": "/wiki/Quark", 
            "name": "Quark"
        }, 
        {
            "def": "Reproduction- Giving birth to one of its kind, sexually or asexually.", 
            "link": "/wiki/Reproduction", 
            "name": "Reproduction"
        }, 
        {
            "def": "RNA -", 
            "link": "/wiki/RNA", 
            "name": "RNA"
        }, 
        {
            "def": "Sexual reproduction - type of reproduction in which cells from two parents unite to form the first cell of a new organism", 
            "link": "/wiki/Sexual_reproduction", 
            "name": "Sexual reproduction"
        }, 
        {
            "def": "SI units -a system of physical units ( SI units ) based on the metre, kilogram, second, ampere, kelvin, candela, and mole, together with a set of prefixes to indicate multiplication or division by a power of ten.", 
            "link": "/wiki/SI_units", 
            "name": "SI units"
        }, 
        {
            "def": "Sociobiology -Sociobiology is a field of scientific study that is based on the hypothesis that social behavior has resulted from evolution and attempts to explain and examine social behavior within that context.", 
            "link": "/wiki/Sociobiology", 
            "name": "Sociobiology"
        }, 
        {
            "def": "Species -", 
            "link": "/wiki/Species", 
            "name": "Species"
        }, 
        {
            "def": "Stem cell -", 
            "link": "/wiki/Stem_cell", 
            "name": "Stem cell"
        }, 
        {
            "def": "Steroid -", 
            "link": "/wiki/Steroid", 
            "name": "Steroid"
        }, 
        {
            "def": "Structural biology -Structural biology is a branch of molecular biology, biochemistry, and biophysics concerned with the molecular structure of biological macromolecules, especially proteins and nucleic acids, how they acquire the structures they have, and how alterations in their structures affect their function.", 
            "link": "/wiki/Structural_biology", 
            "name": "Structural biology"
        }, 
        {
            "def": "Symbiogenesis -", 
            "link": "/wiki/Symbiogenesis", 
            "name": "Symbiogenesis"
        }, 
        {
            "def": "Synthetic biology -Synthetic biology is an interdisciplinary branch of biology and engineering. The subject combines various disciplines from within these domains, such as biotechnology, evolutionary biology, molecular biology, systems biology, biophysics, computer engineering, and genetic engineering", 
            "link": "/wiki/Synthetic_biology", 
            "name": "Synthetic biology"
        }, 
        {
            "def": "Systematics -", 
            "link": "/wiki/Systematics", 
            "name": "Systematics"
        }, 
        {
            "def": "T cell -", 
            "link": "/wiki/T_cell", 
            "name": "T cell"
        }, 
        {
            "def": "Testosterone -", 
            "link": "/wiki/Testosterone", 
            "name": "Testosterone"
        }, 
        {
            "def": "Thymine -", 
            "link": "/wiki/Thymine", 
            "name": "Thymine"
        }, 
        {
            "def": "Transcription -Transcription is the first step of gene expression, in which a particular segment of DNA is copied into RNA (mRNA) by the enzyme RNA polymerase. Both RNA and DNA are nucleic acids, which use base pairs of nucleotides as a complementary language", 
            "link": "/wiki/Transcription_(genetics)", 
            "name": "Transcription"
        }, 
        {
            "def": "Transfer RNA -", 
            "link": "/wiki/Transfer_RNA", 
            "name": "Transfer RNA"
        }, 
        {
            "def": "Translation -", 
            "link": "/wiki/Translation_(biology)", 
            "name": "Translation"
        }, 
        {
            "def": "Trophic level -", 
            "link": "/wiki/Trophic_level", 
            "name": "Trophic level"
        }, 
        {
            "def": "Unicellular organism -", 
            "link": "/wiki/Unicellular_organism", 
            "name": "Unicellular organism"
        }, 
        {
            "def": "Uracil -", 
            "link": "/wiki/Uracil", 
            "name": "Uracil"
        }, 
        {
            "def": "Urea -", 
            "link": "/wiki/Urea", 
            "name": "Urea"
        }, 
        {
            "def": "Uric acid -", 
            "link": "/wiki/Uric_acid", 
            "name": "Uric acid"
        }, 
        {
            "def": "Urine -", 
            "link": "/wiki/Urine", 
            "name": "Urine"
        }, 
        {
            "def": "Uterus -", 
            "link": "/wiki/Uterus", 
            "name": "Uterus"
        }, 
        {
            "def": "Vacuole -Plant cell structure. Animal cell structure. A vacuole (/ˈvækjuːoʊl/) is a membrane-bound organelle which is present in all plant and fungal cells and some protist, animal and bacterial cells.", 
            "link": "/wiki/Vacuole", 
            "name": "Vacuole"
        }, 
        {
            "def": "Valence -In several fields the valence of an element refers to the number of elements to which it can connect: Valence (chemistry), the valence of an atom. Valency (linguistics), the valence of a verb. Degree (graph theory), also called the valency of a vertex in graph theory.", 
            "link": "/wiki/Valence_(chemistry)", 
            "name": "Valence"
        }, 
        {
            "def": "Valence band -The valence band is the highest range of electron energies in which electrons are normally present at absolute zero temperature, while the conduction band is the lowest range of vacant electronic states.", 
            "link": "/wiki/Valence_band", 
            "name": "Valence band"
        }, 
        {
            "def": "Valence bond theory - Valence bond theory (VB) is a straightforward extension of Lewis structures. Valence bond theory says that electrons in a covalent bond reside in a region that is the overlap of individual atomic orbitals.", 
            "link": "/wiki/Valence_bond_theory", 
            "name": "Valence bond theory"
        }, 
        {
            "def": "Valence electron - a valence electron is an electron that is associated with an atom, and that can participate in the formation of a chemical bond; in a single covalent bond, both atoms in the bond contribute one valence electron in order to form a shared pair", 
            "link": "/wiki/Valence_electron", 
            "name": "Valence electron"
        }, 
        {
            "def": "Valence shell -The electrons in the outermost occupied shell (or shells) determine the chemical properties of the atom; it is called the valence shell. Each shell consists of one or more subshells, and each subshell consists of one or more atomic orbitals.", 
            "link": "/wiki/Valence_shell", 
            "name": "Valence shell"
        }, 
        {
            "def": "Vasodilation -", 
            "link": "/wiki/Vasodilation", 
            "name": "Vasodilation"
        }, 
        {
            "def": "Vegetative reproduction -", 
            "link": "/wiki/Vegetative_reproduction", 
            "name": "Vegetative reproduction"
        }, 
        {
            "def": "Vesicle -", 
            "link": "/wiki/Vesicle_(biology_and_chemistry)", 
            "name": "Vesicle"
        }, 
        {
            "def": "Vestigiality -", 
            "link": "/wiki/Vestigiality", 
            "name": "Vestigiality"
        }, 
        {
            "def": "Virology -Virology is the study of viruses – submicroscopic, parasitic particles of genetic material contained in a protein coat – and virus-like agents.", 
            "link": "/wiki/Virology", 
            "name": "Virology"
        }, 
        {
            "def": "Virus -", 
            "link": "/wiki/Virus", 
            "name": "Virus"
        }, 
        {
            "def": "Water potential -", 
            "link": "/wiki/Water_potential", 
            "name": "Water potential"
        }, 
        {
            "def": "White Blood Cell Component of the blood that functions in the immune system. Also known as a leukocyte.", 
            "link": "/wiki/White_Blood_Cell", 
            "name": "White Blood Cell"
        }, 
        {
            "def": "Whole genome sequencing -", 
            "link": "/wiki/Whole_genome_sequencing", 
            "name": "Whole genome sequencing"
        }, 
        {
            "def": "Wobble base pair -", 
            "link": "/wiki/Wobble_base_pair", 
            "name": "Wobble base pair"
        }, 
        {
            "def": "Wood - The inner layer of the stems of woody plants; composed of xylem.", 
            "link": "/wiki/Wood", 
            "name": "Wood"
        }, 
        {
            "def": "Xanthophyll - the yellow colored photosynthetic pigments", 
            "link": "/wiki/Xanthophyll", 
            "name": "Xanthophyll"
        }, 
        {
            "def": "Xylem -", 
            "link": "/wiki/Xylem", 
            "name": "Xylem"
        }, 
        {
            "def": "Yeast artificial chromosome -", 
            "link": "/wiki/Yeast_artificial_chromosome", 
            "name": "Yeast artificial chromosome"
        }, 
        {
            "def": "Yolk -", 
            "link": "/wiki/Yolk", 
            "name": "Yolk"
        }, 
        {
            "def": "Zoology -", 
            "link": "/wiki/Zoology", 
            "name": "Zoology"
        }, 
        {
            "def": "Zygote -", 
            "link": "/wiki/Zygote", 
            "name": "Zygote"
        }
    ]
}