{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_Hinduism_terms", 
    "words": [
        {
            "def": "Abhimanyu (अभिमन्यु): Son of Arjuna and Subhadra who was married to Uttara, daughter of King Virata. He was deceitfully killed by the Kauravas during Kurukshetra.[1]", 
            "link": "/wiki/Abhimanyu", 
            "name": "Abhimanyu"
        }, 
        {
            "def": "Āchārya (आचार्य): Teacher or Guru.", 
            "link": "/wiki/Acharya", 
            "name": "Āchārya"
        }, 
        {
            "def": "Achyuta (अच्युत): A synonym of Sri Vishnu.", 
            "link": "/wiki/Achyuta", 
            "name": "Achyuta"
        }, 
        {
            "def": "Adhiratha (अधिरथ): Karna's foster-father.", 
            "link": "/wiki/Adhiratha", 
            "name": "Adhiratha"
        }, 
        {
            "def": "Adi Shankara (आदि शङ्कर): The first Hindu philosopher who consolidated the principles of the Advaita Vedanta philosophy.", 
            "link": "/wiki/Adi_Shankara", 
            "name": "Adi Shankara"
        }, 
        {
            "def": "Aditi (अदिति): A goddess of the sky, consciousness, the past, the future and fertility.", 
            "link": "/wiki/Aditi", 
            "name": "Aditi"
        }, 
        {
            "def": "Advaita Vedanta (अद्वैत वेदान्त): A school of Hindu philosophy often called a monistic or non-dualistic system which refers to the indivisibility of the Self (Atman) from the Whole (Brahman).", 
            "link": "/wiki/Advaita_Vedanta", 
            "name": "Advaita Vedanta"
        }, 
        {
            "def": "Agastya (अगस्त्य): A great sage whose life-story the Pandavas learnt while on pilgrimage to holy places, his wife Lopamudra was equally a great sage in her own right.", 
            "link": "/wiki/Agastya", 
            "name": "Agastya"
        }, 
        {
            "def": "Aghāsur (अघासुर): A dragon sent by Kamsa to destroy Krishna", 
            "link": "/wiki/Aghasura", 
            "name": "Aghāsur"
        }, 
        {
            "def": "Āgneyāstra (आग्नेयास्त्र): Āgneyāstra is the fire weapon, incepted by God Agni, master of the flames.", 
            "link": "/wiki/Agneyastra", 
            "name": "Āgneyāstra"
        }, 
        {
            "def": "Agni (अग्‍नि): The sacred Hindu fire god.[2]", 
            "link": "/wiki/Agni", 
            "name": "Agni"
        }, 
        {
            "def": "Agnihotra (अग्निहोत्र): A sacrifice to God Agni.", 
            "link": "/wiki/Agnihotra", 
            "name": "Agnihotra"
        }, 
        {
            "def": "Ahi (अहि): Means (\"snake\"), Vritra was also known in the Vedas as Ahi cognate with Azhi Dahaka of Zoroastrian mythology and he is said to have had three heads.", 
            "link": "/wiki/Ahi_(Hinduism)", 
            "name": "Ahi"
        }, 
        {
            "def": "Ahamkara (अहंकार): A Sanskrit term that refers to the ego of one's self, the identification of one's own ego.", 
            "link": "/wiki/Ahamkara", 
            "name": "Ahamkara"
        }, 
        {
            "def": "Ahimsā (अहिंसा): A religious concept which advocates non-violence and a respect for all life.", 
            "link": "/wiki/Ahimsa", 
            "name": "Ahimsā"
        }, 
        {
            "def": "Airāvata (ऐरावत): Indra's elephant.", 
            "link": "/wiki/Airavata", 
            "name": "Airāvata"
        }, 
        {
            "def": "Ajasat (अजसत):The Prince who plots with Devadatta to kill Buddha", 
            "link": "/w/index.php?title=Ajasat&action=edit&redlink=1", 
            "name": "Ajasat"
        }, 
        {
            "def": "Ajatashatru (अजातशत्रु): Having no enemy, friend of all born things, an epithet of Yudhishthira.", 
            "link": "/wiki/Ajatashatru", 
            "name": "Ajatashatru"
        }, 
        {
            "def": "Akampana (अकम्‍पन): Meaning (Unconquerable) - A rākshasa slain by Hanumaān at seize.", 
            "link": "/w/index.php?title=Akampana&action=edit&redlink=1", 
            "name": "Akampana"
        }, 
        {
            "def": "Akshayapatra (अक्षयपत्र): A wonderful vessel given to Yudhishthira by the Sun god which held a never-failing supply of food.", 
            "link": "/wiki/Akshayapatra", 
            "name": "Akshayapatra"
        }, 
        {
            "def": "Alara (अलर) : A famous sage, sought out by Buddha", 
            "link": "/wiki/Alara_Kalama", 
            "name": "Alara"
        }, 
        {
            "def": "Alambasa (अलम्‍बस): A Rakshasa friend of Duryodhana who had joined his forces but Satyaki compelled him to flee from the battlefield.", 
            "link": "/w/index.php?title=Alambasa&action=edit&redlink=1", 
            "name": "Alambasa"
        }, 
        {
            "def": "Amarāvati (अमरावती): The city of Indra", 
            "link": "/wiki/Amravati", 
            "name": "Amarāvati"
        }, 
        {
            "def": "Amarkantak (अमरकंटक): Amarkantak is a unique natural heritage area in eastern Madhya Pradesh, India. This is the meeting point of the Vindhyas and the Satpuras, with the Maikal Hills being the fulcrum. This is the place from where the Narmada River, the Sone River and Johila River emerge.", 
            "link": "/wiki/Amarkantak", 
            "name": "Amarkantak"
        }, 
        {
            "def": "Ambā (अम्‍बा), Ambikā (अम्‍बिका), Ambālikā (अम्‍बालिका): The three daughters of King of Benares, Eldest daughter Ambā was in love with King Shālwa", 
            "link": "/wiki/Amba_(fictional_character)", 
            "name": "AmbāAmbikāAmbālikā"
        }, 
        {
            "def": "Amrit (अमृत): Ambrosia, the food of the gods, which makes the partaker immortal.", 
            "link": "/wiki/Amrit", 
            "name": "Amrit"
        }, 
        {
            "def": "Ananta (अनन्‍त): Ananta may be 1.The thousand headed nāga that issued from Balrāma's mouth 2. Author and commentator of Katyayana sutra 3. Ananta was the name of present Shekhawati region of Rajasthan in India.", 
            "link": null, 
            "name": "Ananta"
        }, 
        {
            "def": "Andhaka (अंधक): Andhaka was the demon son of Shiva, and was created from a drop of his sweat. He was born blind. After birth, Andhaka was given to Hiranyaksha to be raised, as he had no sons. Later, Andhaka became the king of Hiranyaksha's kingdom.", 
            "link": "/wiki/Andhaka", 
            "name": "Andhaka"
        }, 
        {
            "def": "Anga (अंग): Mlechchha kings, a Kaurava supporter.", 
            "link": "/wiki/Anga", 
            "name": "Anga"
        }, 
        {
            "def": "Angada (अंगद): One of the monkey host; Son of Valī", 
            "link": "/wiki/Angada", 
            "name": "Angada"
        }, 
        {
            "def": "Aniruddha (अनिरुद्ध): Son of Pradyumna (a rebirth of Shatrughana who married with Chārumati and Ushā", 
            "link": "/wiki/Aniruddha", 
            "name": "Aniruddha"
        }, 
        {
            "def": "Anjalikā (अंजलिका): The greatest of Arjuna's arrows with which he slays Karna", 
            "link": "/wiki/Anjalika", 
            "name": "Anjalikā"
        }, 
        {
            "def": "Anjanā (अंजना): Mother of Hanumāna", 
            "link": "/wiki/A%C3%B1jan%C4%81", 
            "name": "Anjanā"
        }, 
        {
            "def": "Anshumat (अंशुमत): A mighty chariot-fighter", 
            "link": "/w/index.php?title=Anshumat&action=edit&redlink=1", 
            "name": "Anshumat"
        }, 
        {
            "def": "Anusuya (अनुसूया): Sati Anusuya was wife of the sage Atri and mother of Dattatreya (दत्तात्रेय) who is considered by some Hindus (in western India) to be an incarnation of the Divine Trinity Brahma, Vishnu and Siva.", 
            "link": "/wiki/Anusuya", 
            "name": "Anusuya"
        }, 
        {
            "def": "Apsarās (अपसरा): Heavenly nymphs, The dancing girls of Indra's court", 
            "link": "/wiki/Apsaras", 
            "name": "Apsarās"
        }, 
        {
            "def": "Aquila (अक्‍विला): Equivalent, Garuda; the divine eagle", 
            "link": "/wiki/Garuda", 
            "name": "Aquila"
        }, 
        {
            "def": "Araṇi (अरणि): An upper and a lower piece of wood used for producing fire by attrition.", 
            "link": null, 
            "name": "Araṇi"
        }, 
        {
            "def": "Āraṇyaka (आरण्यक): Part of the Hindu Śruti that discuss philosophy, sacrifice and the New Year holiday.", 
            "link": "/wiki/Aranyaka", 
            "name": "Āraṇyaka"
        }, 
        {
            "def": "Arjuna (अर्जुन): The third of Pāndavas and Krishna's cousin. His doubts on the battle field led to Krishna expounding the Gita.[1]", 
            "link": null, 
            "name": "Arjuna"
        }, 
        {
            "def": "Artha (अर्थ): Wealth, one of the objects of human life, the others being Dharma, (righteous- ness), Kama (satisfaction of desires), Moksha (spiritual salvation).", 
            "link": "/wiki/Artha", 
            "name": "Artha"
        }, 
        {
            "def": "Arundhati (अरुंधति): Wife of sage Vashishta. She was one of the nine daughters of Kardama Prajapati and his wife Devahuti.", 
            "link": "/wiki/Arundhati_(mythology)", 
            "name": "Arundhati"
        }, 
        {
            "def": "Arya: 'Noble or Pious.' Was also used as another name for ancient vedic bharatas tribe, whose main rival tribe were the Dasas.", 
            "link": "/wiki/Arya", 
            "name": "Arya"
        }, 
        {
            "def": "Asamanja (असमंज): Son of Sāgra", 
            "link": "/wiki/Asamanja", 
            "name": "Asamanja"
        }, 
        {
            "def": "Ashtavakra (अष्‍टवक्र): A towering scholar while still in his teens.", 
            "link": "/wiki/Ashtavakra", 
            "name": "Ashtavakra"
        }, 
        {
            "def": "Ashta Lakshmi: Eight aspects of goddess Lakshmi, symbolising eight sources of wealth", 
            "link": "/wiki/Ashta_Lakshmi", 
            "name": "Ashta Lakshmi"
        }, 
        {
            "def": "Ashvatthāman (अश्‍वत्‍थामां): Son of Dronacharya and last supreme commander of the Kaurava force, strong as a horse", 
            "link": "/wiki/Ashwatthama", 
            "name": "Ashvatthāman"
        }, 
        {
            "def": "Ashvins (अश्‍विन): The divine twins", 
            "link": "/wiki/Ashvins", 
            "name": "Ashvins"
        }, 
        {
            "def": "Ashwamedha (अश्‍वमेध): The horse sacrifice", 
            "link": "/wiki/Ashwamedha", 
            "name": "Ashwamedha"
        }, 
        {
            "def": "Asvamedha Yajna (अश्‍वमेध यज्ञ): A horse sacrifice.", 
            "link": "/wiki/Ashwamedha", 
            "name": "Asvamedha Yajna"
        }, 
        {
            "def": "Ashwapati (अश्‍वपति): Uncle of Bharata and Shatrughna", 
            "link": "/wiki/Ashwapati", 
            "name": "Ashwapati"
        }, 
        {
            "def": "Ashwasena (अश्‍वसेन): Son of Naga Takshaka, who was saved by Indra, while Khandavavana was put into flame by Pandavas. Five mighty arrows shot by Karna", 
            "link": "/w/index.php?title=Ashwasena&action=edit&redlink=1", 
            "name": "Ashwasena"
        }, 
        {
            "def": "Asita (असित): A sage who held that gambling was ruinous and should be avoided by all wise people.", 
            "link": "/wiki/Asita", 
            "name": "Asita"
        }, 
        {
            "def": "Asmaka (अस्मक): A Kaurava warrior who attacked Abhimanyu.", 
            "link": "/w/index.php?title=Asmaka&action=edit&redlink=1", 
            "name": "Asmaka"
        }, 
        {
            "def": "Astra (अस्त्र): A missile charged with power by a holy incantation.", 
            "link": "/wiki/Astra_(mythology)", 
            "name": "Astra"
        }, 
        {
            "def": "Asuras: mythological lord beings in Indian texts who compete for power.", 
            "link": "/wiki/Asura", 
            "name": "Asuras"
        }, 
        {
            "def": "Ātma (आत्‍मा): The underlying metaphysical self, sometimes translated as spirit or soul.", 
            "link": "/wiki/Atman_(Hinduism)", 
            "name": "Ātma"
        }, 
        {
            "def": "Ayodhyā (अयोध्या): Unconquuerable, The city in the country of Koshala", 
            "link": "/wiki/Ayodhya", 
            "name": "Ayodhyā"
        }, 
        {
            "def": "Binod:The Father of intillegent son Birat", 
            "link": "/wiki/Binod", 
            "name": "Binod"
        }, 
        {
            "def": "Birat:The intillegent son of Binod Timsina and Ganga Timsina", 
            "link": "/wiki/Birat", 
            "name": "Birat"
        }, 
        {
            "def": "Babhruvahana: Babhruvahana was son of Arjuna by his wife Chitrāngadā.", 
            "link": "/wiki/Babhruvahana", 
            "name": "Babhruvahana"
        }, 
        {
            "def": "Badarikasram (बद्रीकाश्रम): Badarikasram is a place sacred to Vishnu, near the Ganges in the Himalayas, particularly in Vishnu's dual form of Nara-Narayana.", 
            "link": "/wiki/Badarikasram", 
            "name": "Badarikasram"
        }, 
        {
            "def": "Bahlika (बाह्लिक), Dasharna (दशर्ण): States the kings of which were Kalinga, Magadha, friendly to the Pandavas, Matsya, Panchala, Salva.", 
            "link": "/wiki/Bahlika", 
            "name": "BahlikaDasharna"
        }, 
        {
            "def": "Bahu (बाहु): A king of the Solar race. who was vanquished and driven out of his country by the tribes of Haihayas and TaIajanghas. He was father of Sagara.", 
            "link": "/wiki/Bahu", 
            "name": "Bahu"
        }, 
        {
            "def": "Bahuka (बाहुक): The changed name of Nala, as a charioteer of Rituparna, the king of Ayodhya. Also other name of king Bahu.", 
            "link": "/wiki/Bahuka", 
            "name": "Bahuka"
        }, 
        {
            "def": "Baladeva (बलदेव): Balarama, elder brother of Sri Krishna.", 
            "link": "/wiki/Baladeva", 
            "name": "Baladeva"
        }, 
        {
            "def": "Balarāma (बलराम): Elder brother of Lord Krishna and manifestation of Sheshanaga.[1]", 
            "link": "/wiki/Balarama", 
            "name": "Balarāma"
        }, 
        {
            "def": "Bali: a demon king defeated by the god Vishnu.", 
            "link": "/wiki/Mahabali", 
            "name": "Bali"
        }, 
        {
            "def": "Bakāsura (बकासुर): A voracious, cruel and terribly strong Rakshasa or demon who lived in a cave near the city of Ekachakrapura whom Bhima killed to the great relief of the citizens.", 
            "link": "/wiki/Bakasura", 
            "name": "Bakāsura"
        }, 
        {
            "def": "Baṇāsura (बाणासुर): Banasura was a thousand-armed asura and son of Bali. He was a powerful and terrible asura. All people even the king of earth and Devas of heaven were afraid of him. Banasura was a follower of Siva. He had a beautiful daughter named Usha.", 
            "link": "/wiki/Banasura", 
            "name": "Baṇāsura"
        }, 
        {
            "def": "Behula (बेहुला):The daughter of Saha, a merchant of Nichhani Nagar; weds Lakshmindara, mentioned in the story of Manasa Devi who was the daughter of Shiva.", 
            "link": "/wiki/Behula", 
            "name": "Behula"
        }, 
        {
            "def": "Bhadra (भद्र): A mighty elephant", 
            "link": "/wiki/Bhadra", 
            "name": "Bhadra"
        }, 
        {
            "def": "Bhadrakālī (भद्रकाली): Bhadrakālī is also known as the gentle Kali, who came into being by Devi's wrath, when Daksha insulted Shiva. She is the consort of Virabhadra.", 
            "link": "/wiki/Bhadrakali", 
            "name": "Bhadrakālī"
        }, 
        {
            "def": "Bhagadatta (भगदत्‍त): King of Pragjyotisha, a Kaurava ally.", 
            "link": "/wiki/Bhagadatta", 
            "name": "Bhagadatta"
        }, 
        {
            "def": "Bhagawān (भगवान): Form of address to Gods and great rishis, example-Bhagawan Sri Krishna, Narada, Vyasa. A Sanskrit word meaning \"Holy or Blessed one\". It is a title of veneration, often translated as \"Lord\" and refers to God.", 
            "link": "/wiki/Bhagawan", 
            "name": "Bhagawān"
        }, 
        {
            "def": "Bhagavad Gītā (भगवद् गीता ): The national gospel contained in Mahābhārata, Part of the epic poem Mahabharata, located in the Bhishma–Parva chapters 23–40. A core sacred text of Hinduism and philosophy.", 
            "link": "/wiki/Bhagavad_Gita", 
            "name": "Bhagavad Gītā"
        }, 
        {
            "def": "Bhagavatī (भगवती): Alias Pārvatī, Shiva's wife", 
            "link": "/wiki/Bhagavati", 
            "name": "Bhagavatī"
        }, 
        {
            "def": "Bhagīratha (भगीरथ): Son of Dilipa, king of Kosala who worshipped Shiva and brought down Ganges.", 
            "link": "/wiki/Bhagiratha", 
            "name": "Bhagīratha"
        }, 
        {
            "def": "Bhajan (भजन): A Hindu devotional song. Great importance is attributed to the singing of bhajans within the Bhakti movement.", 
            "link": "/wiki/Bhajan", 
            "name": "Bhajan"
        }, 
        {
            "def": "Bhaktī (भक्ति): A Sanskrit term that means intense devotion expressed by action (service). A person who practices bhakti is called bhakta.", 
            "link": "/wiki/Bhakti", 
            "name": "Bhaktī"
        }, 
        {
            "def": "Bhaktī Yoga (भक्ति योग): The Hindu term for the spiritual practice of fostering of loving devotion to God, called bhakti.[2]", 
            "link": "/wiki/Bhakti_Yoga", 
            "name": "Bhaktī Yoga"
        }, 
        {
            "def": "Bharadwāja (भरद्वाज): A rishi, father of Yavakrida.", 
            "link": "/wiki/Bharadwaja", 
            "name": "Bharadwāja"
        }, 
        {
            "def": "Bharata (भरत): Means \"to be or being maintained\"). Bharat may be 1. a name of Agni 2. a name of Rudra 3. one of the Adityas 4. Emperor Bharata, son of Dushyanta and Shakuntalā 5. Bharata (Ramayana), a son of Dasharatha, younger brother of Rama 6. Bharata Muni, the author of the Natyashastra 7. Bharata (Bhagavata), the eldest of a hundred sons of a saintly king by name Rishabha Deva according to the Bhagavata purana.", 
            "link": null, 
            "name": "Bharata"
        }, 
        {
            "def": "Bhārata (भारत): Meaning (\"descended from Bharata\"). Bhārata may refer to 1. The Bhāratas, an Aryan tribe of the Rigveda 2. an early epic forming the core of the Mahabharata (allegedly comprising about a quarter of the extended epic) 3. the Republic of India (properly, Bhārata GaNarājya, भारत गणराज्य).", 
            "link": null, 
            "name": "Bhārata"
        }, 
        {
            "def": "Bhārgava (भार्वग): Karna's divine weapon", 
            "link": "/wiki/Bhargava", 
            "name": "Bhārgava"
        }, 
        {
            "def": "Bhaumāsur (भौमासुर): A demon slain by Krishna", 
            "link": "/w/index.php?title=Bhaumasur&action=edit&redlink=1", 
            "name": "Bhaumāsur"
        }, 
        {
            "def": "Bhīma (भीम): The second of Pāndavas who excelled in physical prowess as he was born of the wind-god.", 
            "link": "/wiki/Bhima", 
            "name": "Bhīma"
        }, 
        {
            "def": "Bhīshma (भीष्‍म): Bhīshma was son of Shāntanu, the great Knight and guardian of the imperial house of Kurus.", 
            "link": "/wiki/Bhishma", 
            "name": "Bhīshma"
        }, 
        {
            "def": "Bhīshmak (भीष्‍मक): Raja of Kundalpur and father of Rukminī.", 
            "link": "/wiki/Bhishmak", 
            "name": "Bhīshmak"
        }, 
        {
            "def": "Bhoja s (भोज): A branch of the Yadava clan belonging to Krishna's tribe.", 
            "link": "/wiki/Bhoja", 
            "name": "Bhoja"
        }, 
        {
            "def": "Bhumanyu : Nameo of Son of Bharatha. He became emperor of India after Bharat.", 
            "link": "/wiki/Bhumanyu", 
            "name": "Bhumanyu"
        }, 
        {
            "def": "Bhuminjaya (भुमिंजय): Another name of prince Uttara son of Virata who had proceeded to fight the Kaurava armies, with Brihannala as his charioteer.", 
            "link": "/wiki/Bhuminjaya", 
            "name": "Bhuminjaya"
        }, 
        {
            "def": "Bhuriśravas (भुरिश्र्वस): Bhurisravas was a prince of the Balhikas and an ally of the Kauravas, who was killed in the great battle of the Mahabharata.", 
            "link": "/w/index.php?title=Bhurisrvas&action=edit&redlink=1", 
            "name": "Bhuriśravas"
        }, 
        {
            "def": "Bhūta: A ghost, imp, goblin. Malignant spirits which haunt cemeteries, lurk in trees, animate dead bodies, and delude and devour human beings.", 
            "link": "/wiki/Bhoot_(ghost)", 
            "name": "Bhūta"
        }, 
        {
            "def": "Bibhatsu (बिभत्‍सु): One of Arjuna's name meaning a hater of unworthy acts.", 
            "link": "/w/index.php?title=Bibhatsu&action=edit&redlink=1", 
            "name": "Bibhatsu"
        }, 
        {
            "def": "Brahmā (ब्रह्‍मा): Creator of the universe, The Hindu creator god, and one of the Trimurti, the others being Vishnu and Shiva. He must not be confused with the Supreme Cosmic Spirit of Hindu philosophy Brahman.", 
            "link": "/wiki/Brahma", 
            "name": "Brahmā"
        }, 
        {
            "def": "Brahmāstra (ब्रह्‍मास्‍त्र): A divine weapon, irresistible, one given by Lord Brahma himself.", 
            "link": "/wiki/Brahmastra", 
            "name": "Brahmāstra"
        }, 
        {
            "def": "Brahmachārin (ब्रह्‍मचारिन): A religious student, unmarried, who lives with his spiritual guide, devoted to study and service.", 
            "link": "/wiki/Brahmchari", 
            "name": "Brahmachārin"
        }, 
        {
            "def": "Brahmacharya (ब्रह्‍मचर्य): Celibacy, chastity; the stage of life of Vedic study in which chastity and service are essential, The word Brahmacharya symbolises a person who is leading a life in quest of Brahma, or in other words a Hindu student", 
            "link": "/wiki/Brahmacharya", 
            "name": "Brahmacharya"
        }, 
        {
            "def": "Brahmadatta (ब्रह्‍मदत्‍त): King of Benares", 
            "link": "/w/index.php?title=Brahmadatta&action=edit&redlink=1", 
            "name": "Brahmadatta"
        }, 
        {
            "def": "Brahman (ब्राह्‍मण): The signifying name given to the concept of the unchanging, infinite, immanent and transcendent reality that is the Divine Ground of all being.", 
            "link": "/wiki/Brahman", 
            "name": "Brahman"
        }, 
        {
            "def": "Brahmin (ब्राह्ममन): One of four fundamental colours in Hindu caste (Varna) consisting of scholars, priests and spiritual teachers.", 
            "link": "/wiki/Brahmin", 
            "name": "Brahmin"
        }, 
        {
            "def": "Braj (ब्रज): Braj (also known as Brij or Brajbhoomi) is a region in Uttar Pradesh of India, around Mathura-Vrindavan. It is considered to be the land of Krishna and is derived from the Sanskrit word vraja.", 
            "link": "/wiki/Braj", 
            "name": "Braj"
        }, 
        {
            "def": "Brihadaswa (बृहदास्‍व): A great sage who visited the Pandavas during their forest hermitage and reminded them of King Nala of Nishadha who also lost his kingdom in the game of dice and who deserted his wife Damayanti because of a curse but ultimately regained both.[3]", 
            "link": "/w/index.php?title=Brihadaswa&action=edit&redlink=1", 
            "name": "Brihadaswa"
        }, 
        {
            "def": "Brihadratha (बृहद्रथ): Commander of three regiments reigned over Magadha and attained celebrity as a great hero, married the twin daughters of the Raja of Kasi. His two wives ate each half of a mango given by sage Kausika and begot half a child each. A Rakshasi recovered the two portions from a dustbin wherein they were thrown and when they accidentally came together, they became a chubby baby, which she presented to the king, saying it was his child, which later became known as Jarasandha.", 
            "link": "/wiki/Brihadratha", 
            "name": "Brihadratha"
        }, 
        {
            "def": "Brihadyumna (बृहद्युम्‍न): A King, a disciple of sage Raibhya.", 
            "link": "/w/index.php?title=Brihadyumna&action=edit&redlink=1", 
            "name": "Brihadyumna"
        }, 
        {
            "def": "Brihannala (बृहन्नल): Name assumed by Arjuna while living at Virata's court in incognito. He taught arts to Uttarā, the princess of the kingdom of Virata.", 
            "link": "/wiki/Brihannala", 
            "name": "Brihannala"
        }, 
        {
            "def": "Brihaspati (बृहस्‍पति): Father of Kacha and priest of devas", 
            "link": "/wiki/Brihaspati", 
            "name": "Brihaspati"
        }, 
        {
            "def": "Brihatbala (बृहत्बल): A daring warrior who charged at Abhimanyu caught in the Kaurava army's net.", 
            "link": "/w/index.php?title=Brihatbala&action=edit&redlink=1", 
            "name": "Brihatbala"
        }, 
        {
            "def": "Brindavan (बृन्दावन): A town on the site of an ancient forest which is the region where Lord Krishna spent his childhood days. It lies in the Braj region.", 
            "link": "/wiki/Brindavan", 
            "name": "Brindavan"
        }, 
        {
            "def": "Caste (कास्‍ट): Portuguese word to describe in a western context the Hindu system of classification of peoples (jāti)", 
            "link": "/wiki/Caste", 
            "name": "Caste"
        }, 
        {
            "def": "Chakra (चक्र): An energy node in the human body. The seven main chakras are described as being aligned in an ascending column from the base of the spine to the top of the head. Each chakra is associated with a certain colour, multiple specific functions, an aspect of consciousness, a classical element, and other distinguishing characteristics.", 
            "link": "/wiki/Chakra", 
            "name": "Chakra"
        }, 
        {
            "def": "Chala (चल): A Kaurava warrior.", 
            "link": "/wiki/Chala", 
            "name": "Chala"
        }, 
        {
            "def": "Champā (चम्‍पा): A city on banks of the Ganges river where Karna found as a babe by Adhiratha and Rādhā", 
            "link": "/wiki/Champa", 
            "name": "Champā"
        }, 
        {
            "def": "Chāndāla (चांडाल): A person of a degraded caste, whose conduct was much below standard and whose cause pollution.", 
            "link": "/wiki/Chandala", 
            "name": "Chāndāla"
        }, 
        {
            "def": "Chandraketu (चंद्रकेतु): A devotee of Manasā", 
            "link": "/w/index.php?title=Chandraketu&action=edit&redlink=1", 
            "name": "Chandraketu"
        }, 
        {
            "def": "Channa (चन्न) : A royal servant and head charioteer of Prince Siddhartha, who was to become the Buddha.", 
            "link": "/wiki/Channa_(Buddhist)", 
            "name": "Channa"
        }, 
        {
            "def": "Chānd Sadāgar (चांद सदगर): A merchant-prince of Champaka Nagar. Manasā Devi woos the devotion of him", 
            "link": "/wiki/Chand_Sadagar", 
            "name": "Chānd Sadāgar"
        }, 
        {
            "def": "Charachitra (चरचित्र): A son of King Dhritarashtra who perished in the war.", 
            "link": "/w/index.php?title=Charachitra&action=edit&redlink=1", 
            "name": "Charachitra"
        }, 
        {
            "def": "Caraka Saṃhitā (चरक संहिता): An ancient Indian Ayurvedic text on internal medicine written by Caraka. It is believed to be the oldest of the three ancient treatises of Ayurveda.", 
            "link": "/wiki/Caraka_Samhita", 
            "name": "Caraka Saṃhitā"
        }, 
        {
            "def": "Chavadi: Place of public assembly of the village. It is the property of the entire community. In it all public business is transacted, and it serves also as the village club the headquarters of the village police and guest house for travellers.", 
            "link": "/w/index.php?title=Chavadi&action=edit&redlink=1", 
            "name": "Chavadi"
        }, 
        {
            "def": "Chedi (चेदि): A kingdodom of Shishupāla, old name of present Chanderi", 
            "link": "/wiki/Chedi_Kingdom", 
            "name": "Chedi"
        }, 
        {
            "def": "Chekitana (चेकितान): Chekitana was son of Dhrishtaketu, Raja of the Kekayas, and an ally of the Pandavas.", 
            "link": "/wiki/Chekitana", 
            "name": "Chekitana"
        }, 
        {
            "def": "Chitra (चित्र): A son of Dhritarashtra killed in the war.", 
            "link": "/wiki/Kauravas", 
            "name": "Chitra"
        }, 
        {
            "def": "Chitraksha (चित्राक्ष): One of the many sons of King Dhritarashtra who fell in the war", 
            "link": "/w/index.php?title=Chitraksha&action=edit&redlink=1", 
            "name": "Chitraksha"
        }, 
        {
            "def": "Chitrakūta (चित्रकूट): Chitrakūta was in mountain forests where Rama, Sita and Lakshmana spent eleven and half years of their exile; The hermitages of Vālmīki, Atri, Sati Anusuya, Dattatreya, Maharshi Markandeya, Sarbhanga, Sutikshna were here; and here the principal trinity of the Hindu pantheon, Brahma, Vishnu and Mahesh, took their incarnations.", 
            "link": "/wiki/Chitrakoot,_Madhya_Pradesh", 
            "name": "Chitrakūta"
        }, 
        {
            "def": "Chitralekha (चित्रलेखा): Chitralekha was a friend of Usha and daughter of minister of Banasura. She was a talented lady who helped Usha to identify the young man, Aniruddha, seen in the dream of Usha. Chitralekha through supernatural powers abducted Aniruddha from the palace of Krishna and brought him to Usha.", 
            "link": "/wiki/Chitralekha_(deity)", 
            "name": "Chitralekha"
        }, 
        {
            "def": "Chitrasena (चित्रसेन): King of the Gandharvas who prevented the Kauravas from putting up their camp near the pond where he himself had encamped.", 
            "link": "/wiki/Chitrasena_(Mahabharata)", 
            "name": "Chitrasena"
        }, 
        {
            "def": "Chitrayudha (चित्रयुद्‍ध): A Kaurava prince who laid down his life in the war.", 
            "link": "/w/index.php?title=Chitrayudha&action=edit&redlink=1", 
            "name": "Chitrayudha"
        }, 
        {
            "def": "Chitravarma (चित्रवर्मा): A brother of Duryodhana who was killed in the war", 
            "link": "/w/index.php?title=Chitravarma&action=edit&redlink=1", 
            "name": "Chitravarma"
        }, 
        {
            "def": "Chitrangada (चित्रांगद): Elder son of Santanu born of Matsyagandhi (Satyavati) who succeeded his father on the throne of Hastinapura.", 
            "link": "/wiki/Chitr%C4%81ngada", 
            "name": "Chitrangada"
        }, 
        {
            "def": "Chitrāngadā: Chitrāngadā was one of Arjuna's wives. Arjuna travelled the length and breadth of India during his term of exile. In ancient Manipur in the eastern Himalayas he met Chitrāngadā, the daughter of the king of Manipur and married her. Babhruvahana was soon born to the couple. Babruvahana would succeed his grandfather as king of Manipur.", 
            "link": "/wiki/Chitr%C4%81ngad%C4%81", 
            "name": "Chitrāngadā"
        }, 
        {
            "def": "Chyavana (च्‍यवन): A great rishi, husband of beautiful wife Sukanyā whom Ashvins beheld at her bath", 
            "link": "/wiki/Chyavana", 
            "name": "Chyavana"
        }, 
        {
            "def": "Dāruka (दारुक): Sri Krishna's charioteer.", 
            "link": "/w/index.php?title=D%C4%81ruka&action=edit&redlink=1", 
            "name": "Dāruka"
        }, 
        {
            "def": "Dadhichi: Dadhichi was a Vedic king, son of Atharvan, who turned a great Rishi. Dadhicha gave his bones to destroy Vritra, a brahmin, who became the head of the Asuras.", 
            "link": "/wiki/Dadhichi", 
            "name": "Dadhichi"
        }, 
        {
            "def": "Daityas (दैत्‍य): Daityas were the children of Diti and the sage Kashyapa. They were a race of giants who fought against the gods.", 
            "link": "/wiki/Daityas", 
            "name": "Daityas"
        }, 
        {
            "def": "Daksha (दक्ष): The skilled one, is an ancient creator god, one of the Prajapatis, the Rishis and the Adityas, and a son of Brahma.", 
            "link": "/wiki/Daksha", 
            "name": "Daksha"
        }, 
        {
            "def": "Dākshāyani (दाक्षायणी): Dākshāyani is the Goddess of marital felicity and longevity; she is worshipped particularly by ladies to seek the long life of their husbands. An aspect of Devi, Dākshāyani is the consort of Shiva. Other names for Dākshāyani include Gaurī, Umā, Satī, Aparnā, Lalithā, Sivakāmini.", 
            "link": "/wiki/Dakshayani", 
            "name": "Dākshāyani"
        }, 
        {
            "def": "Damayantī (दमयंती): She is the wife of Nala whose story is told in the Mahabharata.", 
            "link": "/wiki/Damayanti", 
            "name": "Damayantī"
        }, 
        {
            "def": "Dandaka (दंडक): A kingdom and a forest, had the same name, was a colonial state of Lanka under the reign of Ravana. Ravana's governor Khara ruled this province. It was the stronghold of all the Rakshasa tribes living in the Dandaka Forest.", 
            "link": "/wiki/Dandaka", 
            "name": "Dandaka"
        }, 
        {
            "def": "Dasharatha (दशरथ): King of Ayodhya and Rama's father.", 
            "link": "/wiki/Dasharatha", 
            "name": "Dasharatha"
        }, 
        {
            "def": "Dashaarna (दशार्ण): A country whose king attacked Bhagadatta's elephant in an effort to save Bhima.", 
            "link": "/w/index.php?title=Dashaarna&action=edit&redlink=1", 
            "name": "Dashaarna"
        }, 
        {
            "def": "Dasharna (दशार्ण): Dasharna was an ancient Indian kingdom in Malwa region near Mandsaur. The queen of Chedi kingdom and mother of Damayanti were daughters of king of Dasharna.", 
            "link": "/wiki/Dasharna", 
            "name": "Dasharna"
        }, 
        {
            "def": "Demons: A supernatural being that has generally been described as a malevolent spirit. A demon is frequently depicted as a force that may be conjured and insecurely controlled, they were constantly at war with devas.", 
            "link": "/wiki/Demons", 
            "name": "Demons"
        }, 
        {
            "def": "Devadatta (देवदत्‍त): Name of Arjuna's conch, also Buddha's cousin.", 
            "link": "/wiki/Devadatta", 
            "name": "Devadatta"
        }, 
        {
            "def": "Deva (देव): The Sanskrit word for god or deity. It can be interpreted as a demi-god, deity or any supernatural being of high excellence.", 
            "link": "/wiki/Deva_(Hinduism)", 
            "name": "Deva"
        }, 
        {
            "def": "Devarata (देवर‍त): Father of Yajnavalkya, the gods had given him a great bow and neither gods, nor gandharvas, nor asuras, nor rākshsa, nor men had might to string that.", 
            "link": "/w/index.php?title=Devarata&action=edit&redlink=1", 
            "name": "Devarata"
        }, 
        {
            "def": "Devakī (देवकी): Mother of Lord Krishna.", 
            "link": "/wiki/Devaki", 
            "name": "Devakī"
        }, 
        {
            "def": "Devala (देवल): A sage who condemned the game of dice as an evil form of gambling and declared it unfit as entertainment for good people, as it usually offered scope for deceit and dishonesty.", 
            "link": "/wiki/Devala", 
            "name": "Devala"
        }, 
        {
            "def": "Devavrata (देवव्रत): The eighth child of Santanu and Ganga who in time mastered the art yielding arms and learned the Vedas and Vedanta as also the sciences known to Sukra was crowned Yuvaraja (heir apparent), but later vowed to celibacy and was known as Bhishma.", 
            "link": "/wiki/Devavrata", 
            "name": "Devavrata"
        }, 
        {
            "def": "Devayanī (देवयानी): The beautiful daughter of Shukracharaya, preceptor of the demons, who fell in love with Kacha, son of Brihaspati, preceptor of the Devas.", 
            "link": "/wiki/Devayani", 
            "name": "Devayanī"
        }, 
        {
            "def": "Devendra (देवेन्‍द्र): King of the Gods.", 
            "link": "/wiki/Indra", 
            "name": "Devendra"
        }, 
        {
            "def": "Devī (देवी): The female version of a Deva, i.e. a female deity or goddess. Devi is considered to be the Supreme Goddess in Shaktism.", 
            "link": "/wiki/Devi", 
            "name": "Devī"
        }, 
        {
            "def": "Dhanvantari (धन्‍वंतरी): An avatar of the Hindu God Vishnu. Dhanvantari appears in the Vedas as the physician of the gods, and is the god of Ayurvedic medicine.", 
            "link": "/wiki/Dhanvantari", 
            "name": "Dhanvantari"
        }, 
        {
            "def": "Dharma (धर्म): Righteous course of conduct. Can mean law, rule or duty. Beings that live in harmony with Dharma proceed quicker towards moksha.", 
            "link": "/wiki/Dharma", 
            "name": "Dharma"
        }, 
        {
            "def": "Dharmagranthi (धर्मग्रंथी): Assumed named of Nakula at Virata's court.", 
            "link": "/w/index.php?title=Dharmagranthi&action=edit&redlink=1", 
            "name": "Dharmagranthi"
        }, 
        {
            "def": "Dharmananda (धर्मनन्‍द): The delighted of Dharma, a name of Yudhishthira, the son of Dharma or Yama.", 
            "link": "/w/index.php?title=Dharmananda&action=edit&redlink=1", 
            "name": "Dharmananda"
        }, 
        {
            "def": "Dharmavyadha (धर्मव्‍याध): He possessed the secret of good life and lived in the city of Mithila. He was a meat-seller.", 
            "link": "/w/index.php?title=Dharmavyadha&action=edit&redlink=1", 
            "name": "Dharmavyadha"
        }, 
        {
            "def": "Dhananjaya (धनन्‍जय): One of the names of Arjuna.", 
            "link": "/wiki/Dhananjaya", 
            "name": "Dhananjaya"
        }, 
        {
            "def": "Dhanusaksha (धनुसक्ष): A great sage whom Medhavi, son of sage Baladhi, once insulted. He took the form of a bull and butted at that mountain and broke it to pieces. Then Medhavi fell down dead.", 
            "link": "/w/index.php?title=Dhanusaksha&action=edit&redlink=1", 
            "name": "Dhanusaksha"
        }, 
        {
            "def": "Dhaumya (धौम्‍य): Preceptor of the Pandavas, who accompanied them during their exile to the Kurujangala forest, singing Sama hymns addressed to Yama, Lord of Death.", 
            "link": "/wiki/Dhaumya", 
            "name": "Dhaumya"
        }, 
        {
            "def": "Dhrishtadyumna (धृष्‍टद्‍युम्‍न): Supreme commander of the Pandava forces and twin brother of Draupadi.", 
            "link": "/wiki/Dhrishtadyumna", 
            "name": "Dhrishtadyumna"
        }, 
        {
            "def": "Dhrishtaketu (धृष्‍टकेतु): Dhrishtaketu may be 1. A son of Dhrishtadyumna. 2. A son of Sisupala, king of Chedi, and an ally of the Pandavas. 3. A king of the Kekayas, also an ally of the Pandavas. 4. Son of Satyadhriti. 5. Son of Nriga.", 
            "link": "/wiki/Dhrishtaketu", 
            "name": "Dhrishtaketu"
        }, 
        {
            "def": "Dhritarāshtra (धृतराष्‍ट्र): Elder son of Vichitravirya and Ambika, born blind, father of Duryodhana.", 
            "link": "/wiki/Dhritarashtra", 
            "name": "Dhritarāshtra"
        }, 
        {
            "def": "Dharmaputra (धर्मपुत्र): The son of Yama, epithet of Yudhishthira.", 
            "link": "/w/index.php?title=Dharmaputra&action=edit&redlink=1", 
            "name": "Dharmaputra"
        }, 
        {
            "def": "Dhartarashtras (धार्तराष्‍ट्र): Sons of Dhritarashtra", 
            "link": "/w/index.php?title=Dhartarashtras&action=edit&redlink=1", 
            "name": "Dhartarashtras"
        }, 
        {
            "def": "Dhruva (ध्रुव): Dhruva was the prince blessed to eternal existence and glory as the Pole Star (Dhruva Nakshatra in Sanskrit) by Lord Vishnu. The story of Dhruva's life is often told to children as an example for perseverance, devotion, steadfastness and fearlessness.", 
            "link": "/wiki/Dhruva", 
            "name": "Dhruva"
        }, 
        {
            "def": "Dhumrāksha (धुमराक्ष): The Grey-eye rākshasha appointed by Rāvana who was slain by Hanumāna.", 
            "link": "/w/index.php?title=Dhumraksha&action=edit&redlink=1", 
            "name": "Dhumrāksha"
        }, 
        {
            "def": "Dilipa (दिलीप): Son of Anshumat and father of Bhāgīratha.", 
            "link": "/wiki/Dilipa", 
            "name": "Dilipa"
        }, 
        {
            "def": "Dīpāvali (दीपावली, दिवाली): Lit. a row of lamps. A significant 5-day festival in Hinduism occurring between mid October and mid November. It is also popularly known as the Festival of Lights.", 
            "link": "/wiki/Dipavali", 
            "name": "Dīpāvali"
        }, 
        {
            "def": "Draupadī (द्रौपदी): Daughter of King Drupada, King of Panchala,who was born from fire. She was the sister of Dhrishyadyumna. She married all the five Pandavas though Arjuna had won her in the Swayamvara, because of the vow that they would share everything in common.", 
            "link": "/wiki/Draupadi", 
            "name": "Draupadī"
        }, 
        {
            "def": "Droṇa (द्रोण): A Brāhman discovered by Bhīshma, Son of a Brahmana named Bharadwāja; married a sister of Kripa and a son Aswathama was born to them; learnt military art from Parasurama, the maser. Later he became the instructor to the Kaurava and Pandava princes in the use of arms. He was slain by Dhrishtadyumna in Mahabharata war.", 
            "link": "/wiki/Drona", 
            "name": "Droṇa"
        }, 
        {
            "def": "Drupada (द्रुपद): King of Panchala, Drona's friend, father of Draupadi who became the wife of the Pandavas", 
            "link": "/wiki/Drupada", 
            "name": "Drupada"
        }, 
        {
            "def": "Duhsāsana (दुःशासन): brother of Duryodhana who dragged Draupadi into the assembly hall and attempted to strip her naked after she had been lost as a wager by Yudhishthira. He eventually gave up when Krishna came to Draupadi's aid. The pandava Bhima killed him at Kurukshetra and drank his blood in accordance with the vow he had taken.[1]", 
            "link": "/w/index.php?title=Duhsasana&action=edit&redlink=1", 
            "name": "Duhsāsana"
        }, 
        {
            "def": "Durdhara (दुर्धर): A son of Dhritarashtra killed by Bhima in the war.", 
            "link": "/wiki/Durdhara", 
            "name": "Durdhara"
        }, 
        {
            "def": "Durgā (दुर्गा): A form of Devi, the supreme goddess. She is depicted as a woman riding a lion with multiple hands carrying weapons and assuming mudras.", 
            "link": "/wiki/Durga", 
            "name": "Durgā"
        }, 
        {
            "def": "Durjaya (दुर्जय): A brother of Duryodhana who was sent to attack Bhima, to save Karna's life but lost his own.", 
            "link": "/wiki/Durjaya", 
            "name": "Durjaya"
        }, 
        {
            "def": "Durmarsha (दुर्मर्श): A son of Dhritarashtra killed by Bhima.", 
            "link": "/w/index.php?title=Durmarsha&action=edit&redlink=1", 
            "name": "Durmarsha"
        }, 
        {
            "def": "Durmata (दुर्मत): A son of Dhritarashtra who was killed by Bhima.", 
            "link": "/w/index.php?title=Durmata&action=edit&redlink=1", 
            "name": "Durmata"
        }, 
        {
            "def": "Durmukha (दुर्मुख): A chariot-borne warrior on the Kaurava side.", 
            "link": "/w/index.php?title=Durmukha&action=edit&redlink=1", 
            "name": "Durmukha"
        }, 
        {
            "def": "Durvāsa (दुर्वास): An ancient sage known for his anger who visited the Kauravas. Duryodhana asked him to visit his cousins, the Pandavas, hoping that they would incur his wrath.[1]", 
            "link": "/wiki/Durvasa", 
            "name": "Durvāsa"
        }, 
        {
            "def": "Durvishaha (दुर्विषह): A warrior fighting on the Kaurava side.", 
            "link": "/w/index.php?title=Durvishaha&action=edit&redlink=1", 
            "name": "Durvishaha"
        }, 
        {
            "def": "Duryodhana (दुर्योधन): The eldest son of the blind king Dhritarashtra by Queen Gandhari, the eldest of the one hundred Kaurava brothers, and the chief antagonist of the Pandavas.", 
            "link": "/wiki/Duryodhana", 
            "name": "Duryodhana"
        }, 
        {
            "def": "Dushkarma (दुष्‍कर्म): A warrior belonging to the Kaurava side.", 
            "link": "/w/index.php?title=Dushkarma&action=edit&redlink=1", 
            "name": "Dushkarma"
        }, 
        {
            "def": "Dushyanta (दुष्‍यंत): A valiant king of the Lunar, race, and descended from Puru. He was husband of Sakuntala, by whom he had a son, Bharata. The loves of Dushyanta and Sakuntala, her separation from him, and her restoration through the discovery of his token-ring in the belly of a fish, form the plot of Kalidasa's celebrated play Sakuntala.", 
            "link": "/wiki/Dushyanta", 
            "name": "Dushyanta"
        }, 
        {
            "def": "Dussaha (दुस्‍सह): A son of Dhritarashtra killed by Bhima.", 
            "link": "/w/index.php?title=Dussaha&action=edit&redlink=1", 
            "name": "Dussaha"
        }, 
        {
            "def": "Dvaita (द्वैत): A branch of Hindu philosophy, founded by Shri Madhvacharyathat advocates dualism and stresses a strict distinction between God and souls.", 
            "link": "/wiki/Dvaita", 
            "name": "Dvaita"
        }, 
        {
            "def": "Dvaitavana (द्वैतवन): Dvaita Forest or Dvaitavana was situated to the south of the Kamyaka Forest. It contained within it a lake called the Dwaita lake. It was on the south-western outskirts of Kurujangala, near the borders of the desert (northern extension of the Thar desert into Haryana) (3,176). It also lay on the banks of the Saraswati River (known there as the Bhogavati) (3-24,176).", 
            "link": "/wiki/Dvaitavana", 
            "name": "Dvaitavana"
        }, 
        {
            "def": "Dwaitayana (द्वैतायन): A forest where the Kaurava, cows were being bred and housed.", 
            "link": "/w/index.php?title=Dwaitayana&action=edit&redlink=1", 
            "name": "Dwaitayana"
        }, 
        {
            "def": "Dwārakā (द्वारका): Krishna renounced war in Mathura for the greater good and founded and settled in Dwārakā. Leaving the Vrishnis people in Dwaraka, Krishna returned to Mathura and killed Kamsa (his maternal uncle) and Kālayavans demon and made Ugrasen (his maternal grandfather) the king of Mathura.", 
            "link": "/wiki/Dv%C4%81rak%C4%81", 
            "name": "Dwārakā"
        }, 
        {
            "def": "Dyumatsena (द्‍युमतसेन): King of Shālwas and father of Satyavān.", 
            "link": "/w/index.php?title=Dyumatsena&action=edit&redlink=1", 
            "name": "Dyumatsena"
        }, 
        {
            "def": "Ekachakra (एकचक्र): It was a city where the Pandavas are said to have lived here with their mother, Kunti, when they were exiled to the forest and escaped from the burning of house of lac.", 
            "link": "/wiki/Ekachakra", 
            "name": "Ekachakra"
        }, 
        {
            "def": "Ekalavya (एकलव्‍य): He was a young prince of the Nishadha tribes, who achieves a skill level parallel to the great Arjuna, despite Drona's rejection of him. He was a member of low caste and he wished to study in the gurukulam of Dronacharya.", 
            "link": "/wiki/Ekalavya", 
            "name": "Ekalavya"
        }, 
        {
            "def": "Fire-God: Same as Agni.", 
            "link": "/wiki/Agni", 
            "name": "Fire-God"
        }, 
        {
            "def": "Flute: Lord Krishna had a flute (called a Bansuri in Indian languages) which he used to play in the woods and all the herd-girls of Braj used to go out on the voice of this flute.", 
            "link": "/wiki/Flute", 
            "name": "Flute"
        }, 
        {
            "def": "Gajasura (गजासुर): Gajasura (elephant demon) is the name used to refer to demon Nila when he took the form of an elephant and attacked Shiva. He was destroyed by Ganapati.", 
            "link": "/wiki/Gajasurasamhara", 
            "name": "Gajasura"
        }, 
        {
            "def": "Gaṇapati (गणपति): Lord of the territory, The fulfiller of desire, the god of merchants, Second son of Shiva and Pārvati. Amanuensis of Vyasa who agreed to write down without pause or hesitation the story of the Mahabharata dictated by Vyasa.", 
            "link": "/wiki/Ganapati", 
            "name": "Gaṇapati"
        }, 
        {
            "def": "Ganges (गंगा): A holy river in Northern India, believed to be a goddess by Hindus (see Ganges in Hinduism), Equivalent Ganges, The story of the birth of the Ganges was told to Rama and Laxmana by Vishvamitra.", 
            "link": "/wiki/Ganges", 
            "name": "Ganges"
        }, 
        {
            "def": "Gaṇesha (गणेश): The god of good fortune, commonly identified for his elephant head.", 
            "link": "/wiki/Ganesha", 
            "name": "Gaṇesha"
        }, 
        {
            "def": "Gaṇeśa Chaturṭhī (गणेश चतुर्थी): Ganesh Chaturthi is an occasion or a day on which Lord Ganesha, the son of Shiva and Parvati, makes his presence on earth for all his devotees. It is the birthday of Lord Ganesha. The festival is observed in the Hindu calendar month of Bhaadrapada, starting on the shukla chaturthi.", 
            "link": "/wiki/Ganesh_Chaturthi", 
            "name": "Gaṇeśa Chaturṭhī"
        }, 
        {
            "def": "Gāndhārī (गांधारी): Dhritarashtra's wife and queen mother of the Kauravas.", 
            "link": "/wiki/Gandhari_(character)", 
            "name": "Gāndhārī"
        }, 
        {
            "def": "Gandharva s (गंधर्व): A class of celestial beings regarded as specialists in music.", 
            "link": "/wiki/Gandharva", 
            "name": "Gandharva"
        }, 
        {
            "def": "Gāṇdīva (गाण्डीव): Arjuna's most potent bow.", 
            "link": "/wiki/Gandiva", 
            "name": "Gāṇdīva"
        }, 
        {
            "def": "Gangadwara (गंगद्वार): A place where sage Agastya and his wife performed penance.", 
            "link": "/w/index.php?title=Gangadwara&action=edit&redlink=1", 
            "name": "Gangadwara"
        }, 
        {
            "def": "Garuda (गरुड): It is a large mythical bird or bird-like creature that appears in both Hindu and Buddhist mythology.", 
            "link": "/wiki/Garuda", 
            "name": "Garuda"
        }, 
        {
            "def": "Gaurī (गौरी): Gaurī or Dākshāyani is the Goddess of marital felicity and longevity; she is worshipped particularly by ladies to seek the long life of their husbands. An aspect of Devi, Dākshāyani is the consort of Shiva.", 
            "link": "/w/index.php?title=Gaur%C4%AB&action=edit&redlink=1", 
            "name": "Gaurī"
        }, 
        {
            "def": "Gāyatrī (गायत्री): A revered mantra in Hinduism, found in the Yajur Veda.", 
            "link": "/wiki/Gayatri", 
            "name": "Gāyatrī"
        }, 
        {
            "def": "Ghatotkacha (घटोत्‍कच): Son of Bhima from demoness Hidimba.", 
            "link": "/wiki/Ghatotkacha", 
            "name": "Ghatotkacha"
        }, 
        {
            "def": "Girivraja (गिरिव्रज): A Wealthy city in Kekaya Kingdom also called Rajagriha.", 
            "link": "/w/index.php?title=Girivraja&action=edit&redlink=1", 
            "name": "Girivraja"
        }, 
        {
            "def": "Gītā (गीता): See Bhagwad Gita", 
            "link": "/wiki/Gita", 
            "name": "Gītā"
        }, 
        {
            "def": "Gopa s (गोप): Equivalent, herd-boys", 
            "link": "/wiki/Gopa", 
            "name": "Gopa"
        }, 
        {
            "def": "Gopāla (गोपाल): Name of Krishna indicating his origin as a god of flocks and herds.", 
            "link": "/wiki/Krishna", 
            "name": "Gopāla"
        }, 
        {
            "def": "Gopīs (गोपी): Gopi is a word of Sanskrit origin meaning 'cow-herd girls'.", 
            "link": "/wiki/Gopi", 
            "name": "Gopīs"
        }, 
        {
            "def": "Govardhan (गोवर्धन): Govardhan is a hill located near the town of Vrindavan in India.", 
            "link": "/wiki/Govardhan", 
            "name": "Govardhan"
        }, 
        {
            "def": "Govinda (गोविन्‍द): One of the epithets of Sri Krishna and Vishnu; it means a cow-keeper and refers to Krishna's occupation in Gokula, the colony of cowherds", 
            "link": "/wiki/Govinda", 
            "name": "Govinda"
        }, 
        {
            "def": "Grihastha (गृहस्‍थ): The second of the four phases(Purushartha) of a man, when a person gets married and settles down in life and begets children.", 
            "link": "/wiki/Grihastha", 
            "name": "Grihastha"
        }, 
        {
            "def": "Guha (गुह): King of Nishādha", 
            "link": "/wiki/Guha", 
            "name": "Guha"
        }, 
        {
            "def": "Guru (गुरु): Revered preceptor, A spiritual teacher. In contemporary India, the title and term \"Guru\" is widely used within the general meaning of \"wise man\".", 
            "link": "/wiki/Guru", 
            "name": "Guru"
        }, 
        {
            "def": "Guru Pūrṇimā (गुरु पूर्णिमा): The day of full moon, Purnima, in the month of Ashadh of the Hindu calendar is traditionally celebrated by Hindus as Guru Pūrṇimā. On this day, devotees offer puja (worship) to their Guru.", 
            "link": "/wiki/Guru_Purnima", 
            "name": "Guru Pūrṇimā"
        }, 
        {
            "def": "Hamsa (हंस), Hidimbā (हिडिम्‍बा), Kamsa (कंस): Allies of King Jarasandha; the last married the two daughters of Jarasandha. Also Krishna's step-uncle whom Krishna killed.", 
            "link": "/wiki/Hamsa", 
            "name": "Hamsa"
        }, 
        {
            "def": "Halayudha (हलयुद्ध): Plough-weaponed, an epithet of Balarama who wielded a plough as his weapon.", 
            "link": "/wiki/Halayudha", 
            "name": "Halayudha"
        }, 
        {
            "def": "Hanumāna (हनुमान): Wise and learned monkey devotee of Sri Rama, who possessed extraordinary powers of discrimination and wisdom and who searched and found Sita in her confinement in Lanka. Son of Vayu and Anjana.", 
            "link": "/wiki/Hanuman", 
            "name": "Hanumāna"
        }, 
        {
            "def": "Hari (हरि): Hari is another name of Vishnu or God in Vaishnavism, Smarta or Advaitan Hinduism, and appears as the 650th name in the Vishnu sahasranama.", 
            "link": "/wiki/Hari", 
            "name": "Hari"
        }, 
        {
            "def": "Harivamsa (हरिवंश): Harivamsa is an important work of Sanskrit literature. It is a kind of appendix to the Mahābhārata, that runs to 16,375 verses and focuses specifically on the life of Lord Krishna.", 
            "link": "/wiki/Harivamsa", 
            "name": "Harivamsa"
        }, 
        {
            "def": "Hastināpura (हस्‍तिनापुर): Hastinapura is the capital and the kingdom of the Kauravas, the descendants of Kuru, which include the Pandavas. The throne of this city is the prize over which the great war of the epic is fought.", 
            "link": "/wiki/Hastinapura", 
            "name": "Hastināpura"
        }, 
        {
            "def": "Hidimbā (हिडिम्‍बा): A powerful Asura, who had yellow eyes and a horrible aspect. He was a cannibal, and dwelt in the forest to which the Pandavas retired after the burning of their house. He had a sister named Hidimbi, whom he sent to lure the Pandavas to him; but on meeting with Bhima, she fell in love with him. By his mother's desire Bhima married her, and by her had a son named Ghatotkacha.", 
            "link": "/wiki/Hidimba", 
            "name": "Hidimbā"
        }, 
        {
            "def": "Hindu scripture: Sacred texts of Hinduism mostly written in Sanskrit. Hindu scripture is divided into two categories: Śruti – that which is heard (i.e. revelation) and Smriti – that which is remembered (i.e. tradition, not revelation).", 
            "link": "/wiki/Hindu_scripture", 
            "name": "Hindu scripture"
        }, 
        {
            "def": "Hinduism: A worldwide religious tradition that is based on the Vedas and is the direct descendent of the Vedic religion. It encompasses many religious traditions that widely vary in practice, as well as many diverse sects and philosophies.", 
            "link": "/wiki/Hinduism", 
            "name": "Hinduism"
        }, 
        {
            "def": "Hiranyakashipu (हिरण्‍यकश्यप): Hiranyakashipu was an Asura, and also a King of Dravida whose younger brother, Hiranyaksha was killed by Varaha, one of the avatars of Vishnu. Identical with Shishupāla and Rāvana.", 
            "link": "/wiki/Hiranyakashipu", 
            "name": "Hiranyakashipu"
        }, 
        {
            "def": "Hiranyaksha (हिरण्‍याक्ष): Hiranyaksha was an Asura of the Daitya race, and a King of Dravida who was killed by Lord Vishnu after he took the Earth to the bottom of the ocean. He had an older brother named Hiranyakashipu.", 
            "link": "/wiki/Hiranyaksha", 
            "name": "Hiranyaksha"
        }, 
        {
            "def": "Holikā (होलिका): Holika was a demoness who was killed on the day of Holi. She was the sister of King Hiranyakashipu. The story of Holika's conflict signifies the triumph of good over evil.", 
            "link": "/wiki/Holika", 
            "name": "Holikā"
        }, 
        {
            "def": "Hrishikesha (हृषीकेश): Krishna.", 
            "link": "/wiki/Krishna", 
            "name": "Hrishikesha"
        }, 
        {
            "def": "Ikshvaku (इक्ष्वाकु): The word Ikshvaku means \"bitter gourd\". Ikshvaku was the first king and founder of the Sun Dynasty in Vedic civilization in ancient India. He was the son of Manu (the first man on earth), sired by the Sun God, Surya. Rama, of the epic Ramayana is a descendant of the house of Ikshvaku. So are Bhagiratha, Dasharatha, Luv and Kusa.", 
            "link": "/wiki/Ikshvaku_(Hinduism)", 
            "name": "Ikshvaku"
        }, 
        {
            "def": "Ilvala (ईवल): Ilvala and Vatapi were asuras, the rulers of Badami, formerly known as Vatapi, was named after asura king Vatapi.", 
            "link": "/wiki/Ilvala", 
            "name": "Ilvala"
        }, 
        {
            "def": "Indra (इन्‍द्र): King of the Gods. The chief deity of the Rigveda, the god of weather and war as well as Lord of Svargaloka in Hinduism.", 
            "link": "/wiki/Indra", 
            "name": "Indra"
        }, 
        {
            "def": "Indrajīt (इन्‍द्र जीत): Son of Ravana, King of Lanka, also known as Meghanath, who conquered Indra, the Lord of Gods and received his name 'Indra-jit' (Victor of Indra), and who was killed by Rama's brother Lakshmana.", 
            "link": "/wiki/Indrajit", 
            "name": "Indrajīt"
        }, 
        {
            "def": "Indraprastha (इन्‍द्रप्रस्‍थ): Indraprastha (City of Indra) was a major northern city in ancient India that was the capital of the kingdom led by the Pandavas in the Mahabharata epic, located upon the banks of the river Yamuna, believed to be the site of present Purana Qila, in the modern national capital of Delhi.", 
            "link": "/wiki/Indraprastha", 
            "name": "Indraprastha"
        }, 
        {
            "def": "Indrasena (इन्‍द्रसेन): A kinsman of the Pandavas, son of Nala and Damayanti.", 
            "link": "/w/index.php?title=Indrasena&action=edit&redlink=1", 
            "name": "Indrasena"
        }, 
        {
            "def": "Indrasenā (इन्‍द्रसेना): Daughter of Nala and Damayanti.", 
            "link": "/w/index.php?title=Indrasena&action=edit&redlink=1", 
            "name": "Indrasenā"
        }, 
        {
            "def": "Indrakila (इन्‍द्रकिला): A mountain Arjuna passed on his way to the Himalayas to practise austerities to acquire powerful new weapons from Lord Mahadeva.", 
            "link": "/w/index.php?title=Indrakila&action=edit&redlink=1", 
            "name": "Indrakila"
        }, 
        {
            "def": "Iravan (इरवन): Arjuna's son by a Naga princess Ulupi who fell in the battle on the eighth day, fought on the side of the Pandavas, killed by the Rakshasa Alumvusha.", 
            "link": "/wiki/Iravan", 
            "name": "Iravan"
        }, 
        {
            "def": "Ishvara (ईश्व‍र): A Hindu philosophical concept of God referring to the Supreme Being which is the lord and the ruler of everything. Hinduism uses the term Ishvara exclusively to refer to the Supreme God in a monotheistic sense.", 
            "link": "/wiki/Ishvara", 
            "name": "Ishvara"
        }, 
        {
            "def": "Jāmbavān (जाम्‍बवान): Jambavan or Jamvanta is a bear in Hinduism and believe to lived from Treta Yuga to kaliYuga.", 
            "link": "/wiki/Jambavan", 
            "name": "Jāmbavān"
        }, 
        {
            "def": "Jambudvīpa (जम्बुद्वीप): The name of the dvipa (\"continent\") of the terrestrial world, as envisioned in the cosmologies of Hinduism, Buddhism, and Jainism, which is the realm where ordinary human beings live. Its name is said to derive from a Jambu tree.", 
            "link": "/wiki/Jambudvipa", 
            "name": "Jambudvīpa"
        }, 
        {
            "def": "Jambumali (जम्बुमली):The warrior Ravana sends to slay Hanuman when Hanuman not satisfied with finding Sita dashed about the Ashoka grove and broke the trees and spoiled the pavilions.", 
            "link": "/w/index.php?title=Jambumali&action=edit&redlink=1", 
            "name": "Jambumali"
        }, 
        {
            "def": "Janaka (जनक): King of Mithila, a great Rajarishi; father of Sita, wife of Rama.", 
            "link": "/wiki/Janaka", 
            "name": "Janaka"
        }, 
        {
            "def": "Janamejaya (जनमेजय): A king who conducted a great sacrifice for the well being of the human race.", 
            "link": "/wiki/Janamejaya", 
            "name": "Janamejaya"
        }, 
        {
            "def": "Janārdana (जनार्दन): A name of Krishna", 
            "link": "/wiki/Janardana", 
            "name": "Janārdana"
        }, 
        {
            "def": "Jarāsandha (जरासंध): A rākshasa father-in-law of Kamsa, Son of Brihadratha. Mighty king of Magadha of whose prowess all Kshatriyas were afraid. Killed by Bhima in a thirteen-day non-stop physical combat: with Sri Krishna and Arjuna as witnesses.", 
            "link": "/wiki/Jarasandha", 
            "name": "Jarāsandha"
        }, 
        {
            "def": "Jarita (जरित), Laputa (लपुत): Female companions of a saranga bird, who was a rishi named Mandapala in his previous birth when he was refused admission to heaven because he was childless.", 
            "link": "/wiki/Jarita", 
            "name": "JaritaLaputa"
        }, 
        {
            "def": "Jalāsura (जलासुर): A demon killed by Bhima.", 
            "link": "/w/index.php?title=Jalasura&action=edit&redlink=1", 
            "name": "Jalāsura"
        }, 
        {
            "def": "Japa (जप): A spiritual discipline in which a devotee repeats a mantra or the name of God. The repetition can be aloud, just the movement of lips or in the mind.", 
            "link": "/wiki/Japa", 
            "name": "Japa"
        }, 
        {
            "def": "Jātaka (जातक): The Jataka is a voluminous body of folklore and mythic literature, primarily associated with the Theravada Buddhist tradition, as written in the Pali language (from about the 3rd century, C.E.); The story of Rama is told in one of Jātakas.", 
            "link": "/wiki/Jataka", 
            "name": "Jātaka"
        }, 
        {
            "def": "Jatāsura (जटासुर): A Rakshasa who disguised himself as a Brahman and carried Yudhishthira, Sahadeva, Nakula, and Draupadi. He was overtaken and killed by Bhima.", 
            "link": "/wiki/Jat%C4%81sura", 
            "name": "Jatāsura"
        }, 
        {
            "def": "Jatāyū (जटायू): Jatāyū was king of all the eagles-tribes, the son of Aruna and nephew of Garuda. A demi-god who has the form of an (eagle), he tries to rescue Sita from Ravana, when Ravana is on his way to Lanka after kidnapping Sita. His brother was Sampatī", 
            "link": "/wiki/Jatayu_(Ramayana)", 
            "name": "Jatāyū"
        }, 
        {
            "def": "Jaya (जय): A son of King Dhritarashtra, who was killed by Bhima in the war", 
            "link": null, 
            "name": "Jaya"
        }, 
        {
            "def": "Jayadratha (जयद्रथ): A warrior on the side of Kauravas who closed the breach effected by Abhimanyu in the Chakravyuha military formation by Dronacharya and trapped him inside.", 
            "link": "/wiki/Jayadratha", 
            "name": "Jayadratha"
        }, 
        {
            "def": "Jayatsena (जयत्‍सेन): A kinsman of the Pandavas.", 
            "link": "/w/index.php?title=Jayatsena&action=edit&redlink=1", 
            "name": "Jayatsena"
        }, 
        {
            "def": "Jīwal (जीवल): The charioteer of Rituparna, king of Ayodhya, who accompanied with Bahuka.", 
            "link": "/w/index.php?title=Jiwal&action=edit&redlink=1", 
            "name": "Jīwal"
        }, 
        {
            "def": "Jnana (ज्ञान): Knowledge of the eternal and real", 
            "link": "/wiki/Jnana", 
            "name": "Jnana"
        }, 
        {
            "def": "Kacha (कच): Grandson of sage Angiras and son of Brihaspati, who went to seek knowledge under Sukracharya as a brahmacharin. Devayani, the preceptor's lovely daughter, fell in love with him. The Asuras (demons) suspecting him of wanting to steal the secret of reviving the dead, killed him a number of times. But due to Devayani's love for him, her father brought him back to life every time he was killed. Ultimately the secret was learnt by the devas who then succeeded in defeating the asuras.", 
            "link": "/wiki/Kacha_(sage)", 
            "name": "Kacha"
        }, 
        {
            "def": "Kagola (कगोल): A disciple of the great sage and teacher of Vedanta, Uddalaka. Although virtuous and energetic, he lacked the intelligence needed to master the Vedas. He was also the father of Ashtavakra, whose legendary crookedness was a result of his twisting in the womb whenever Kagola made a mistake in reciting the Vedas.[1]", 
            "link": "/w/index.php?title=Kagola&action=edit&redlink=1", 
            "name": "Kagola"
        }, 
        {
            "def": "Kaikeyī (कैकेयी): She was the youngest of King Dasharatha's three wives and a queen of Ayodhya. She was the mother of Bharata.", 
            "link": "/wiki/Kaikeyi", 
            "name": "Kaikeyī"
        }, 
        {
            "def": "Kailāsh (कैलास): It is a peak in the Gangdisê mountains, the source of rivers in Asia—the Indus River, the Sutlej River, and the Brahmaputra River—and is considered as a sacred place in four religions—Hinduism, Buddhism, Jainism and Bön faith. The mountain lies near Lake Manasarowar and Lake Rakshastal in Tibet.", 
            "link": "/wiki/Mount_Kailash", 
            "name": "Kailāsh"
        }, 
        {
            "def": "Kaitabh (कैतभ): Kaitabh is an asura associated with Hindu religious cosmology. He along with his companion, Madhu, originated from one of the ears of God Vishnu. Kaitabh and Madhu were designed to annihilate Brahma.", 
            "link": "/wiki/Kaitabh", 
            "name": "Kaitabh"
        }, 
        {
            "def": "Kālayāvan (कालयावन): Kālayāvan was an asura who surrounded Mathura with an army of thirty million monstrous friends. Then Krishna departed to build a city of Dwārkā amidst sea, transported all his people to this city and left them in Dwārkā. Then Krishna returned and slew Kālayāvan.", 
            "link": "/wiki/Kalayavan", 
            "name": "Kālayāvan"
        }, 
        {
            "def": "Kāl-Purush (काल-पुरुष): The time-man, Bengali name of Orion.", 
            "link": "/w/index.php?title=Kal-Purush&action=edit&redlink=1", 
            "name": "Kāl-Purush"
        }, 
        {
            "def": "Kali (कलि): Kali was a demon, the personified spirit of the Fourth yuga who possesses Nala.", 
            "link": "/wiki/Kali_(Demon)", 
            "name": "Kali"
        }, 
        {
            "def": "Kalī Yuga (कली युग): Kalī Yuga (lit. Age of Kali, also known as The Age of Darkness), is one of the four stages of development that the world goes through as part of the cycle of Yugas, as described in Hindu scriptures, the others being Dwapara Yuga, Treta Yuga, and Satya Yuga.", 
            "link": "/wiki/Kali_Yuga", 
            "name": "Kalī Yuga"
        }, 
        {
            "def": "Kālī (काली): A dark, black aspect of the mother-goddess Devi whose consort is Shiva.", 
            "link": "/wiki/Kali", 
            "name": "Kālī"
        }, 
        {
            "def": "Kālindī (कालिन्‍दी): Kālindī was daughter of the Surya (Sun) who marries Lord Krishna while he was ruling at Dwarka, Kālindī is also another name for the river Yamuna in northern India.", 
            "link": "/wiki/Kalindi", 
            "name": "Kālindī"
        }, 
        {
            "def": "Kāliyā (कालिया): Kāliyā was the name of a poisonous hydra or Nāga living on the bank of Yamuna River. Kāliyā was quelled by Krishna and sent to his abode in Ramanaka Dwīpa.", 
            "link": "/wiki/K%C4%81liy%C4%81", 
            "name": "Kāliyā"
        }, 
        {
            "def": "Kāl nāginī (काल नागिनी): A serpent who kills Lakshmindara, the son of Chand Sadagar who was a merchant-prince of Champaka Nagar.", 
            "link": "/w/index.php?title=Kal_nagini&action=edit&redlink=1", 
            "name": "Kāl nāginī"
        }, 
        {
            "def": "Kalki (कल्कि): The tenth Avatar of Vishnu who is yet to come and will appear as a man on a horse at the end of Kali Yug.", 
            "link": "/wiki/Kalki", 
            "name": "Kalki"
        }, 
        {
            "def": "Kāma (काम): Best understood as aesthetics, the definition of Kama involves sensual gratification, sexual fulfillment, pleasure of the senses, love, and the ordinary enjoyments of life regarded as one of the four ends of man (purusharthas).", 
            "link": "/wiki/Kama", 
            "name": "Kāma"
        }, 
        {
            "def": "Kāmadeva (कामदेव): Kāmadeva is the Hindu god of love. He is represented as a young and handsome winged man who wields a bow and arrows.", 
            "link": "/wiki/Kamadeva", 
            "name": "Kāmadeva"
        }, 
        {
            "def": "Kamboja s (कम्बोज): Enemies of the Kauravas whom Karna had defeated", 
            "link": "/wiki/Kambojas", 
            "name": "Kamboja"
        }, 
        {
            "def": "Kāmadhenu (कामधेनु): Kamadhenu was a divine cow believed to be the mother of all cows. Like her child Nandini, she could grant any wish for the true seeker. Kamadhenu provided Vasishta with his needs for the sacrifices. Kamadhenu (kama-dhenu, 'wish-cow'), was a miraculous cow of plenty who could give her owner whatever he desired.", 
            "link": "/wiki/Kamadhenu", 
            "name": "Kāmadhenu"
        }, 
        {
            "def": "Kampilya (कम्पिल्‍य): Capital of the Panchala Kingdom ruled by Drupada.", 
            "link": "/wiki/Kampilya", 
            "name": "Kampilya"
        }, 
        {
            "def": "Kamsa (कंस): Maternal Uncle of Sri Krishna and son of Ugrasena, also son-in-law of Jarasandha, whom Sri Krishna killed.", 
            "link": "/wiki/Kamsa", 
            "name": "Kamsa"
        }, 
        {
            "def": "Kamyaka Forest (काम्यक वन): Kamyaka forest is mentioned in Mahabharata being situated at the head of the Thar desert, near the lake Trinavindu was situated on the western boundary of the Kuru Kingdom, on the banks of the Saraswati River. It lay to the west of the Kurukshetra plain.", 
            "link": "/wiki/Kamyaka_Forest", 
            "name": "Kamyaka Forest"
        }, 
        {
            "def": "Kanika (कणिक): Minister of Sakuni.", 
            "link": "/wiki/Kanika_(name)", 
            "name": "Kanika"
        }, 
        {
            "def": "Kanka (कंक): Assumed name of Yudhishthira at Virata's court.", 
            "link": "/w/index.php?title=Kanka_(mythology)&action=edit&redlink=1", 
            "name": "Kanka"
        }, 
        {
            "def": "Kaṇva (कण्‍व): Father of Shakuntala.", 
            "link": "/wiki/Kanva", 
            "name": "Kaṇva"
        }, 
        {
            "def": "Kanyā pūjā (कन्या पूजा):A Hindu custom to worship virgin girls as a symbol of the pure basic creative force.", 
            "link": "/wiki/Kanya_Puja", 
            "name": "Kanyā pūjā"
        }, 
        {
            "def": "Kapila (कपिल ऋषि): A Vedic sage credited as one of the founders of the Samkhya school of philosophy. He is prominent in the Bhagavata Purana, which features a theistic version of his Samkhya philosophy.", 
            "link": "/wiki/Kapila", 
            "name": "Kapila"
        }, 
        {
            "def": "Karkotaka (कर्कोटक): The naga who bit Nala at the request of Indra, transforming Nala into a twisted and ugly shape.", 
            "link": "/wiki/Karkotaka", 
            "name": "Karkotaka"
        }, 
        {
            "def": "Kartavirya Arjuna (कार्तवीर्य अर्जुन): Kārtavīrya Arjuna was King of Mahishamati, kshatriya of Ramayana period believed to have a thousand arms. He had beheaded Jamadagni, father of Parashurama. In revenge, Parashurama killed the entire clan of Kartavirya Arjuna. Ravana was comprehensively defeated and was put to humiliation by him.", 
            "link": "/wiki/Kartavirya_Arjuna", 
            "name": "Kartavirya Arjuna"
        }, 
        {
            "def": "Karma (कर्म): A Sanskrit term that comprises the entire cycle of cause and effect.", 
            "link": "/wiki/Karma", 
            "name": "Karma"
        }, 
        {
            "def": "Karma Yoga (कर्म योग): The practise of disciplining action. Karma yoga focuses on the adherence to duty (dharma) while remaining detached from the reward. It states that one can attain Moksha (salvation) by doing his duties in an unselfish manner.[2]", 
            "link": "/wiki/Karma_Yoga", 
            "name": "Karma Yoga"
        }, 
        {
            "def": "Karṇa (कर्ण): A matchless warrior, son of the Sun god and Kunti. Disciple of Parasurama. Also son of Radha, his foster-mother, and was known as Radheya.", 
            "link": "/wiki/Karna", 
            "name": "Karṇa"
        }, 
        {
            "def": "Kārtavīrya (कार्तवीर्य): A great warrior who defeated Ravana, King of Lanka.", 
            "link": "/wiki/Kartavirya", 
            "name": "Kārtavīrya"
        }, 
        {
            "def": "Kārtikeya (कार्तिकेय): Commander of the armies of the devas, A god born out of a magical spark created by Shiva, his father. His brother is Ganesha.", 
            "link": "/wiki/Kartikeya", 
            "name": "Kārtikeya"
        }, 
        {
            "def": "Kashyapa (कश्‍यप): An ancient sage, father of the Devas, Asuras, Nagas and all of humanity. He is married to Aditi, with whom he is the father of Agni and the Savitrs. His second wife, Diti, begot the Daityas. Diti and Aditi were daughters of King Daksha and sisters to Sati, Shiva's consort. One of Dashratha's counsellors also.", 
            "link": "/wiki/Kashyapa", 
            "name": "Kashyapa"
        }, 
        {
            "def": "Kauravas (कौरव): Kaurava is a Sanskrit term, that means a descendant of Kuru, alternate name of sons of Dhritarashtra.", 
            "link": "/wiki/Kauravas", 
            "name": "Kauravas"
        }, 
        {
            "def": "Kausalyā (कौसल्‍या): She was the eldest of King Dasharatha's three wives and a queen of Ayodhya. She was the mother of Rama.", 
            "link": "/wiki/Kausalya", 
            "name": "Kausalyā"
        }, 
        {
            "def": "Kausikam (कौसिकम्): A sage who learnt from Dharmavyadha the secret of Dharma, of performing one's duty.", 
            "link": "/w/index.php?title=Kausikam&action=edit&redlink=1", 
            "name": "Kausikam"
        }, 
        {
            "def": "Kaustubha (कौस्तुभ:): is a divine jewel - the most valuable stone \"Mani\", which is in the possession of lord Vishnu.", 
            "link": "/wiki/Kaustubha", 
            "name": "Kaustubha"
        }, 
        {
            "def": "Kekaya (केक‍य): A brave warrior on the Pandava side into whose chariot Bhima got during the fighting on the sixth day. Usinaras, the Sibi, the Madras, and the Kekayas were the direct descendants of Yayati's son Anu.", 
            "link": "/wiki/Kekaya", 
            "name": "Kekaya"
        }, 
        {
            "def": "Kesava (केसव): One of the names of Sri Krishna.", 
            "link": "/wiki/Kesava", 
            "name": "Kesava"
        }, 
        {
            "def": "Keshinī (केशिनी): Wife of Sāgara", 
            "link": "/w/index.php?title=Keshini&action=edit&redlink=1", 
            "name": "Keshinī"
        }, 
        {
            "def": "Ketama (केतम): Another chief whose head was cut off by Drona.", 
            "link": "/wiki/Ketama", 
            "name": "Ketama"
        }, 
        {
            "def": "Ketu (केतु): Ketu is generally referred to as a \"shadow\" planet. It has a tremendous impact on human lives and also the whole creation. Astronomically, Ketu and Rahu denote the points of intersection of the paths of the Sun and the Moon as they move on the celestial sphere.", 
            "link": "/wiki/Ketu_(mythology)", 
            "name": "Ketu"
        }, 
        {
            "def": "Khaṇdavaprastha (खाण्डवप्रस्‍थ): The ancient capital from where the ancestors of Pandavas, Nahusha and Yayati ruled. The Pandavas rebuilt the ruined city and erected palaces and forts and renamed it Indraprastha.", 
            "link": "/wiki/Khandavaprastha", 
            "name": "Khaṇdavaprastha"
        }, 
        {
            "def": "Khandava Vana (खांडववन):Khandava Vana was an ancient forest mentioned in the epic Mahabharata, inhabited by Naga tribes. It lay to the west of Yamuna river, in modern-day Delhi territory. Pandavas cleared this forest to construct their capital city called Indraprastha.", 
            "link": "/wiki/Khandava_Vana", 
            "name": "Khandava Vana"
        }, 
        {
            "def": "Khara (खर): Khara was younger brother of Rāvana who was slain by Rama.", 
            "link": "/wiki/Khara_(Ramayana)", 
            "name": "Khara"
        }, 
        {
            "def": "Kichak a (किचक): Sudeshna's brother, commander-in-chief of Virata's army, who made advances to Sairandhri (Draupadi). He was invited to meet her at night at the ladies dancing hall and was met instead by Valala (Bhima) dressed up as a female who killed him (Kichaka).", 
            "link": "/wiki/Kichak", 
            "name": "Kichak"
        }, 
        {
            "def": "Khir (खिर): The grand son of Krishana.", 
            "link": "/w/index.php?title=Khir_(Hinduism)&action=edit&redlink=1", 
            "name": "Khir"
        }, 
        {
            "def": "Kinnars (किन्‍नर): Human birds with instruments of music under their wings.", 
            "link": "/w/index.php?title=Kinnars&action=edit&redlink=1", 
            "name": "Kinnars"
        }, 
        {
            "def": "Kirāta (किरात): Huntsman, The non-Aryan aborigines of the land. They are mentioned along with Cinas for Chinese. Kiratas are believed to be of Tibeto-Burman origin.", 
            "link": "/wiki/Kirata", 
            "name": "Kirāta"
        }, 
        {
            "def": "Kirmira (किर्मीर): Kirmira was a Rakshasa, the brother of Bakasura, who lived in the Kamyaka Forest, and used to terrorize the Rishis who inhabited that forest. He ran into the Pandavas when they began their exile in the Kamyaka forest. Upon learning that Bheema was present, who had slain his brother Bakasura, the Rakshasa then challenged the Pandava to fight. After a fierce battle, Bhishma choked Kirmira to death.", 
            "link": "/wiki/Kirmira", 
            "name": "Kirmira"
        }, 
        {
            "def": "Kishkindhā (किष्किन्‍धा): Kishkindhā was the kingdom ruled by a Vanara King Sugreeva, the younger brother of Bali, during the Ramayana period. This was the kingdom where he ruled with the assistance of his most intelligent minister, Hanuman.", 
            "link": "/wiki/Kishkindha", 
            "name": "Kishkindhā"
        }, 
        {
            "def": "Kosala (कोशल): Kosala was an ancient Indian Aryan kingdom, corresponding roughly in area with the region of Oudh. Its capital was Ayodhya, where Rama was born.", 
            "link": "/wiki/Kosala", 
            "name": "Kosala"
        }, 
        {
            "def": "Kripa (कृपा): The concept of Divine Grace in Hinduism, especially in Bhakti Yoga.", 
            "link": "/wiki/Kripa_(philosophy)", 
            "name": "Kripa"
        }, 
        {
            "def": "Kripāchārya (कृपाचार्य): Aswathama's uncle who advocated a combined assault on Arjuna in battle as against Karna's boast that he could take him on single-handed.", 
            "link": "/wiki/Kripacharya", 
            "name": "Kripāchārya"
        }, 
        {
            "def": "Krishṇa (कृष्‍ण): The eighth avatar of Vishnu, one of the most worshipped by many Hindus. Krishna is famous for his lecture to Arjuna written in the Bhagavad Gita.", 
            "link": "/wiki/Krishna", 
            "name": "Krishṇa"
        }, 
        {
            "def": "Krishna-Dwaipāyana (कृष्‍ण द्वैपायन): Another name of Sage Vyasa.", 
            "link": "/wiki/Krishna_Dwaipayana_Vyasa", 
            "name": "Krishna-Dwaipāyana"
        }, 
        {
            "def": "Krishna Janmashtami (कृष्ण जन्माष्टमी): A Hindu festival celebrating the birth of Lord Krishna, an avatar of Hindu deity Vishnu.", 
            "link": "/wiki/Krishna_Janmashtami", 
            "name": "Krishna Janmashtami"
        }, 
        {
            "def": "Krauncha (क्रौंच): Curlew-heron.", 
            "link": "/w/index.php?title=Krauncha&action=edit&redlink=1", 
            "name": "Krauncha"
        }, 
        {
            "def": "Krauncha-Vyuha (क्रौंच व्‍युह): military formation on a pattern supposed to resemble a heron with outstretched beak and spreading wings. In ancient Indian practice, armies were arrayed for battle in formations of definite patterns, each of which had a name such as Chakra, or Kurma or Krauncha, or Makara according to a real or fancied resemblance.", 
            "link": "/w/index.php?title=Krauncha-Vyuha&action=edit&redlink=1", 
            "name": "Krauncha-Vyuha"
        }, 
        {
            "def": "Kritavarma (कृतवर्म): A notable Yadava warrior fighting on the side of Kaurava forces.", 
            "link": "/wiki/Kritavarma", 
            "name": "Kritavarma"
        }, 
        {
            "def": "Kshatriya (क्षत्रिय): One of the four fundamental colours (Varnas) in Hindu tradition, consisting of the warriors, soldiers and rulers of society.", 
            "link": "/wiki/Kshatriya", 
            "name": "Kshatriya"
        }, 
        {
            "def": "Kshatradharma (क्षात्रधर्म): This is a form of spiritual practice that involves \"Protection of the seekers and destruction of the evildoers\". In other words, it is the duty of fighting against evil as told by lord Krishna to Arjuna in the Bhagavad Gita.", 
            "link": "/w/index.php?title=Kshatradharma&action=edit&redlink=1", 
            "name": "Kshatradharma"
        }, 
        {
            "def": "Kubera (कुबेर): One of the gods of wealth and riches.", 
            "link": "/wiki/Kubera", 
            "name": "Kubera"
        }, 
        {
            "def": "Kuchasthala (कुचस्‍थल): A city where Krishna stayed the night on his way to the court of Dhritarashtra.", 
            "link": "/w/index.php?title=Kuchasthala&action=edit&redlink=1", 
            "name": "Kuchasthala"
        }, 
        {
            "def": "Kumāra (कुमार): Son of Shiva and Parvati who conquered and slew the demon Taraka.", 
            "link": "/wiki/Murugan", 
            "name": "Kumāra"
        }, 
        {
            "def": "Kumbha (कुम्भ): Kumbha was a rakshasa who led a host against the monkeys when Hanumana fetches healing herb.", 
            "link": "/wiki/Kumbha", 
            "name": "Kumbha"
        }, 
        {
            "def": "Kumbhakarna (कुम्भकर्ण): Brother of Ravana, King of Lanka, who was asleep most of the time because of the curse of Brahma.", 
            "link": "/wiki/Kumbhakarna", 
            "name": "Kumbhakarna"
        }, 
        {
            "def": "Kundalpur (कुण्‍डलपुर): Capital of Raja Bhismak who was father of Rukmini, the wife of Krishna.", 
            "link": "/wiki/Kundalpur", 
            "name": "Kundalpur"
        }, 
        {
            "def": "Kundinapura (कुण्‍डिनपुर): Capital of Vidarbha.", 
            "link": "/w/index.php?title=Kundinapura&action=edit&redlink=1", 
            "name": "Kundinapura"
        }, 
        {
            "def": "Kuntī (कुंती): Mother of Pandavas, Daughter of Sura also known as Pritha. She was given in adoption to the king's childless cousin Kuntibhoja and was named Kunti after her adoptive father.", 
            "link": "/wiki/Kunti", 
            "name": "Kuntī"
        }, 
        {
            "def": "Kunti-Madri (कुंती-माद्री): Queens of King Pandu who gave birth to three and two sons known as the Pandavas in the forest where he spent many years for having committed some sin. The sons were known as Yudhishthira, Bhima, Arjuna, Nakula, and Sahadeva.", 
            "link": "/wiki/Madri", 
            "name": "Kunti-Madri"
        }, 
        {
            "def": "Kurma (कुर्म): Tortoise, The second Avatar of Vishnu where he took the form of a tortoise.", 
            "link": "/wiki/Kurma", 
            "name": "Kurma"
        }, 
        {
            "def": "Kurujangala (कुरुजाङ्गल): An ancient kingdom of India, in the north near the Yamuna and Ganges rivers. The main cities of the region are Hastinapura and Indraprastha. Its kings are sometimes called the Kurus. On a modern map of India, this kingdom roughly forms most of the Haryana state. Indraprastha (now known as Delhi the capital of India) was its capital.", 
            "link": "/w/index.php?title=Kurujangala&action=edit&redlink=1", 
            "name": "Kurujangala"
        }, 
        {
            "def": "Kurukshetra (कुरुक्षेत्र): Plain of, scene of great battle between the Pandavas and Kurus for the throne of Hastinapura resulted in a battle in which a number of ancient kingdoms participated as allies of the rival clans. The location of the battle was Kurukshetra in the modern state of Haryana in India.", 
            "link": "/wiki/Kurukshetra", 
            "name": "Kurukshetra"
        }, 
        {
            "def": "Kurus (कुरु): The name of an Indo-Aryan tribe and their kingdom in the Vedic civilization of India. Their kingdom was located in the area of modern Haryana. Bhisma was their guardian.", 
            "link": "/wiki/Kuru_Kingdom", 
            "name": "Kurus"
        }, 
        {
            "def": "Kusha (कुश): Kusha and his twin brother Lava are the children of the Hindu God Rama and his wifeSita, whose story is told in the Ramayana", 
            "link": "/wiki/Kusha_(Ramayana)", 
            "name": "Kusha"
        }, 
        {
            "def": "Kusasthala (कुसस्थल): one of the provinces asked by Pandavas,", 
            "link": "/w/index.php?title=Kusasthala&action=edit&redlink=1", 
            "name": "Kusasthala"
        }, 
        {
            "def": "Lakshagrah (लाक्षागृह): The house of lac, The palace made out of lac at Benares where Pandavas along with Kunti were kept with a sense of banishment.The house was made with flammable materials which Purochana was to ignite at the opportune moment with the Pandavas entrapped inside. However, Vidura had seen through Duryodhana's plan and sent a miner to tunnel a shaft which the Pandavas used to escape.[1]", 
            "link": "/w/index.php?title=Lakshagrah&action=edit&redlink=1", 
            "name": "Lakshagrah"
        }, 
        {
            "def": "Lakshmaṇa (लक्ष्मण): Younger stepbrother of Rama and son of Sumitra and King Dasharatha. Duryodhana's gallant young son also bore this name.", 
            "link": "/wiki/Lakshmana", 
            "name": "Lakshmaṇa"
        }, 
        {
            "def": "Lakshmī (लक्ष्मी): Goddess of prosperity, wealth and good fortune. She is the consort of Vishnu and an aspect of Devi.", 
            "link": "/wiki/Lakshmi", 
            "name": "Lakshmī"
        }, 
        {
            "def": "Lakshmīndara (लक्ष्मीन्‍दर): Son of Chand Sadagar who weds Behula. He was slain by Kal-nagini but restored to life by Mansa.", 
            "link": "/wiki/Lakshmindara", 
            "name": "Lakshmīndara"
        }, 
        {
            "def": "Lankā (लंका): An island city, generally identified with Ceylon, the home of Ravana.", 
            "link": "/wiki/Lanka", 
            "name": "Lankā"
        }, 
        {
            "def": "Lava (लव): Kusa and Lava were sons of Rama and Sita.", 
            "link": "/wiki/Lava", 
            "name": "Lava"
        }, 
        {
            "def": "Lomasa (लोमस): A brahmana sage who advised the Pandavas to reduce their retinue while repairing to the forest. Those unable to bear the hardships of exile were free to go to the court of Dhritarashtra or Drupada, king of Panchala. He accompanied Yudhishthira on his wanderings.", 
            "link": "/w/index.php?title=Lomasa&action=edit&redlink=1", 
            "name": "Lomasa"
        }, 
        {
            "def": "Lopamudra (लोपमुद्रा): Daughter of the king of Vidarbha who married the sage Agastya.", 
            "link": "/wiki/Lopamudra", 
            "name": "Lopamudra"
        }, 
        {
            "def": "Lord Narayana (नारायण): Refuge of men; Mahavishnu.", 
            "link": "/wiki/Lord_Narayana", 
            "name": "Lord Narayana"
        }, 
        {
            "def": "Mādhava (माधव): One of the names of Krishna. It means the Lord of Lakshmi.", 
            "link": "/wiki/Krishna", 
            "name": "Mādhava"
        }, 
        {
            "def": "Madhu (मधु): The name of Kingdom of Shtrughna.", 
            "link": "/wiki/Madhu", 
            "name": "Madhu"
        }, 
        {
            "def": "Madhusudana (मधुसुदन): Another name of Krishna, the slayer of the asura Madhu.", 
            "link": "/wiki/Madhusudana", 
            "name": "Madhusudana"
        }, 
        {
            "def": "Mahābhārata (महाभारत): One of the two major ancient Sanskrit epics of India, the other being the Ramayana. The Mahabharata is of religious and philosophical importance in India; in particular, the Bhagavad Gita, which is one of its chapters (Bhishmaparva) and a sacred text of Hinduism.", 
            "link": "/wiki/Mahabharata", 
            "name": "Mahābhārata"
        }, 
        {
            "def": "Mahādeva (महादेव): Another name of Shiva.", 
            "link": null, 
            "name": "Mahādeva"
        }, 
        {
            "def": "Mahāpārshwa (महापार्शव): One of Ravana's generals.", 
            "link": "/w/index.php?title=Mahaparshwa&action=edit&redlink=1", 
            "name": "Mahāpārshwa"
        }, 
        {
            "def": "Mahārāksha (महाराक्ष): Son of Khara slain at Lanka.", 
            "link": "/w/index.php?title=Maharaksha&action=edit&redlink=1", 
            "name": "Mahārāksha"
        }, 
        {
            "def": "Mahāvishnu (महाविष्‍णु): Lord of the Universe who took human birth in order to wrest his kingdom from Emperor Bali for the salvation of the world. Lord Vishnu also took birth as Rama, son of Dasharatha, to kill Ravana, King of Lanka.", 
            "link": "/wiki/Mahavishnu", 
            "name": "Mahāvishnu"
        }, 
        {
            "def": "Mahendra (महेन्‍द्र): A King who had attained heaven. Also the name of a mountain upon which Hanumana rushes while searchin Sita, shaking it in wrath and frightening every beast that lived in its woods and caves.", 
            "link": "/wiki/Mahendra", 
            "name": "Mahendra"
        }, 
        {
            "def": "Mainaka (मैनक): Another mountain, well wooded and full of fruits and roots, Hanumana coursed through the air while searchin Sita.", 
            "link": "/w/index.php?title=Mainaka&action=edit&redlink=1", 
            "name": "Mainaka"
        }, 
        {
            "def": "Maitreya (मैत्रेय): A sage who visited the court of Dhritarashtra, expressed sorrow at the Pandava's plight, advised Duryodhana not to injure the Pandavas for his own good.", 
            "link": "/wiki/Maitreya", 
            "name": "Maitreya"
        }, 
        {
            "def": "Makandi : One of the provinces asked by Pandavas, A province running along the banks of the Ganges, to the south of Hastinapura. Kampilya the capital city of Panchala was situated in the Makandi province within the southern Panchala kingdom (1,140).", 
            "link": "/w/index.php?title=Makandi&action=edit&redlink=1", 
            "name": "Makandi"
        }, 
        {
            "def": "Makara Sankaranti (मकर संक्रान्ति): A huge Religious festival regarding Sun. Lit. Makara means Capricorn and Sankranti is transition. It is about transition of Sun into Capricorn on its celestial path.", 
            "link": "/wiki/Makara_Sankaranti", 
            "name": "Makara Sankaranti"
        }, 
        {
            "def": "Mālinī (मालिनी): Malini was the name of river that was flowing in the forest where the ashrama of Kanva rishi was situated and Dushyanta fell in love with Shakuntala.", 
            "link": "/w/index.php?title=M%C4%81lin%C4%AB&action=edit&redlink=1", 
            "name": "Mālinī"
        }, 
        {
            "def": "Manasā Devī (मन्‍सादेवी): Manasa Devi the goddess of snakes; the daughter of Shiva by a beautiful mortal woman. She was no favourite of her step mother, Bhagavati, or Parvati, Shiva's wife.", 
            "link": "/wiki/Manasa", 
            "name": "Manasā Devī"
        }, 
        {
            "def": "Manasaputra (मानसपुत्र): Literally \"sons of mind\". Wise men, created from the brain of Brahma. They are listed as Atri, Bharadwaja, Gotama, Jamadagni, Kashyapa, Vashishtha and Vishwamitra. Some sources add more names to this list.", 
            "link": "/w/index.php?title=Manasaputra&action=edit&redlink=1", 
            "name": "Manasaputra"
        }, 
        {
            "def": "Mānasarovar (मानसरोवर): A sacred lake in the Himalayas", 
            "link": "/wiki/Manasarovar", 
            "name": "Mānasarovar"
        }, 
        {
            "def": "Mandara (मंदर): The mountain used as a churning stick in Samudra manthan for churning the ocean using Vasuki nāga as rope by gods on one side and asuras on other side.", 
            "link": "/wiki/Mount_Mandara", 
            "name": "Mandara"
        }, 
        {
            "def": "Mandavya (मंदव्‍य): A sage wrongly punished by the king by being impaled as the chief of robbers who had clandestinely hidden their stolen goods in a corner of his hermitage when he was in deep contemplation. Lord Dharma gave him this punishment for having tortured birds and bees in his childhood. At this Mandavya cursed Dharma who was born as Vidura, the wise, to the servant maid of Ambalika, wife of King Vichitravirya, who offered her to Sage Vyasa in place of Ambalika.", 
            "link": "/wiki/Mandavya", 
            "name": "Mandavya"
        }, 
        {
            "def": "Mandhatri: Mandhatri was a king, son of Yuvanaswa, of the race of Ikshvaku, and author of a hymn in the Rigveda.", 
            "link": "/wiki/Mandhatri", 
            "name": "Mandhatri"
        }, 
        {
            "def": "Mandodarī (मंदोदरी): Mandodari was the daughter of the King of Danavas, Mayasura and celestial dancer, Hema. She was the first wife of the Lord of Lanka Ravana.", 
            "link": "/wiki/Mandodari", 
            "name": "Mandodarī"
        }, 
        {
            "def": "Manipura: 'City of jewels' in Sanskrit. Manipura is the third primary chakra according to Hindu tradition. It is positioned at the navel region and it has ten petals which match the vrittis of spiritual ignorance, thirst, jealousy, treachery, shame, fear, disgust, delusion, foolishness and sadness.", 
            "link": "/wiki/Manipura", 
            "name": "Manipura"
        }, 
        {
            "def": "Mantharā (मंथरा): Mantharā was a servant who convinced Kaikeyi that the throne of Ayodhya belonged to her son Bharata and that Rama should be exiled from the kingdom.", 
            "link": "/wiki/Manthara", 
            "name": "Mantharā"
        }, 
        {
            "def": "Mantra (मंत्र): An incantation with words of power. A religious syllable or poem, typically from the Sanskrit language. They are primarily used as spiritual conduits, words and vibrations that instill one-pointed concentration in the devotee. Other purposes have included religious ceremonies to accumulate wealth, avoid danger, or eliminate enemies. Mantras are performed through chanting.", 
            "link": "/wiki/Mantra", 
            "name": "Mantra"
        }, 
        {
            "def": "Manu Smriti (मनुस्मृति): The Manusmriti translated Laws of Manu is regarded as an important work of Hindu law and ancient Indian society. Manu was the forefather of all humans and author of Manu Smriti. Certain historians believe it to have been written down around 200 C.E. under the reign of Pushymitra Shunga of Sangha clan.", 
            "link": "/wiki/Manu_Smriti", 
            "name": "Manu Smriti"
        }, 
        {
            "def": "Mārīcha (मारीच): A character in the Ramayana, uncle of Ravana who transformed himself into a golden deer at the behest of Ravana to entice Sita.", 
            "link": "/wiki/Maricha", 
            "name": "Mārīcha"
        }, 
        {
            "def": "Mārkandeya (मार्कण्‍डेय): A sage who told Yudhishthira the story of a brahmana, Kausika.", 
            "link": "/wiki/Markandeya", 
            "name": "Mārkandeya"
        }, 
        {
            "def": "Marutta (मरुत्त): A king of the Ikshwaku dynasty whose sacrifice was performed by Samvarta in defiance of Indra and Brihaspati.", 
            "link": "/w/index.php?title=Marutta&action=edit&redlink=1", 
            "name": "Marutta"
        }, 
        {
            "def": "Mātalī (मातली): Charioteer of Indra who took Arjuna to the kingdom of gods.", 
            "link": "/w/index.php?title=M%C4%81tal%C4%AB&action=edit&redlink=1", 
            "name": "Mātalī"
        }, 
        {
            "def": "Matanga (मतंग): A rishi during Ramayana period, Rama and Laxman pass by while searching Sita on way to mountain Rishyamūk on which dwelt Sugriva.", 
            "link": null, 
            "name": "Matanga"
        }, 
        {
            "def": "Mathurā (मथुरा): The capital of Yadavas which was invaded by Kams", 
            "link": "/wiki/Mathura,_Uttar_Pradesh", 
            "name": "Mathurā"
        }, 
        {
            "def": "Matrikas: A group of mother goddesses.", 
            "link": "/wiki/Matrikas", 
            "name": "Matrikas"
        }, 
        {
            "def": "Matsya (मत्‍स्‍य): The first Avatar of Vishnu, where he came in the form of a fish", 
            "link": "/wiki/Matsya", 
            "name": "Matsya"
        }, 
        {
            "def": "Māyā (मा‍या): Maya is the limited, purely physical and mental reality in which our everyday consciousness has become entangled. Maya is believed to be an illusion, a veiling of the true, unitary Self—the Cosmic Spirit also known as Brahman. Maya originated in the Hindu scriptures known as the Upanishads.", 
            "link": "/wiki/Maya_(illusion)", 
            "name": "Māyā"
        }, 
        {
            "def": "Mayasura (मयासुर): Maya (मय), or Mayasura was a great ancient king of the Asura, Daitya and Rakshasa races upon earth. He was also the chief architect of the peoples of the netherworlds.", 
            "link": "/wiki/Mayasura", 
            "name": "Mayasura"
        }, 
        {
            "def": "Medhavi (मेधवी): Son of Sage Baladhi who desired that his son should live as long as a certain mountain lasted. Filled with conceit, Medhavi angered Dhanushaksha who killed him by taking on the form of a bull and butting the mountain until it was broken to pieces.[1]", 
            "link": "/w/index.php?title=Medhavi&action=edit&redlink=1", 
            "name": "Medhavi"
        }, 
        {
            "def": "Menakā (मेनका): Menakā is considered one of the most beautiful of the heavenly Apsaras. She was sent by Indra, the king of the Devas, to break the severe penance undertaken by Vishwamitra.", 
            "link": "/wiki/Menaka", 
            "name": "Menakā"
        }, 
        {
            "def": "Meru (मेरु): An ancient mountain and mythical centre of the universe on which was situated the city of Brahma. Becoming jealous of Meru, the Vindya began to grow very high obstructing the sun, the moon and the planets. Agastya whom the Vindhya mountain respected asked it to stop growing until he crossed it on his way to the south and returned to the north again. But he did not return at all, having settled in the south.", 
            "link": "/wiki/Mount_Meru", 
            "name": "Meru"
        }, 
        {
            "def": "Mithilā (मिथिला): Mithilā was a kingdom in ancient India. It existed in the eastern Gangetic plains in areas which is today spread over Uttar Pradesh and Bihar states of India, and parts of Nepal. Raja Janaka, father of Sita, was king of this kingdom.", 
            "link": "/wiki/Mithila_(ancient)", 
            "name": "Mithilā"
        }, 
        {
            "def": "Mitra (मित्र): One of the Adityas.", 
            "link": "/wiki/Mitra_(Vedic)", 
            "name": "Mitra"
        }, 
        {
            "def": "Moksha (मोक्ष): Refers to liberation from the cycle of death and rebirth. In higher Hindu philosophy, it is seen as a transcendence of phenomenal being, of any sense of consciousness of time, space, and causation (karma).", 
            "link": "/wiki/Moksha", 
            "name": "Moksha"
        }, 
        {
            "def": "Muchukunda (मुचुकुंद): Muchukunda was a great sage who kills Kalayavan, the great Yavana warrior king in the Indian epic Mahabharata.", 
            "link": "/wiki/Muchukunda", 
            "name": "Muchukunda"
        }, 
        {
            "def": "Mukāsura (मुकासुर): Mukāsura was a demon, friend of Kauravas, who was sent to disturb the austerities, Arjuna was performing at Mount Kailash. Mukāsura went to forest where Arjuna was practicing his vows of prayer, vigil, and fast and attacked Arjuna in the form of a boar to kill. At the same time Shiva came in the form of a huntsman and saved him. Shiva gave Arjuna the Gandiva, the divine bow, and blessed him.", 
            "link": "/wiki/Mukasura", 
            "name": "Mukāsura"
        }, 
        {
            "def": "Nachiketa (नचिकेता): Nachiketa was son of a cowherd of the name Vājashrava, who was offered to Yama to find a place in Heaven by his father. Nachiketatas with his wits learnt the wisdom taught by death, found the Brahman and was freed from death.", 
            "link": "/wiki/Nachiketa", 
            "name": "Nachiketa"
        }, 
        {
            "def": "Nāga (नाग): Nāga is the Sanskrit and Pāli word for a minor deity taking the form of a very large snake, found in Hindu and Buddhist mythology. The use of the term nāga is often ambiguous, as the word may also refer, in similar contexts, to one of several human tribes known as or nicknamed \"Nāgas\"; to elephants; and to ordinary snakes, particularly the King Cobra and the Indian Cobra, the latter of which is still called nāg (नाग) in Hindi and other languages of India.", 
            "link": "/wiki/N%C4%81ga", 
            "name": "Nāga"
        }, 
        {
            "def": "Nāgas (नाग): Nāgas were a group who spread throughout India during the period of the epic Mahabharata. The demi-god tribe called Suparnas (in which Garuda belonged) were arch-rivals of the Nagas. The well known Nagas are Ananta, Vasuki, Takshaka, Karkotaka and Airavata.", 
            "link": "/wiki/Naga_(clan)", 
            "name": "Nāgas"
        }, 
        {
            "def": "Nāga panchami (नाग पंचमी): The festival of Nāga panchami is celebrated in Hindus to pay respect to Nāgas. The five Nāgas worshipped on Nāga panchami are Ananta, Vāsuki, Taxak, Karkotaka and Pingala.", 
            "link": "/wiki/Nag_panchami", 
            "name": "Nāga panchami"
        }, 
        {
            "def": "Nagavanshi (नाग वंशी): Nagavanshi dynasty is one of the Kshatriya dynasties of India. It includes a number of Jats and Rajput clans. The worshippers of Nāga (serpent) were known as Nāgā or Nāgil. The descendants of Nagas were called Nagavanshi.", 
            "link": "/wiki/Nagavanshi", 
            "name": "Nagavanshi"
        }, 
        {
            "def": "Nahusha (नहुष): A mighty king who was made king of the gods because Indra had disappeared due to his killing Vritra through sin and deceit.", 
            "link": "/wiki/Nahusha", 
            "name": "Nahusha"
        }, 
        {
            "def": "Naimiṣāraṇya (नैमिषारण्य): Naimiṣāraṇya (Naimisha Forest) was an ancient forest mentioned in the epic Mahabharata. It lay on the banks of the Gomati River (in Uttar Pradesh). The whole narration of Mahabharata took place at Naimisha forests, during a conclave of sages headed by sage Saunaka.", 
            "link": "/wiki/Naimisharanya", 
            "name": "Naimiṣāraṇya"
        }, 
        {
            "def": "Naivedhya (नैवेध्य): Food or eatables prepared as offerings to God, prior to the oblation. (See also: Prasad)", 
            "link": "/wiki/Naivedhya", 
            "name": "Naivedhya"
        }, 
        {
            "def": "Nakula (नकुल): Fourth brother of the Pandavas.", 
            "link": "/wiki/Nakula", 
            "name": "Nakula"
        }, 
        {
            "def": "Nala (नल): King of Nishadha who lost his kingdom in a game of dice and deserted his wife Damayanti because of a curse.", 
            "link": "/wiki/Nala", 
            "name": "Nala"
        }, 
        {
            "def": "Nanda (नंद): Nanda is head of a tribe of cowherds referred as Holy Gwals and foster-father of Krishna, who was allegedly given to him by Vasudeva. Nanda was married to Yasoda. Krishna derives his name Nandalal (meaning son of Nanda) from him.", 
            "link": "/wiki/Nanda", 
            "name": "Nanda"
        }, 
        {
            "def": "Nandi (नंदि): Nandi is the white bull which Shiva rides, and the leader of the Ganas. The white color of the bull symbolizes purity and justice.", 
            "link": "/wiki/Nandi_bull", 
            "name": "Nandi"
        }, 
        {
            "def": "Nandinī (नन्‍दिनी): Vasishtha's divinely beautiful cow, child of Kamadhenu.", 
            "link": "/wiki/Nandini", 
            "name": "Nandinī"
        }, 
        {
            "def": "Narasiṃha (नरसिंह): The fourth Avatar of Vishnu. He is a mixed form of a man and a lion.", 
            "link": "/wiki/Narasimha", 
            "name": "Narasiṃha"
        }, 
        {
            "def": "Nara (नर): Arjuna or Dhananjaya.", 
            "link": null, 
            "name": "Nara"
        }, 
        {
            "def": "Nārada (नारद): Narada is the Hindu divine sage, who is an enduring chanter of the names Hari and Narayana which other names for Vishnu, considered to be the supreme God by Vaishnavites and many other Hindus. He is regarded the Manasputra of Brahma as he was born of his thoughts. He is regarded as the Triloka sanchaari, the ultimate nomad, who roams the three lokas of Swargaloka, Mrityuloka and Patalloka to find out about the life and welfare of people.", 
            "link": "/wiki/Narada", 
            "name": "Nārada"
        }, 
        {
            "def": "Nārāyaṇa (नारायण): Nārāyaṇa is an important Sanskrit name for Vishnu. The name is also associated with Brahma and Krishna. He is also identified with, or as the son of, the original man, Purusha.", 
            "link": "/wiki/Narayana", 
            "name": "Nārāyaṇa"
        }, 
        {
            "def": "Nārāyaṇāsrama (नारायणाश्रम): A charming forest where the Pandavas had halted during their wanderings.", 
            "link": "/w/index.php?title=Narayanasrama&action=edit&redlink=1", 
            "name": "Nārāyaṇāsrama"
        }, 
        {
            "def": "Nārāyaṇastra ( नारायणास्त्र ): Narayanastra is the personal missile weapon of Vishnu in his Narayana form, this astra lets loose a powerful tirade of millions of deadly missiles simultaneously.", 
            "link": "/wiki/Narayanastra", 
            "name": "Nārāyaṇastra"
        }, 
        {
            "def": "Narishyanta (नरिष्यन्त): Narishyanta was son of Vaivasvata Manu and belongs to solar race of Kshatriyas.", 
            "link": "/wiki/Narishyanta", 
            "name": "Narishyanta"
        }, 
        {
            "def": "Narmadā (नर्मदा): The Nerbudda river, one of the most important sacred rivers, originating from Amarkantak is believed to have descended from the sky by the order of Lord Shiva. The personified river is variously represented as being daughter of a Rishi named Mekala (from whom she is called Mekala and Mekala-kanya), as a daughter of the moon, as a 'mind-born daughter' of the Somapas, and as sister of the Nagas. It was she who brought Purukutsa to the aid of the Nagas against the Gandharvas, and the grateful snake-gods made her name a charm against the venom of snakes.", 
            "link": "/wiki/Narmada_River", 
            "name": "Narmadā"
        }, 
        {
            "def": "Navadurga (नवदुर्गा): Literally means nine Durgas, constitute, according to Hindu mythology, the manifestation of Durga in nine different forms.", 
            "link": "/wiki/Navadurga", 
            "name": "Navadurga"
        }, 
        {
            "def": "Navaratri (नवरात्रि): A Hindu festival of worship and dance. The word Navaratri literally means nine nights in Sanskrit. During these nine nights and ten days, nine forms of Shakti/Devi are worshipped.", 
            "link": "/wiki/Navaratri", 
            "name": "Navaratri"
        }, 
        {
            "def": "Netā (नेता): Netā was daughter of Shiva and friend of Manasa Devi.", 
            "link": "/w/index.php?title=Net%C4%81&action=edit&redlink=1", 
            "name": "Netā"
        }, 
        {
            "def": "Nikumbha (निकुम्‍भ): One of Ravana's generals who led the rakshasas against the host of monkeys and was slain.", 
            "link": "/wiki/Nikumbha", 
            "name": "Nikumbha"
        }, 
        {
            "def": "Nīla (नील): Son of Agni; One of the monkey host placed at the gate guarded by Prahasta.", 
            "link": "/w/index.php?title=N%C4%ABla&action=edit&redlink=1", 
            "name": "Nīla"
        }, 
        {
            "def": "Nirvāṇa (निर्वाण): Literally \"extinction\" and/or \"extinguishing\", is the culmination of the yogi's pursuit of liberation. Hinduism uses the word nirvana to describe the state of moksha, roughly equivalent to heaven.", 
            "link": "/wiki/Nirvana", 
            "name": "Nirvāṇa"
        }, 
        {
            "def": "Nishādha (निषाध): A country where Indra, Lord of the gods had lived once disguised as a brahmana. King of the Nishadha was Guha who guarded Rama after he crossed Koshala kingdom on his exile.", 
            "link": "/wiki/Nishadha", 
            "name": "Nishādha"
        }, 
        {
            "def": "Om, or Aum (ॐ): the most sacred syllable in Hinduism, first coming to light in the Vedic Tradition. The syllable is sometimes referred to as the \"Udgitha\" or \"pranava mantra\" (primordial mantra); not only because it is considered to be the primal sound, but also because most mantras begin with it.", 
            "link": "/wiki/Om", 
            "name": "OmAumUdgitha"
        }, 
        {
            "def": "Pānchajanya (पांचजन्‍य): Name of Krishna's conch.", 
            "link": "/wiki/Panchajanya", 
            "name": "Pānchajanya"
        }, 
        {
            "def": "Palāsa (पलास): A tree Butea frondosa also called \"flame of the forest\".", 
            "link": "/wiki/Butea", 
            "name": "Palāsa"
        }, 
        {
            "def": "Pānchāla (पांचाल): Pānchāla corresponds to the geographical area between the Ganges River and Yamuna River around the city of Kanpur and Benares. Anciently, it was home to an Indian kingdom, the Panchalas, one of the Mahajanapadas.", 
            "link": "/wiki/Panchala", 
            "name": "Pānchāla"
        }, 
        {
            "def": "Pānchālī (पांचाली): Another name of Draupadi, Queen of the Pandavas and daughter of King Drupada.", 
            "link": "/wiki/Draupadi", 
            "name": "Pānchālī"
        }, 
        {
            "def": "Pānchālya (पांचाल्य): A son of King Drupada who died in the war.", 
            "link": "/w/index.php?title=Panchalya&action=edit&redlink=1", 
            "name": "Pānchālya"
        }, 
        {
            "def": "Panchvatī (पंचवटी): The place beside the river Godavari where Rama, Sita and Laxmana stayed in exile.", 
            "link": "/w/index.php?title=Panchvati&action=edit&redlink=1", 
            "name": "Panchvatī"
        }, 
        {
            "def": "Pāṇḍavaḥ (पाण्‍डव): Pandavas in Sanskrit pāṇḍavaḥ are the five acknowledged sons of Pandu, by his two wives Kunti and Madri. They are Yudhishthira, Bhima, Arjuna and Nakula, Sahadeva", 
            "link": "/wiki/Pandavas", 
            "name": "Pāṇḍavaḥ"
        }, 
        {
            "def": "Pāṇḍu (पाण्‍डु): Second son of Vichitravirya and Ambalika who succeeded to the throne of Hastinapura on his father's death, as his elder brother Dhritarashtra was born blind, father of the Pandavas.", 
            "link": "/wiki/Pandu", 
            "name": "Pāṇḍu"
        }, 
        {
            "def": "Paramhamsa (परमहंस): The supreme swan", 
            "link": "/wiki/Paramhamsa", 
            "name": "Paramhamsa"
        }, 
        {
            "def": "Pārāsara (पारासर): A great sage, father of Veda Vyasa.", 
            "link": "/wiki/Parashara", 
            "name": "Pārāsara"
        }, 
        {
            "def": "Parashurama (परसुराम): Sixth avatara of Vishnu, the son of Jamadagni. His name literally means Rama-with-the-axe. He received an axe after undertaking a terrible penance to please Shiva, from whom he learned the methods of warfare and other skills. Parashurama's creation was a mistake as his mother was given a concoction made to produce a Kshatriya child. Parashurama was of mixed varna.", 
            "link": "/wiki/Parashurama", 
            "name": "Parashurama"
        }, 
        {
            "def": "Pārtha (पार्थ): Another name of Arjuna.", 
            "link": "/wiki/Partha", 
            "name": "Pārtha"
        }, 
        {
            "def": "Paravasu (परवसु): Son of Raibhva and elder brother of Arvavasu whose wife was violated by Yavakrida, who was killed with a spear by a fiend for his sin.", 
            "link": "/w/index.php?title=Paravasu&action=edit&redlink=1", 
            "name": "Paravasu"
        }, 
        {
            "def": "Parikshit (परिक्षित): Son of Abhimanyu and grandson of the Pandavas who was crowned king after the holocaust claimed the Kauravas and the Pandavas.", 
            "link": "/wiki/Parikshit", 
            "name": "Parikshit"
        }, 
        {
            "def": "Parṇada (पर्णाद): The name of a brahman who brought news of Nala to Damayanti.", 
            "link": "/w/index.php?title=Parnada&action=edit&redlink=1", 
            "name": "Parṇada"
        }, 
        {
            "def": "Pārvatī (पार्वती): Goddess of love, the consort of Shiva and mother of Ganesha,Rukmini prayed to her for saving her from the cruel Sisupala king of Chedi, as she had set her heart on marrying Krishna.", 
            "link": "/wiki/Parvati", 
            "name": "Pārvatī"
        }, 
        {
            "def": "Pāśupatāstra (पाशुपतास्त्र): Pāśupatāstra is the irresistible and most destructive personal weapon of Siva discharged by the mind, eyes, words or a bow.", 
            "link": "/wiki/Pashupatastra", 
            "name": "Pāśupatāstra"
        }, 
        {
            "def": "Paurava (पौरव): A Kaurava hero.", 
            "link": "/wiki/Paurava", 
            "name": "Paurava"
        }, 
        {
            "def": "Pavanrekhā (पवनरेखा): Wife of Ugrasena, mother of Kams.", 
            "link": "/w/index.php?title=Pavanrekha&action=edit&redlink=1", 
            "name": "Pavanrekhā"
        }, 
        {
            "def": "Phalguna (फल्‍गुन): Arjuna.", 
            "link": "/wiki/Phalguna", 
            "name": "Phalguna"
        }, 
        {
            "def": "Pitāmaha (पितामह): Literally grandfather, which however carried no imputation of senile infirmity but denotes the status of the pater familias.", 
            "link": "/w/index.php?title=Pitamaha&action=edit&redlink=1", 
            "name": "Pitāmaha"
        }, 
        {
            "def": "Prabhasa (प्रभास): The Vasu who seized Vasishtha's divine cow.", 
            "link": "/wiki/Prabhasa", 
            "name": "Prabhasa"
        }, 
        {
            "def": "Pradyumna (प्रद्‍युम्‍न): Son of Krishna and Rukmani.", 
            "link": "/wiki/Pradyumna", 
            "name": "Pradyumna"
        }, 
        {
            "def": "Prahasta (प्रहस्‍त): Means long-head, One of Ravana's generals.", 
            "link": "/wiki/Prahasta", 
            "name": "Prahasta"
        }, 
        {
            "def": "Prajāpatī (प्रजाप‍ित): Prajāpatīs are a group (or one) of creation gods, children of Brahma, including Daksha.", 
            "link": "/wiki/Prajapati", 
            "name": "Prajāpatī"
        }, 
        {
            "def": "Pramanakoti (प्रमाणकोटि): A beautiful spot on the banks of the Ganges, to the north of Hastinapura, the Kuru capital (1,128). Duryodhana built a palace here for disporting himself in the waters of Ganges. A huge banyan tree was the mark of that place (3,12). Here he poisoned the food of Bhima, bound him and threw him into Ganges. Bhima was rescued by the Naga tribes living in the vicinity (1,128) (8,83) (9,56).", 
            "link": "/w/index.php?title=Pramanakoti&action=edit&redlink=1", 
            "name": "Pramanakoti"
        }, 
        {
            "def": "Prasad (प्रसाद): Food or other offerings, considered to be sanctified, after being presented to God. (See also: Naivedhya)", 
            "link": "/wiki/Prasad", 
            "name": "Prasad"
        }, 
        {
            "def": "Pratikhami (प्रतिखामी): Duryodhana's charioteer.", 
            "link": "/w/index.php?title=Pratikhami&action=edit&redlink=1", 
            "name": "Pratikhami"
        }, 
        {
            "def": "Prayāg (प्रयाग): The holy place at Allahabad where Ganges and Yamuna meet.", 
            "link": "/wiki/Prayag", 
            "name": "Prayāg"
        }, 
        {
            "def": "Prithā (प्रिथा): Mother of Karna and of the Pandavas; equivalent Kunti.", 
            "link": "/wiki/Prith%C4%81", 
            "name": "Prithā"
        }, 
        {
            "def": "Puṇdarikaksha (पुण्डरिक्ष ): Krishna, the lotus-eyed one.", 
            "link": "/wiki/Pundarikaksha", 
            "name": "Puṇdarikaksha"
        }, 
        {
            "def": "Purāṇa (पुराण): Purana meaning \"ancient\" or \"old\" is the name of a genre (or a group of related genres) of Indian written literature (as distinct from oral literature). Its general themes are history, tradition and religion. It is usually written in the form of stories related by one person to another.", 
            "link": "/wiki/Purana", 
            "name": "Purāṇa"
        }, 
        {
            "def": "Purochana (पुरोचन ): An architect and friend of Duryodhana, who built a beautiful wax palace named \"Sivam\" in Varanavata. Kunti prepared a lavish feast which left him intoxicated and led to his death as the wax palace burnt down.[1]", 
            "link": "/wiki/Purochana", 
            "name": "Purochana"
        }, 
        {
            "def": "Purumitra (पुरुमित्र ): A Kaurava warrior", 
            "link": "/w/index.php?title=Purumitra&action=edit&redlink=1", 
            "name": "Purumitra"
        }, 
        {
            "def": "Purushārtha (पुरुषार्थ): The four chief aims of human life. Arranged from lowest to highest, these goals are: sensual pleasures (kama), worldly status and security (artha), personal righteousness and social morality (dharma), and liberation from the cycle of reincarnation (moksha).", 
            "link": "/wiki/Purusharthas", 
            "name": "Purushārtha"
        }, 
        {
            "def": "Purushottama (पुरुषोत्तम): An epithet of Sri Krishna. It is one of the names of Vishnu and means the Supreme Being.", 
            "link": "/wiki/Purushottama", 
            "name": "Purushottama"
        }, 
        {
            "def": "Pushkara: The brother of Nala to whom nala lost his kingdom and all that he possessed in gambling.", 
            "link": "/wiki/Pushkara", 
            "name": "Pushkara"
        }, 
        {
            "def": "Rādhā (राधा): Rādhā is one of the gopis (cow-herding girls) of the forest of Vrindavan, Krishna plays with her during his upbringing as a young boy; The other Radha is the wife of the charioteer Adhiratha, who found an abandoned new-born boy, whom he named Karna.", 
            "link": "/wiki/Radha", 
            "name": "Rādhā"
        }, 
        {
            "def": "Rāhu (राहु): Rahu is a snake that swallows the sun or the moon causing eclipses. Rahu is one of the navagrahas.", 
            "link": "/wiki/Rahu", 
            "name": "Rāhu"
        }, 
        {
            "def": "Raibhya (रैभ्य): A sage whose hermitage was situated on the banks of the Ganges, near Rishikesh, a place, which gets its name, from Lord Vishnu appearing to him as Hrishikesh. The Pandavas during their wanderings visited it. This ghat was very holy. Bharata, son of Dasharatha bathed here. Indra was cleansed of his sin of killing Vritra unfairly by bathing in this ghat. Sanatkumar became one with God. Aditi, mother of the gods, prayed here to be blessed with a son.", 
            "link": "/w/index.php?title=Raibhya&action=edit&redlink=1", 
            "name": "Raibhya"
        }, 
        {
            "def": "Radheya (राधेय): Son of Radha, a name of Karna, who as a foundling was brought up as a son by Radha, the wife of the Charioteer Adhiratha.", 
            "link": "/wiki/Radheya", 
            "name": "Radheya"
        }, 
        {
            "def": "Rajasūya (राजसूय): A sacrifice performed by a king to be entitled to assume the title of \"Emperor\".", 
            "link": "/wiki/Rajasuya", 
            "name": "Rajasūya"
        }, 
        {
            "def": "Rā́kṣasaḥ (रा॑क्षस): A rakshasa alternately, raksasa or rakshas is a demon or unrighteous spirit in Hinduism.", 
            "link": "/wiki/Rakshasa", 
            "name": "Rā́kṣasaḥ"
        }, 
        {
            "def": "Rāma (राम): The Seventh Avatara of Vishnu. The life and heroic deeds of Rama are written in the Sanskrit epic, The Ramayana.", 
            "link": "/wiki/Rama", 
            "name": "Rāma"
        }, 
        {
            "def": "Ramanaka dwīpa (रमणक द्वीप): The home of Kaliya Naga, a poisonous hydra, on the banks of Yamuna river.", 
            "link": "/w/index.php?title=Ramanaka_dwipa&action=edit&redlink=1", 
            "name": "Ramanaka dwīpa"
        }, 
        {
            "def": "Rāmāyaṇa (रामायण): Part of the Hindu smriti, written by Valmiki. This epic of 24,000 verses in seven kandas (chapters or books) tells of a Raghuvamsa prince, Rama of Ayodhya, whose wife Sita is abducted by the rakshasa Ravana.", 
            "link": "/wiki/Ramayana", 
            "name": "Rāmāyaṇa"
        }, 
        {
            "def": "Rāma-navamī (राम नवमी): A Hindu festival, celebrating of the birth of Lord Rama. The day falls on the Navami, ninth day of the Chaitra month of Hindu lunar year in 'Shukla paksha'.", 
            "link": "/wiki/Ram_Navami", 
            "name": "Rāma-navamī"
        }, 
        {
            "def": "Rambhā (रम्‍भा): An apsara in the court of Indra.", 
            "link": "/wiki/Rambha_(apsara)", 
            "name": "Rambhā"
        }, 
        {
            "def": "Ratī (रती): Ratī is the goddess of passion and lust, and a daughter of Daksha. She married Kamadeva, the God of love.", 
            "link": "/wiki/Rati", 
            "name": "Ratī"
        }, 
        {
            "def": "Rāvaṇa (रावण): King of Lanka who abducted Sita, the beautiful wife of Ramachandra. Ravana is depicted in art with up to ten heads, signifying that he had knowledge spanning all the ten directions.", 
            "link": "/wiki/Ravana", 
            "name": "Rāvaṇa"
        }, 
        {
            "def": "Rewatī (रेवती): Daughter of Raja Rewat of Arntā who marries Balarama", 
            "link": "/w/index.php?title=Rewati&action=edit&redlink=1", 
            "name": "Rewatī"
        }, 
        {
            "def": "Ṝgveda (ऋग्वेद): The Rigveda is a collection of Vedic Sanskrit hymns counted as the holiest of the four religious texts of Hindus, known as the Vedas.", 
            "link": "/wiki/Rigveda", 
            "name": "Ṝgveda"
        }, 
        {
            "def": "Rishabha (ऋषभ): Rsabha, the bull, a Hindu god mentioned in epic and Puranic literature, is an unusual avatar of Vishnu. The second note of the Indian gamut (Shadja, rishabha, gandhara, madhyama, panchama, daivata, nishada -sa, ri, ga, ma, pa, dha, ni.)", 
            "link": "/wiki/Rishabha_(Hinduism)", 
            "name": "Rishabha"
        }, 
        {
            "def": "Ṛta (ऋतं): Vedic principle of natural order believed to regulate and coordinate the operation of the universe on the natural, moral and sacrificial levels.", 
            "link": "/wiki/Rta", 
            "name": "Ṛta"
        }, 
        {
            "def": "Ṛṣi (ऋषि): Rishi, also known as Mantradraṣṭa (\"seer of the Mantras\") and Vedavaktāra (\"chanter of the Vedas\") is a seer who \"heard\" (cf. śruti) the hymns of the Vedas. A rishi is regarded as a combination of a patriarch, a priest, a preceptor, an author of Vedic hymns, a sage, a saint, an ascetic, a prophet and a hermit into a single person.", 
            "link": "/wiki/Rishi", 
            "name": "Ṛṣi"
        }, 
        {
            "def": "Rishyamūk (ऋष्यमूक): Mountain on which Sugriva dwelt.", 
            "link": "/w/index.php?title=Rishyamuk&action=edit&redlink=1", 
            "name": "Rishyamūk"
        }, 
        {
            "def": "Rishyasringa (ऋष्यश्रृंग): Son of sage Vibhandaka, who had grown up seeing no mortal except his father. The king of Anga, which was afflicted with a dire famine, to bring rain and plenty, invited him.", 
            "link": "/wiki/Rishyasringa", 
            "name": "Rishyasringa"
        }, 
        {
            "def": "Rituparṇa (ऋतुपर्ण): The king of Ayodhya to whom Nala became the charioteer.", 
            "link": "/wiki/Rituparna", 
            "name": "Rituparṇa"
        }, 
        {
            "def": "Rohiṇi (रोहिणि): The wife of Vasudeva and mother of Balarama", 
            "link": "/wiki/Rohini_Devi", 
            "name": "Rohiṇi"
        }, 
        {
            "def": "Romapada (रोमपद): King of Anga which was once visited by a great drought.", 
            "link": "/wiki/Romapada", 
            "name": "Romapada"
        }, 
        {
            "def": "Rudra (रुद्र): A Rigvedic god of the storm, the hunt, death, Nature and the Wind. Rudra is an early form of Shiva and a name of Shiva in the Shiva sahasranama.", 
            "link": "/wiki/Rudra", 
            "name": "Rudra"
        }, 
        {
            "def": "Rudra nritya (रुद्र नृत्‍य): Siva's cosmic dance of destruction.", 
            "link": "/wiki/Rudra", 
            "name": "Rudra nritya"
        }, 
        {
            "def": "Rukma (रुक्‍म): Elder brother of Rukmani, Heir apparent to the throne of Vidarbha. When defeated by Balarama and Krishna he established a new city Bhojakata, ashamed to return to Kundinapura, the capital of Vidarbha, and ruled over it.", 
            "link": "/wiki/Rukma", 
            "name": "Rukma"
        }, 
        {
            "def": "Rukmiṇī (रुक्‍मिणी): Daughter of Raja Bhismak, born at Kundalpur. Rukmini was the first wife and queen of Krishna, the 8th avatar of Vishnu. She was an avatar of Lakshmi.", 
            "link": "/wiki/Rukmini", 
            "name": "Rukmiṇī"
        }, 
        {
            "def": "Ruparekha (रूपरेखा): Lit. meaning a treak of Beauty. A statue in the throne of Vikramaditya.", 
            "link": "/w/index.php?title=Ruparekha&action=edit&redlink=1", 
            "name": "Ruparekha"
        }, 
        {
            "def": "Shachī (शची): Wife of Indra, king of the gods on whom Nahusha's evil eye fell. Through the help of Brihaspati, she caused Nahusha's downfall and restored Indra as the leader of the Devas.[1] She was also known as Indrani.", 
            "link": "/wiki/Sachi_Devi", 
            "name": "Shachī"
        }, 
        {
            "def": "Sadhana (साधना): Spiritual exercise by a Sadhu or a Sadhaka to attain moksha, which is liberation from the cycle of birth and death (Samsara), or a particular goal such as blessing from a deity.", 
            "link": "/wiki/Sadhana", 
            "name": "Sadhana"
        }, 
        {
            "def": "Sagara (सगर): King Sagar is one of the greatest kings of Suryavansha in the Satya Yuga. He was king of Ayodhya, ancestor to King Dasharatha. He had two wives Keshini and Sumati. Asamanja was his son from Keshini.", 
            "link": "/wiki/Sagara_(Vedic_king)", 
            "name": "Sagara"
        }, 
        {
            "def": "Sahadéva (सहदेव): Youngest of the Pandava princes who offered the first honors to Krishna at the Rajasuya sacrifices.", 
            "link": "/wiki/Sahadeva", 
            "name": "Sahadéva"
        }, 
        {
            "def": "Saibya (सैब्‍य): A ruler friendly to the Pandavas.", 
            "link": "/w/index.php?title=Saibya&action=edit&redlink=1", 
            "name": "Saibya"
        }, 
        {
            "def": "Sairandhri (सैरंध्री): A maid servant or female attendant employed in royal female apartments.", 
            "link": "/wiki/Sairandhri", 
            "name": "Sairandhri"
        }, 
        {
            "def": "Saindhava (सैंधव): Jayadratha.", 
            "link": "/w/index.php?title=Saindhava&action=edit&redlink=1", 
            "name": "Saindhava"
        }, 
        {
            "def": "Śakra (सक्र): Śakra is identified with the Vedic deity Indra. Śakra is sometimes named as one of the twelve Ādityas.", 
            "link": "/wiki/Indra", 
            "name": "Śakra"
        }, 
        {
            "def": "Shakuni (शकुनि): Shakuni was the brother of Gandhari. He was very fond of his nephew Duryodhana. He won the Pandavas' half of the kingdom for his nephew, as a wager in a rigged game of dice.", 
            "link": "/wiki/Sakuni", 
            "name": "Shakuni"
        }, 
        {
            "def": "Salva (सल्‍व): Friend of Sisupala, who besieged Dwaraka Sri Krishna's kingdom to avenge Sisupala's death at the latter's hand.", 
            "link": null, 
            "name": "Salva"
        }, 
        {
            "def": "Shalya (शल्‍य): Ruler of Madradesa and brother of Madri and uncle of the Pandavas who because of having received hospitality from Duryodhana went over to his side.", 
            "link": "/wiki/Shalya", 
            "name": "Shalya"
        }, 
        {
            "def": "Samādhi (समाधि): A term used in yogic meditation. Samadhi is also the Hindi word for a structure commemorating the dead.", 
            "link": "/wiki/Sam%C4%81dhi", 
            "name": "Samādhi"
        }, 
        {
            "def": "Samba : Sambu was son of Krishna, who married Lakshmana, daughter of Duryodhana.", 
            "link": "/wiki/Samba_(Krishna%27s_son)", 
            "name": "Samba"
        }, 
        {
            "def": "Sāmkhya (सांख्य): A school of philosophy emphasising a dualism between Purusha and Prakrti, propounded by sage Kapila.", 
            "link": "/wiki/Samkhya", 
            "name": "Sāmkhya"
        }, 
        {
            "def": "Sampāti (सम्पाति): Sampati was one of the two sons of Aruna, elder brother of Jatayu. Sampati lost his wings when he was a child.", 
            "link": "/wiki/Sampati", 
            "name": "Sampāti"
        }, 
        {
            "def": "Samsaptaka (संसप्‍तक): One who has taken a vow to conquer or die, and never to retreat. The Samsaptakas were suicide-squads, vowed to some desperate deed of daring.", 
            "link": "/w/index.php?title=Samsaptaka&action=edit&redlink=1", 
            "name": "Samsaptaka"
        }, 
        {
            "def": "Samsara (संसार): Means wandering, The tree worlds constitute Samsara. Refers to the concept of reincarnation or rebirth in Indian philosophical traditions.", 
            "link": "/wiki/Samsara", 
            "name": "Samsara"
        }, 
        {
            "def": "Samvarta (संवर्त): Brihaspati's younger brother, a person of great learning.", 
            "link": "/w/index.php?title=Samvarta&action=edit&redlink=1", 
            "name": "Samvarta"
        }, 
        {
            "def": "Samba (संब): A Yadava youngster dressed as a woman who gave birth to a mace, as foretold by rishis.", 
            "link": "/w/index.php?title=Samba_(Hindu_mythology)&action=edit&redlink=1", 
            "name": "Samba"
        }, 
        {
            "def": "Samudra manthan (समुद्र मन्थन): Samudra manthan or The churning of the ocean of milk is one of the most famous episodes in the Puranas and is celebrated in a major way every twelve years in the festival known as Kumbha Mela.", 
            "link": "/wiki/Samudra_manthan", 
            "name": "Samudra manthan"
        }, 
        {
            "def": "Sanga (संग): Son of Virata. When king Virata was wounded, he had to get into Sanga's chariot, having lost his chariot, horses and charioteer", 
            "link": null, 
            "name": "Sanga"
        }, 
        {
            "def": "Sanjaya (संजय): The narrator who tells blind Dhritarashtra the progress of the war from day to day. He told the king that a victim of adverse fate would first become perverted and loses his sense of right and wrong. Time would destroy his reason and drive him to his own destruction.", 
            "link": "/wiki/Sanjaya", 
            "name": "Sanjaya"
        }, 
        {
            "def": "Sanjīvanī (संजीवनी):Sanjeevani is a magical herb mentioned in the Ramayana when, Lakshmana is badly wounded and is nearly killed by Ravana. Hanuman was called upon to fetch this herb from the mount Dronagiri a.k.a. Mahodaya in the Himalayas. Sushena took the life-giving plant and made Lakshman to smell its savour, so that he rose up whole and well.", 
            "link": "/wiki/Sanjeevani_(plant)", 
            "name": "Sanjīvanī"
        }, 
        {
            "def": "Sankula Yuddha (संकुल युद्ध): A melee, confused fight, a soldiers battle as distinguished from the combats of heroes.", 
            "link": "/w/index.php?title=Sankula_Yuddha&action=edit&redlink=1", 
            "name": "Sankula Yuddha"
        }, 
        {
            "def": "Santā (संता): Daughter of Dasharatha, Wife of sage Rishyasringa.", 
            "link": "/wiki/Santa", 
            "name": "Santā"
        }, 
        {
            "def": "Sāntanu (सांतनु): King of Hastinapura, father of Bhishma.", 
            "link": "/wiki/Santanu", 
            "name": "Sāntanu"
        }, 
        {
            "def": "Sanyāsin (सन्यासिन): One who has renounced the world and its concerns.", 
            "link": "/wiki/Sanyasin", 
            "name": "Sanyāsin"
        }, 
        {
            "def": "Saran (सारण): The spy of Ravana, Mentioned in Ramayana Yuddha Kanda/Sarga 26, who tells Ravana about strength of the army of vanaras.", 
            "link": "/wiki/Saharan_(gotra)#In_Mythology", 
            "name": "Saran"
        }, 
        {
            "def": "Sarasana (सरसन): One of the Kaurava brothers who died in the war.", 
            "link": "/w/index.php?title=Sarasana&action=edit&redlink=1", 
            "name": "Sarasana"
        }, 
        {
            "def": "Sharmishtha (सरमिष्‍ठा): Princess and daughter of asura king Vrishaparva, wife of Yayati, who got angry with Devayani and slapped and pushed her into a dry well. Sarmishtha gave birth to Druhyu, Anu, and Puru.", 
            "link": "/wiki/Sharmishtha", 
            "name": "Sharmishtha"
        }, 
        {
            "def": "Saraswati (सरस्वती): Saraswati is the first of the three great goddesses of Hinduism, the other two being Lakshmi and Durga. Saraswati is the consort of Lord Brahmā, the Creator.", 
            "link": "/wiki/Saraswati", 
            "name": "Saraswati"
        }, 
        {
            "def": "Sarayū (सरयू): Sarayu was an ancient Indian river, sometimes thought of at probably today's Ghaghara river, and sometimes as a tributary. The river where Lakshamana practices austerities.", 
            "link": "/wiki/Sarayu", 
            "name": "Sarayū"
        }, 
        {
            "def": "Satanika (सतनिक): Virata's son whose bead was severed by Drona.", 
            "link": "/w/index.php?title=Satanika&action=edit&redlink=1", 
            "name": "Satanika"
        }, 
        {
            "def": "Satī (सती): One of name of Dākshāyani, Dākshāyani is the consort of Shiva. Other names for Dākshāyani include Gaurī, Umā, Aparnā, Lalithā, Sivakāmini etc. Sati is also the term for the immolation of a widow on her husband's pyre in Hinduism.", 
            "link": "/wiki/Sati_(Goddess)", 
            "name": "Satī"
        }, 
        {
            "def": "Satyajit (सत्यजित): A Panchala prince, a hero who stood by Yudhishthira to prevent his being taken prisoner by Drona, while Arjuna was away answering a challenge by the Samsaptakas (the Trigartas).", 
            "link": "/wiki/Satyajit", 
            "name": "Satyajit"
        }, 
        {
            "def": "Satyaki (सत्यकि): A Yadava warrior, friend of Krishna and the Pandavas who advocated collecting their forces and defeating the unrighteous Duryodhana.", 
            "link": "/wiki/Satyaki", 
            "name": "Satyaki"
        }, 
        {
            "def": "Satya Nārāyana (सत्य नारायण): Vishnu, Embodiment as Krishna.", 
            "link": "/w/index.php?title=Satya_Narayana&action=edit&redlink=1", 
            "name": "Satya Nārāyana"
        }, 
        {
            "def": "Satyavān (सत्यवान): Meaning the truth-speaker, husband of Savitri. The oldest known version of the story of Savitri and Satyavan is found in \"The Book of the Forest\" of the Mahabharata.", 
            "link": "/wiki/Satyavan", 
            "name": "Satyavān"
        }, 
        {
            "def": "Satyavatī (सत्यवती): A fisherman's daughter who possessed uncommon beauty and emanated a divinely sweet fragrance and king Santanu became enamored of her, married her and made her his queen. The wife of Bhishma's father, Shantanu.", 
            "link": "/wiki/Satyavati", 
            "name": "Satyavatī"
        }, 
        {
            "def": "Satyavrata (सत्यव्रत): Warrior on the Kaurava side.", 
            "link": "/wiki/Satyavrata", 
            "name": "Satyavrata"
        }, 
        {
            "def": "Saugandhika (सौगंधिका): A plant that produced a very beautiful and fragrant flower that Bhima went to get for Draupadi.", 
            "link": "/w/index.php?title=Saugandhika&action=edit&redlink=1", 
            "name": "Saugandhika"
        }, 
        {
            "def": "Sāvitrī (सावित्री): Wife of Satyavan.", 
            "link": "/wiki/Savitri_and_Satyavan", 
            "name": "Sāvitrī"
        }, 
        {
            "def": "Savyasachi (सव्‍यसाचि): Ambidexter, one who can use both hands with equal facility and effect. A name of Arjuna who could use his bow with the same skill with either hands.", 
            "link": "/wiki/Savyasachi", 
            "name": "Savyasachi"
        }, 
        {
            "def": "Shakti (शक्‍ती): An aspect of Devi and a personification of God as the Divine Mother who represents the active, dynamic principles of feminine power.", 
            "link": "/wiki/Shakti", 
            "name": "Shakti"
        }, 
        {
            "def": "Shaktism(शाक्तं): Lit., \"doctrine of power\" or \"doctrine of the Goddess\" is a denomination of Hinduism that focuses worship upon Shakti or Devi – the Hindu Divine Mother – as the absolute, ultimate Godhead. It is, along with Shaivism and Vaisnavism, one of the three primary schools of Hinduism.", 
            "link": "/wiki/Shaktism", 
            "name": "Shaktism"
        }, 
        {
            "def": "Shakuntalā (शकुन्‍तला): Shakuntala was mother of Emperor Bharata and the wife of Dushyanta. Shakuntala was born of Vishvamitra and Menaka.", 
            "link": "/wiki/Shakuntala", 
            "name": "Shakuntalā"
        }, 
        {
            "def": "Shālwa (शाल्व): The King with whom Ambā was secretly in love.", 
            "link": "/wiki/Shalwa", 
            "name": "Shālwa"
        }, 
        {
            "def": "Shankara (शंकर): A name of Shiva; A great magician, friend of Chand Sagar.", 
            "link": "/wiki/Shiva", 
            "name": "Shankara"
        }, 
        {
            "def": "Śankha (शंख): Shankha is the divine Counch or sea shell, which is one of the insignia in the Hindu God Vishnu's hands. The sound emitted from Shankha when blown, is too divine, that is used for regular rituals for Vishnu. Śankha was also the name of one of sons of King Virata who was killed in Mahabharata.", 
            "link": "/wiki/Shankha", 
            "name": "Śankha"
        }, 
        {
            "def": "Shantanu (शान्‍तनु): Shantanu was a king of Hastinapura, father of Bhishma. Shantanu weds Satyavati, a ferryman's daughter.", 
            "link": "/wiki/Shantanu", 
            "name": "Shantanu"
        }, 
        {
            "def": "Shatrughna (शत्रुघ्‍न): One of Dasharatha's four sons, King of Madhu.", 
            "link": "/wiki/Shatrughna", 
            "name": "Shatrughna"
        }, 
        {
            "def": "Śatapatha brāhmaṇa (शतपथ ब्राह्मण): Shatapatha Brahmana (\"Brahmana of one-hundred paths\"), abbreviated ŚB) is one of the prose texts describing the Vedic ritual, associated with the White Yajurveda.", 
            "link": "/wiki/Shatapatha_Brahmana", 
            "name": "Śatapatha brāhmaṇa"
        }, 
        {
            "def": "Shaivism (शैव धर्म): Shaivism names the oldest of the four sects of Hinduism. Followers of Shaivism, called \"Shaivas\", and also \"Saivas\" or \"Saivites\", revere Shiva as the Supreme Being.", 
            "link": "/wiki/Shaivism", 
            "name": "Shaivism"
        }, 
        {
            "def": "Śeṣa (शेष): Shesha is a naga that takes human birth through Devaki, one of the primal beings of creation. Equivalent-Ananta or Atī-sheshan. In the Puranas, Shesha is said to hold all the planets of the universe on his hoods and to constantly sing the glories of Vishnu from all his mouths.", 
            "link": "/wiki/Shesha", 
            "name": "Śeṣa"
        }, 
        {
            "def": "Shiva (शिव): A form of Ishvara or God in Shaivism. Śiva is commonly known as \"the destroyer\" and is the third god of the Trimurti.", 
            "link": "/wiki/Shiva", 
            "name": "Shiva"
        }, 
        {
            "def": "Shikhandi (शिखण्डी): Daughter-son of Drupada, A girl turned man, warrior on the Pandava side. He had been born in an earlier lifetime as a woman named Amba, who was rejected by Bhishma for marriage.", 
            "link": "/wiki/Shikhandi", 
            "name": "Shikhandi"
        }, 
        {
            "def": "Shishupāla (शिषुपाल): Shishupala was son of Damaghosha, king of Chedi, by Srutadeva, sister of Vasudeva; he was therefore cousin of Krishna, but he was Krishna's implacable foe, because Krishna had carried off Rukmini, his intended wife. Shishupāla was Identical with Hiranyakashipu who was slain by Krishnaat the time of Dharmaputra's Rajasuya sacrifice.", 
            "link": "/wiki/Shishupala", 
            "name": "Shishupāla"
        }, 
        {
            "def": "Shivi (शिवि): Shivi was a great, powerful and generous king. Indra and Agni once tested his generosity by becoming birds when the king gave flesh from his body to fulfil his duty.", 
            "link": "/wiki/Shivi", 
            "name": "Shivi"
        }, 
        {
            "def": "Shri (श्री): Another name of Lakshmi, a goddess, the delight of Vishnu.", 
            "link": "/wiki/Shri", 
            "name": "Shri"
        }, 
        {
            "def": "Shri Krishna (श्री कृष्‍ण): See Krishna.", 
            "link": "/wiki/Shri_Krishna", 
            "name": "Shri Krishna"
        }, 
        {
            "def": "Shrutkīrti (श्रुत्‍कीर्ति): Daughter of Kushadhwaja; bestowed on Shatrughna.", 
            "link": "/w/index.php?title=Shrutkirti&action=edit&redlink=1", 
            "name": "Shrutkīrti"
        }, 
        {
            "def": "Shudra (शुद्र): One of the four castes in Hindu tradition, consisting of artisans, cleaners and labourers.", 
            "link": "/wiki/Shudra", 
            "name": "Shudra"
        }, 
        {
            "def": "Shukracharya (शुक्राचार्य): Shukracharya was a guru in Hindu mythology. Known as the guru of the Asuras, he is also associated with the planet Shukra (Venus) which is named after him. He was born as the son of Rishi Brighu and his wife Ushana.", 
            "link": "/wiki/Shukracharya", 
            "name": "Shukracharya"
        }, 
        {
            "def": "Siddhāshrama (सिद्धाश्रम): The Shiva's hermitage, Where Rama and Vishvamitra sacrifice for many days.", 
            "link": "/wiki/Siddhashrama", 
            "name": "Siddhāshrama"
        }, 
        {
            "def": "Simhanada (सिंहनाद): A lion-note or roar; a deep roar of defiance or triumph which warriors were wont to utter to inspire confidence in their friends, of terror in their enemies.", 
            "link": "/w/index.php?title=Simhanada&action=edit&redlink=1", 
            "name": "Simhanada"
        }, 
        {
            "def": "Sindhu (सिन्धु): The Indus River, Urdu دریائے سندھ; Tibetan: Sengge Chu ('Lion River'); Persian: Hindu; Greek: Sinthos; Pashto: Abaseen (\"The Father of Rivers\"); Mehran (an older name)) is the longest and most important river in Pakistan. Originating in the Tibetan plateau in the vicinity of Lake Mansarovar.", 
            "link": "/wiki/Sindhu", 
            "name": "Sindhu"
        }, 
        {
            "def": "Sinhikha (सिंहिख): The grim rakshasa who rose from the sea and caught Hanumana, when he coursed through the air like Garuda in search of Sita.", 
            "link": "/w/index.php?title=Sinhikha&action=edit&redlink=1", 
            "name": "Sinhikha"
        }, 
        {
            "def": "Sini (सिनि): One of the suitors to Devaki's hand. A kinsman of the Kauravas.", 
            "link": null, 
            "name": "Sini"
        }, 
        {
            "def": "Sītā (सीता): Sita was the wife of Rama, and is esteemed an exemplar of womanly and wifely virtue. Sita was herself an avatāra of Lakshmi, Vishnu's eternal consort, who chose to reincarnate herself on Earth as Sita, and endure an arduous life, in order to provide humankind an example of such virtues.", 
            "link": "/wiki/Sita", 
            "name": "Sītā"
        }, 
        {
            "def": "Sloka (श्‍लोक): A verse of lines in Sanskrit, typically recited as a prayer.", 
            "link": "/wiki/Shloka", 
            "name": "Sloka"
        }, 
        {
            "def": "Smarta (स्‍मर्त): A Hindu denomination, which follows Advaita philosophy and considers that all gods are manifestations of Ishvar.", 
            "link": "/wiki/Smarta", 
            "name": "Smarta"
        }, 
        {
            "def": "Śruti (श्रुति): A canon of Hindu scriptures. Shruti is believed to have no author; rather a divine recording of the \"cosmic sounds of truth\", heard by rishis.", 
            "link": "/wiki/%C5%9Aruti_(scripture)", 
            "name": "Śruti"
        }, 
        {
            "def": "Soma (सोम): A ritual drink of importance among Hindus. It is frequently mentioned in the Rigveda, which contains many hymns praising its energizing or intoxicating qualities.", 
            "link": "/wiki/Soma", 
            "name": "Soma"
        }, 
        {
            "def": "Somadutta (सोमदत्त): One of the suitors to Devaki's hand. A kinsman of the Kauravas.", 
            "link": "/w/index.php?title=Somadutta&action=edit&redlink=1", 
            "name": "Somadutta"
        }, 
        {
            "def": "Sthūṇa (स्थूण): A Yaksha, follower of Kubera, who exchanges his identity with Shikhandin, A rakshasa who helps disturb Vishvamitra's sacrifices.", 
            "link": "/w/index.php?title=Sthuna&action=edit&redlink=1", 
            "name": "Sthūṇa"
        }, 
        {
            "def": "Subahu (सुबाहु): King of Kulinda in the Himalayas, ally of the Kauravas, Subahu was a demon who tried to interrupt Viswamitra's yaga. He was slain by Lord Rama. King of Chedi.", 
            "link": "/wiki/Subahu", 
            "name": "Subahu"
        }, 
        {
            "def": "Subhadra (सुभद्रा): Wife of Arjuna, sister of Sri Krishna and mother of Abhimanyu.", 
            "link": "/wiki/Subhadra", 
            "name": "Subhadra"
        }, 
        {
            "def": "Subrahmaniam (सुब्रहमण्यम): The southern mountain deity.", 
            "link": "/w/index.php?title=Subrahmaniam&action=edit&redlink=1", 
            "name": "Subrahmaniam"
        }, 
        {
            "def": "Sudakshina (सुदक्षिण): A warrior on the Kaurava side.", 
            "link": "/wiki/Sudakshina", 
            "name": "Sudakshina"
        }, 
        {
            "def": "Sudarsana (सुदर्सण): A warrior on the Kaurava army.", 
            "link": "/w/index.php?title=Sudarsana&action=edit&redlink=1", 
            "name": "Sudarsana"
        }, 
        {
            "def": "Sudarshana Chakra (सुदर्शन चक्र): Sudarshan Chakra is a spinning disc like weapon with very sharp edge, which is one of the weapons in the Hindu God Vishnu's hands.", 
            "link": "/wiki/Sudarshana_Chakra", 
            "name": "Sudarshana Chakra"
        }, 
        {
            "def": "Sudeshna (सुदेषणा): Queen of King Virata whom Sairandhri (Draupadi) served.", 
            "link": "/wiki/Sudeshna", 
            "name": "Sudeshna"
        }, 
        {
            "def": "Sudeva (सुदेव): A Brahman who traced Damayanti in Chedi and later helps Damayanti in her quest to find Nala. He was friend of Damayanti's brother.", 
            "link": "/w/index.php?title=Sudeva&action=edit&redlink=1", 
            "name": "Sudeva"
        }, 
        {
            "def": "Sugrīva (सुग्रीव): Monkey-king, friend of Sri Rama, and brother of mighty Vali whom Sri Rama killed.", 
            "link": "/wiki/Sugriva", 
            "name": "Sugrīva"
        }, 
        {
            "def": "Sujata (सुजाता): Daughter of Sage Uddalaka and wife of Kagola, his disciple who had virtue and devotion but not much of erudition, mother of Ashtavakra.", 
            "link": "/w/index.php?title=Sujata_(Mahabharata)&action=edit&redlink=1", 
            "name": "Sujata"
        }, 
        {
            "def": "Śuka (सुक): A sage, son of Vyasa, who related the Bhagavata Purana to King Parikshit, grandson of Arjuna.", 
            "link": "/wiki/%C5%9Auka", 
            "name": "Śuka"
        }, 
        {
            "def": "Sukanyā (सुकन्‍या): Meaning - Fair-maid, The wife of Chyavana whom the Ashvins beheld at her bath, bare of any garment.", 
            "link": "/wiki/Sukanya", 
            "name": "Sukanyā"
        }, 
        {
            "def": "Sumān (सुमन): Son of Asamanja.", 
            "link": "/w/index.php?title=Sum%C4%81n&action=edit&redlink=1", 
            "name": "Sumān"
        }, 
        {
            "def": "Sumatī (सुमती): Wife of Sagara.", 
            "link": "/w/index.php?title=Sumat%C4%AB&action=edit&redlink=1", 
            "name": "Sumatī"
        }, 
        {
            "def": "Sumitra (सुमित्र): Abhimanyu's charioteer.", 
            "link": "/wiki/Sumitra", 
            "name": "Sumitra"
        }, 
        {
            "def": "Sumitrā (सुमित्रा): One of Dasharatha's three wives; mother of Lakshamana and Shatrughna.", 
            "link": "/w/index.php?title=Sumitr%C4%81&action=edit&redlink=1", 
            "name": "Sumitrā"
        }, 
        {
            "def": "Sunda (सुन्‍द): Sunda and Upasunda were two brave and poerful asura princes who performed austerities to please Brahma, who bestowed them the boon that nobody else would slay them, other than each other. Later Brahma created a beautiful apsara Tilottama to creat differences within and destroyed them mutually.", 
            "link": "/wiki/Sunda_(asura)", 
            "name": "Sunda"
        }, 
        {
            "def": "Sunitī (सुनिती): Mother of Dhruva.", 
            "link": "/w/index.php?title=Suniti_(mythology)&action=edit&redlink=1", 
            "name": "Sunitī"
        }, 
        {
            "def": "Supārshwa (सुपार्शव): One of Ravana's counsellors.", 
            "link": "/w/index.php?title=Suparshwa&action=edit&redlink=1", 
            "name": "Supārshwa"
        }, 
        {
            "def": "Surabhi (सुरभि): The wish-bestowing cow that came first from the sea in the process of churning of the Ocean by gods and daityas.", 
            "link": "/wiki/Surabhi", 
            "name": "Surabhi"
        }, 
        {
            "def": "Surpankhā (सुर्पण्खा): A rākshasī; sister of ravana; desires Rama; seeks to become Lakshamana's wife who attempts to slay Sita.", 
            "link": "/w/index.php?title=Surpankha&action=edit&redlink=1", 
            "name": "Surpankhā"
        }, 
        {
            "def": "Supratika (सुप्रतिक): Name of King Bhagadatta's elephant.", 
            "link": "/wiki/Supratika", 
            "name": "Supratika"
        }, 
        {
            "def": "Sūrya (सूर्य): A solar deity who is one of the three main Vedic Gods.", 
            "link": "/wiki/Surya", 
            "name": "Sūrya"
        }, 
        {
            "def": "Susarma (सुसर्म): King of Trigarta, a supporter of the Kauravas who backed the proposal to invade Matsya, Virata's country.", 
            "link": "/w/index.php?title=Susarma&action=edit&redlink=1", 
            "name": "Susarma"
        }, 
        {
            "def": "Sushena (सुषेन): A monkey chief ; at siege of Lanka.", 
            "link": "/w/index.php?title=Sushena&action=edit&redlink=1", 
            "name": "Sushena"
        }, 
        {
            "def": "Sushruta Samhita (सुश्रुतसंहिता): Suśruta Saṃhitā is a Sanskrit redaction text on all of the major concepts of ayurvedic medicine with innovative chapters on surgery, attributed to Sushruta, likely a historical sage physician of 6th century BCE.", 
            "link": "/wiki/Sushruta_Samhita", 
            "name": "Sushruta Samhita"
        }, 
        {
            "def": "Sūtra (सूत्र): Sūtra refers to an aphorism or a collection of such aphorisms in the form of a book or text. 'Sutras' form a school of Vedic study, related to and somewhat later than the Upanishads.", 
            "link": "/wiki/Sutra", 
            "name": "Sūtra"
        }, 
        {
            "def": "Suvarna (सुवर्ण): A soldier on the Kaurava side.", 
            "link": "/w/index.php?title=Suvarna&action=edit&redlink=1", 
            "name": "Suvarna"
        }, 
        {
            "def": "Sri Rama (श्रीराम): Also knew as Rama, Ramachandra or Sri Rama. Hanumana tells Bhima how he was deeply thrilled when he happened to touch Rama's body. This king of Ayodhya was banished to the forest for fourteen years, killed Ravana the king of Lanka who abducted his wife, Sita.", 
            "link": "/wiki/Rama", 
            "name": "Sri Rama"
        }, 
        {
            "def": "Srinjayas (श्रीन्‍जय): Pandava supporters.", 
            "link": "/w/index.php?title=Srinjayas&action=edit&redlink=1", 
            "name": "Srinjayas"
        }, 
        {
            "def": "Srutayu (श्रुतायु), Astutayu (अस्‍तुतायु): Two brothers fighting on the Kaurava side attacked Arjuna but were killed.", 
            "link": "/w/index.php?title=Srutayu&action=edit&redlink=1", 
            "name": "Srutayu"
        }, 
        {
            "def": "Srutayudha (श्रुतायुद्घ): A Kaurava warrior whose mace hurled at Krishna rebounded fiercely, killing Srutayudha himself. Her mother Parnasa had obtained that gift from Varuna who had specified that the mace should not be used against one who does not fight, else it would kill the person who hurls it.", 
            "link": "/w/index.php?title=Srutayudha&action=edit&redlink=1", 
            "name": "Srutayudha"
        }, 
        {
            "def": "Swarga (स्‍वर्ग): An Olympian paradise, a place where all wishes and desires are gratfied, The heaven of Indra where mortals after death enjoy the results of their good deeds on earth.", 
            "link": "/wiki/Swarga", 
            "name": "Swarga"
        }, 
        {
            "def": "Sveta (स्‍वेत): A son of King Virata who fell in battle to Bhishma's arrow.", 
            "link": "/wiki/Sveta", 
            "name": "Sveta"
        }, 
        {
            "def": "Swayamvara (स्‍वयं‍वर): Meaning - Own-choice, Swayamvara, in ancient India, was a practice of choosing a life partner, among a list of suitors by a girl of marriageable age.", 
            "link": "/wiki/Swayamvara", 
            "name": "Swayamvara"
        }, 
        {
            "def": "Syala (स्याल): A Yadava prince who insulted the sage Gargya, and was the cause of his becoming the father of Kalayavana, a great foe of Krishna and the Yadava family.", 
            "link": "/wiki/Syala", 
            "name": "Syala"
        }, 
        {
            "def": "Tall (टल्‍ल): One of Ravana's counsellors", 
            "link": "/w/index.php?title=Tall_(Hinduism)&action=edit&redlink=1", 
            "name": "Tall"
        }, 
        {
            "def": "Tārā (तारा): See Tara (Devi)", 
            "link": null, 
            "name": "Tārā"
        }, 
        {
            "def": "Tāragam (तारगम): Tāragam is the name of forest, where dwelt ten thousand heretical rishis, who taught that the universe is eternal, that souls have no lord and that performance of works alone suffices for the attainment of salvation. Shiva taught them lesson and they became his followers. This legend is associated with Shiva's dance.", 
            "link": "/w/index.php?title=Taragam&action=edit&redlink=1", 
            "name": "Tāragam"
        }, 
        {
            "def": "Tāraka (तारक): A demon slain by Kumara, the first son of Shiva.", 
            "link": "/wiki/Tarakasur", 
            "name": "Tāraka"
        }, 
        {
            "def": "Tandava (ताण्‍डव): Siva's cosmic dance.", 
            "link": "/wiki/Tandava", 
            "name": "Tandava"
        }, 
        {
            "def": "Tantra (तंत्र): The esoteric Hindu traditions of rituals and yoga. Tantra can be summarised as a family of voluntary rituals modeled on those of the Vedas, together with their attendant texts and lineages.", 
            "link": "/wiki/Tantra", 
            "name": "Tantra"
        }, 
        {
            "def": "Tantripala: Assumed name of Sahadeva at Virata's court.", 
            "link": "/w/index.php?title=Tantripala&action=edit&redlink=1", 
            "name": "Tantripala"
        }, 
        {
            "def": "Tarpana or Tarpan (तर्पण ): Sacrament, a death rite, also performed during the Pitru Paksha.", 
            "link": "/wiki/Tarpana", 
            "name": "Tarpana"
        }, 
        {
            "def": "Tilottamā (तिलोत्तमा): Tilottama was an Apsaras. She is reputed to have been created by Vishwakarma from Tila seeds. She was responsible for bringing out the mutual destruction of the Asuras Sunda and Upasunda.", 
            "link": "/wiki/Tilottama", 
            "name": "Tilottamā"
        }, 
        {
            "def": "Tripura (त्रिपुरा): Tripura (meaning three cities, in Sanskrit) was constructed by the great architect Mayasura. They were great cities of prosperity, power and dominance over the world, but due to their impious nature, Maya's cities were destroyed by Lord Shiva.", 
            "link": "/wiki/Tripura_(mythology)", 
            "name": "Tripura"
        }, 
        {
            "def": "Trishira (त्रिसिर): Trishira that is, one having three heads, was an asura mentioned in the Ramayana. He was one of the seven sons of Ravana, and his other brothers were Indrajit, Prahasta, Atikaya, Akshayakumara, Devantaka and Narantaka.", 
            "link": "/wiki/Trishira", 
            "name": "Trishira"
        }, 
        {
            "def": "Tulsī Dās (तुलसीदास): Goswami Tulsidas (1532–1623) was a Hindu poet and philosopher, translator of the epics into vernacular. Tulsidas wrote twelve books and is considered the greatest and most famous of Hindi poets.", 
            "link": "/wiki/Tulsi_Das", 
            "name": "Tulsī Dās"
        }, 
        {
            "def": "Uchchaihshravas: Uchchaihsravas was the white horse of Indra, produced at the churning of the ocean. It is fed on ambrosia, and is held to be the king of horses.", 
            "link": "/wiki/Uchchaihshravas", 
            "name": "Uchchaihshravas"
        }, 
        {
            "def": "Udayana: Udayana was a prince of the Lunar race, and son of Sahasranika, who is the hero of a popular story. He was king of Vatsa, and is commonly called Vatsaraja. His capital was Kausambi. Also a name of Agastya.", 
            "link": "/wiki/Udayana", 
            "name": "Udayana"
        }, 
        {
            "def": "Uddalaka: A great sage and the teacher of Vedanta.", 
            "link": "/wiki/Uddalaka", 
            "name": "Uddalaka"
        }, 
        {
            "def": "Uddhava: The friend and counselor of Krishna. According to some he was Krishna 's cousin, being son of Devabhaga, the brother of Vasudeva. He was also called Pavanayadhi.", 
            "link": "/wiki/Uddhava", 
            "name": "Uddhava"
        }, 
        {
            "def": "Ugrasena (उग्रसेन): one-time King of Yadavas; deposed by his son Kams. His wife was Pavanrekha. Krishna killed Kams and established Ugrasena on throne.", 
            "link": "/wiki/Ugrasena", 
            "name": "Ugrasena"
        }, 
        {
            "def": "Ujjayini (उज्‍जयिनि) or Ujjain (उज्जैन): is an ancient city of central India, in the Malwa region of Madhya Pradesh near which the ancient throne of Vikramaditya was discovered, one of the seven sacred cities of the Hindus, where the Kumbh Mela is held every twelve years. It is also home to Mahakaleshwar Jyotirlinga, one of the twelve Jyotirlinga shrines to the god Shiva.", 
            "link": "/wiki/Ujjain", 
            "name": "UjjayiniUjjain"
        }, 
        {
            "def": "Ulūka (उलूक): 'An owl.' Son of Kitava. He was king of a country and people of the same name. He was an ally of the Kauravas, and acted as their envoy to the Pandavas.", 
            "link": "/wiki/Aulakh", 
            "name": "Ulūka"
        }, 
        {
            "def": "Ulūpī (उलूपी): A daughter of Kauravya, Raja of the Nagas, with whom Arjuna contracted a kind of marriage. She was nurse to her stepson, Babhruvahana, and had great influence over him. According to the Vishnu Purana she had a son named Iravat.", 
            "link": "/wiki/Ulupi", 
            "name": "Ulūpī"
        }, 
        {
            "def": "Umadevī (उमादेवी): Wife of Shiva.", 
            "link": "/wiki/Umadevi", 
            "name": "Umadevī"
        }, 
        {
            "def": "Unchhavritti (उन्‍छवृत्ती): The life of a mendicant, begging his food.", 
            "link": "/w/index.php?title=Unchhavritti&action=edit&redlink=1", 
            "name": "Unchhavritti"
        }, 
        {
            "def": "Upachitra (उपचित्र): One of King Dhritarashtra's sons who perished in the war.", 
            "link": "/w/index.php?title=Upachitra&action=edit&redlink=1", 
            "name": "Upachitra"
        }, 
        {
            "def": "Upanishad (उपनिषद्): Part of the Hindu Śruti scriptures which primarily discuss meditation and philosophy, seen as religious instructions by most schools of Hinduism.", 
            "link": "/wiki/Upanishad", 
            "name": "Upanishad"
        }, 
        {
            "def": "Upaplavya (उपप्‍लव्‍य): A place in Matsya Kingdom, where the Pandavas settled after their exile of thirteen years.", 
            "link": "/wiki/Upaplavya", 
            "name": "Upaplavya"
        }, 
        {
            "def": "Uparichara: A Vasu or demigod, who, according to the Mahabharata, became king of Chedi by command of Indra. He had five sons by his wife; and by an Apsaras, named Adrika, condemned to live on earth in the form of a fish, he had a son named Matsya (fish), and a daughter, Satyavati, who was the mother of Vyasa.", 
            "link": "/w/index.php?title=Uparichara&action=edit&redlink=1", 
            "name": "Uparichara"
        }, 
        {
            "def": "Upasunda (उपसुन्‍द): Sund and Upasunda were two brave and poerful asura princes who performed austerities to please Brahma,who besowed them the boon that nobody else would slay them, other than each other. Later Brahma created a beautiful apsara Tilottama to creat differences within and destroyed them.", 
            "link": "/wiki/Upasunda", 
            "name": "Upasunda"
        }, 
        {
            "def": "Urmilā (उर्मिला): Second daughter of Janaka; bestowed on Lakshmana.", 
            "link": "/wiki/Urmila_(Ramayana)", 
            "name": "Urmilā"
        }, 
        {
            "def": "Urvasī (उर्वसी): An apsara in Indra's court, whose amorous overtures Arjuna declined.", 
            "link": "/wiki/Urvasi", 
            "name": "Urvasī"
        }, 
        {
            "def": "Ushā (उषा): Wife of Aniruddha, daughter of Banasur.", 
            "link": "/wiki/Usha_(goddess)", 
            "name": "Ushā"
        }, 
        {
            "def": "Ushanas (उशना): Ushanas were appointed as priests of asuras, who knew the science of bringing to life.", 
            "link": "/wiki/Ushanas", 
            "name": "Ushanas"
        }, 
        {
            "def": "Uttanka (उत्‍तंक): Uttanka was a pupil of Veda, the third pupil of Dhaumya rishi. The other two pupils of Uttanka were Janamejaya and Poshya.", 
            "link": "/wiki/Uttanka", 
            "name": "Uttanka"
        }, 
        {
            "def": "Uttara (उत्तर): A son of the Raja of Virata. Uttara was killed in battle by Salya.", 
            "link": "/wiki/Uttara_(Mahabharata)", 
            "name": "Uttara"
        }, 
        {
            "def": "Uttarā (उत्तरा): A daughter of the Raja of Virata. She married Abhimanyu, son of Arjuna.", 
            "link": "/wiki/Uttar%C4%81_(Mahabharata)", 
            "name": "Uttarā"
        }, 
        {
            "def": "Uttar kānda (उत्तरकांड): The part of epic Ramayana added later to the work of Valmiki.", 
            "link": "/w/index.php?title=Uttar_kanda&action=edit&redlink=1", 
            "name": "Uttar kānda"
        }, 
        {
            "def": "Varaha (वराह): The third Avatar of the Hindu Godhead Vishnu, in the form of a Boar. He appeared in order to defeat Hiranyaksha, a demon who had taken the Earth (Prithvi) and carried it to the bottom of what is described as the cosmic ocean in the story.", 
            "link": "/wiki/Varaha", 
            "name": "Varaha"
        }, 
        {
            "def": "Vaiśampāyana (वैशंपायन): A celebrated sage who was the original teacher of the Black Yajur-Veda. He was a pupil of the great Vyasa, from whom he learned the Mahabharata, which he afterwards recited to King Janamejaya at a festival.", 
            "link": "/wiki/Vaisampayana", 
            "name": "Vaiśampāyana"
        }, 
        {
            "def": "Vaishnava (वैष्‍णव): A sacrifice performed by Duryodhana in the forest. Yayati, Mandhata, Bharata and others also performed it.", 
            "link": "/wiki/Vaishnava", 
            "name": "Vaishnava"
        }, 
        {
            "def": "Vaishnava mantra (वैष्‍णव मंत्र): An invocation which endows a missile with some of the irresistible power of Vishnu.", 
            "link": "/w/index.php?title=Vaishnava_mantra&action=edit&redlink=1", 
            "name": "Vaishnava mantra"
        }, 
        {
            "def": "Vaishnavism (वैष्णव धर्म): Vaishnavism is a tradition of Hinduism, distinguished from other schools by its worship of Vishnu or his associated avatars, principally as Rama and Krishna, as the original and supreme God.", 
            "link": "/wiki/Vaishnavism", 
            "name": "Vaishnavism"
        }, 
        {
            "def": "Vaishrāvan (वैश्रावण): Elder brother of Ravana to whom Rama returned Pushpaka after the death of Ravana.", 
            "link": "/wiki/Kubera", 
            "name": "Vaishrāvan"
        }, 
        {
            "def": "Vaishya (वैश्य): One of the four fundamental varnas (colours) in Hindu tradition comprising merchants, artisans, and landowners.", 
            "link": "/wiki/Vaishya", 
            "name": "Vaishya"
        }, 
        {
            "def": "Vaivasvata Manu (वैवस्वत मनु): Vaivasvata Manu (also Manu Vaivasvate) is one of the 14 Manus. He is considered the progenitor of the current Manvantara, which is the 7th of the 14 that make up the current Kalpa, each Kalpa making up a day of Brahma. He was born to Saranya and Vivasvat and was the King of Dravida during the epoch of the Matsya Purana.He was the founder of the Suryavansha race of kings.", 
            "link": "/wiki/Vaivasvata_Manu", 
            "name": "Vaivasvata Manu"
        }, 
        {
            "def": "Vajrahanu (वज्रहनु): One of Ravana's generals.", 
            "link": "/w/index.php?title=Vajrahanu&action=edit&redlink=1", 
            "name": "Vajrahanu"
        }, 
        {
            "def": "Vajrayudha (वज्रयुद्ध): The weapon with which Indra killed Visvarupa on suspicion because his mother belonged to the asura tribe of daityas.", 
            "link": "/wiki/Vajrayudha", 
            "name": "Vajrayudha"
        }, 
        {
            "def": "Valala (वलाल): Assumed name of Bhima when, he worked as a cook at Virata's court.", 
            "link": "/w/index.php?title=Valala&action=edit&redlink=1", 
            "name": "Valala"
        }, 
        {
            "def": "Vālī (वाली): One of five great monkeys in Ramayana, a son of Indra, Monkey-king of Kishkindha and the cruel elder brother of Sugriva. He was killed by Rama.", 
            "link": "/wiki/Vali_(Ramayana)", 
            "name": "Vālī"
        }, 
        {
            "def": "Vālmikī (वाल्मिकी): Maharishi Valmiki is the author of the Hindu epic Ramayana, a brahman by birth, connected with the kings of Ayodhya, contemporary of Rama who invented the shloka metre, who taught the Ramayana to Kusa and Lava.", 
            "link": "/wiki/Valmiki", 
            "name": "Vālmikī"
        }, 
        {
            "def": "Vāmadeva (वामदेव): Vamadeva is the name of the \"preserver\" aspect of the god Shiva, one of five aspects of the universe he embodies. Also one of Dasharatha's priest.", 
            "link": "/wiki/Vamadeva", 
            "name": "Vāmadeva"
        }, 
        {
            "def": "Vamana (वामन): The fifth Avatara of Vishnu. He is the first Avatar of Vishnu which had a completely human form, although it was that of a dwarf brahmin.", 
            "link": "/wiki/Vamana", 
            "name": "Vamana"
        }, 
        {
            "def": "Vanāsur (बाणासुर): Same as Banasur, was a thousand-armed asura, powerful and terrible. He was son of Bali. Bana was a follower of Siva. Banasura had a beautiful daughter named Usha.", 
            "link": "/wiki/Banasura", 
            "name": "Vanāsur"
        }, 
        {
            "def": "Vanaprastha (वानप्रस्‍थ): The third stage of the dvija's life, when he is required to relinquish worldly responsibilities to his heirs and retires to the woods with his wife for an anchorite's life. A person who is living in the forest as a hermit after giving up material desires.", 
            "link": "/wiki/Vanaprastha", 
            "name": "Vanaprastha"
        }, 
        {
            "def": "Vandi: Court poet of Mithila who on being defeated by Sage Ashtavakra in debate drowned himself in the ocean and went to the abode of Varuna.", 
            "link": "/wiki/Vandi", 
            "name": "Vandi"
        }, 
        {
            "def": "Vardhamana (वर्धमान): The northern gate of the Kuru capital Hastinapura.", 
            "link": "/wiki/Vardhamana", 
            "name": "Vardhamana"
        }, 
        {
            "def": "Varṇa (वर्ण): Means - colour, Varna refers to the four naturally existing classes of society as given in the Hindu scriptures: Brahmin, Kshatriya, Vaishya and Shudra.", 
            "link": "/wiki/Varna_(Hinduism)", 
            "name": "Varṇa"
        }, 
        {
            "def": "Vārṇāvata (वारणावत): One of the provinces asked by Pandavas. A forest in which the Pandavas were asked to stay in a wax-house which was to be set on fire at midnight in order to kill the Pandavas while they were asleep.", 
            "link": "/w/index.php?title=Varanavata&action=edit&redlink=1", 
            "name": "Vārṇāvata"
        }, 
        {
            "def": "Varṣṇeya: The charioteer of Rituparna, king of Ayodhya, who accompanied with Bahuka.", 
            "link": "/w/index.php?title=Varshneya&action=edit&redlink=1", 
            "name": "Varṣṇeya"
        }, 
        {
            "def": "Varuṇa (वरुण): A god of the sky, of rain and of the celestial ocean, as well as a god of law and of the underworld.", 
            "link": "/wiki/Varuna", 
            "name": "Varuṇa"
        }, 
        {
            "def": "Varuṇī (वरुणी): The goddess of wine.", 
            "link": "/wiki/Varuni", 
            "name": "Varuṇī"
        }, 
        {
            "def": "Vāsava (वासव): Name of arrow of death, given by Indra to Karna.", 
            "link": null, 
            "name": "Vāsava"
        }, 
        {
            "def": "Vashiṣtha (वशिष्‍ठ): Vasishtha was chief of the seven venerated sages (or Saptarishi) and the Rajaguru of the Suryavamsha. He was the manasaputra of Brahma. He had in his possession the divine cow Kamadhenu, and Nandini her child, who could grant anything to their owners. Arundhati was his wife.", 
            "link": "/wiki/Vasishtha", 
            "name": "Vashiṣtha"
        }, 
        {
            "def": "Vasudhana (वसुधन): Another warrior who perished in the battle on the Twelfth Day.", 
            "link": "/w/index.php?title=Vasudhana&action=edit&redlink=1", 
            "name": "Vasudhana"
        }, 
        {
            "def": "Vasudeva (वसुदेव): Descendant of Yadu, husband of Rohini and Devaki. An epithet of Krishna. It means both son of Vasudeva and the supreme spirit that pervades the universe.", 
            "link": "/wiki/Vasudeva", 
            "name": "Vasudeva"
        }, 
        {
            "def": "Vasuki: King of the Nagas or serpents who live in Patala. He was used by the gods and Asuras for a coil round the mountain Mandara at the churning of the ocean.", 
            "link": "/wiki/Vasuki", 
            "name": "Vasuki"
        }, 
        {
            "def": "Vatapi: Vatapi and Ilvala, two Rakshasas, sons either of Hrada or Viprachitti. They are mentioned in the Ramayana as dwelling in the Dandaka forest.", 
            "link": "/wiki/Vatapi", 
            "name": "Vatapi"
        }, 
        {
            "def": "Vayu (वायु): The god of air and wind who is also father of Bhima and Hanuman.", 
            "link": "/wiki/Vayu", 
            "name": "Vayu"
        }, 
        {
            "def": "Veda (वेद): Collectively refers to a corpus of ancient Indo-Aryan religious literature that are considered by adherents of Hinduism to be revealed knowledge. Many Hindus believe the Vedas existed since the beginning of creation.", 
            "link": "/wiki/Veda", 
            "name": "Veda"
        }, 
        {
            "def": "Veda Vyasa (वेद व्‍यास): Vyasa, author of the Mahabharata.", 
            "link": "/wiki/Veda_Vyasa", 
            "name": "Veda Vyasa"
        }, 
        {
            "def": "Vibhandaka: An ascetic who retired from the world and lived in the forest with his infant son Rishyasringa.", 
            "link": "/wiki/Vibhandaka", 
            "name": "Vibhandaka"
        }, 
        {
            "def": "Vibhīshaṇa (विभीषण): Vibhishana was a rakshasa, brother of Ravana. He was of a noble character and advised Ravana, who kidnapped and abducted Sita, to return her to Rama.", 
            "link": "/wiki/Vibhishana", 
            "name": "Vibhīshaṇa"
        }, 
        {
            "def": "Vichitravīrya (विचित्रवीर्य): Vichitravirya was Bhishma's half brother, the younger son of queen Satyavati and king Santanu. Chitrangada, the elder brother of Vichitravirya, succeeded Santanu to the throne of Hastinapura. When he died childless, Vichitravirya, became king. He had two sons, Dhritarashtra and Pandu.", 
            "link": "/wiki/Vichitravirya", 
            "name": "Vichitravīrya"
        }, 
        {
            "def": "Vidarbha: Birar, and probably including with it the adjoining district of Beder, which name is apparently a corruption of Vidarbha. The capital was Kundinapura, the modern \"Kundapur\", about forty miles east of Amravati.", 
            "link": "/wiki/Vidarbha", 
            "name": "Vidarbha"
        }, 
        {
            "def": "Vidura (विदुर): Vidura was a son of a maid-servant who served the Queens of Hastinapura, Queen Ambika and Ambalika. A friend of pandavas. After Krishna, he was the most trusted advisor to the Pandavas and had warned them repeatedly about Duryodhana's plots.", 
            "link": "/wiki/Vidura", 
            "name": "Vidura"
        }, 
        {
            "def": "Vijaya (विजय): Name of Karna's bow.", 
            "link": "/wiki/Vijaya_(bow)", 
            "name": "Vijaya"
        }, 
        {
            "def": "Vijayadashami (विजयादशमी):A festival celebrated on the tenth day of the bright fortnight (Shukla Paksha) of the Hindu autumn month of Ashvin.", 
            "link": "/wiki/Vijayadashami", 
            "name": "Vijayadashami"
        }, 
        {
            "def": "Vikarna (विकर्ण): A son of Dhritarashtra who declared the staking of Draupadi illegal, as Yudhishthira himself was a slave and had lost all his rights. Therefore, the Kauravas had not won Draupadi legally, he held", 
            "link": "/wiki/Vikarna", 
            "name": "Vikarna"
        }, 
        {
            "def": "Vikramaditya (विक्रमादित्य): Vikramāditya is the name of a legendary king of Ujjain, famed for his wisdom, valour and magnanimity. The title \"Vikramaditya\" has also been assumed by many kings in Indian history, notably the Gupta King Chandragupta II.", 
            "link": "/wiki/Vikramaditya", 
            "name": "Vikramaditya"
        }, 
        {
            "def": "Vikukshi: A king of the Solar race, who succeeded his father, Ikshwaku. He received the name of Sasada, 'hare-eater.' He was sent by his father to hunt and obtain flesh suitable for offerings. Being weary and hungry he ate a hare, and Vasishtha, the priest, declared that this act had defiled all the food, for what remained was but his leavings.", 
            "link": "/w/index.php?title=Vikukshi&action=edit&redlink=1", 
            "name": "Vikukshi"
        }, 
        {
            "def": "Vinda (विन्‍द), Anuvinda (अनुविन्‍द): Two brothers kings of Avanti, great soldiers whom were on the Kaurava side, they suffered defeat at the hands of Yudhamanyu.", 
            "link": null, 
            "name": "Vinda"
        }, 
        {
            "def": "Vindhyas (विन्‍ध्य): Vindhyas is a range of hills in central India, which geographically separates the Indian subcontinent into northern India (the Indo-Gangetic plain) and Southern India.", 
            "link": "/wiki/Vindhyas", 
            "name": "Vindhyas"
        }, 
        {
            "def": "Virāta (विराट): King of Matsya, the country which was suggested by Bhima to live in incognito during the thirteenth year of their exile.", 
            "link": "/wiki/Virata", 
            "name": "Virāta"
        }, 
        {
            "def": "Vīrabhadra (वीरभद्र): Vīrabhadra was a demon that sprang from Shiva's lock of hair. Shiva burnt with anger when not invited in a sacrifice by Daksha and his wife Sati released the inward consuming fire and fell dead at Daksha's feet. Shiva burned with anger, and tore from his head a lock of hair, glowing with energy, and cast upon the earth. The terrible demon Vīrabhadra sprang from it. On the direction of Shiva, Virabhadra appeared with Shiva's ganas in the midst of Daksha's assembly like a storm wind and broke the sacrificial vessels, polluted the offerings, insulted the priests and finally cut off Daksha's head.", 
            "link": "/wiki/Virabhadra", 
            "name": "Vīrabhadra"
        }, 
        {
            "def": "Virādha (विराध): A fierce rakshasa who seizes Sita.", 
            "link": "/wiki/Viradha", 
            "name": "Virādha"
        }, 
        {
            "def": "Vīrasen: Father of Raja Nala, king of Nishadha.", 
            "link": "/w/index.php?title=Virasen&action=edit&redlink=1", 
            "name": "Vīrasen"
        }, 
        {
            "def": "Virochana (विरोचन): An asura, son of Prahlada, and father of Bali. He is also called Drisana. When the earth was milked, Virochana acted as the calf of the Asuras.", 
            "link": "/wiki/Virochana", 
            "name": "Virochana"
        }, 
        {
            "def": "Vishnu (विष्‍णु): A form of God, to whom many Hindus pray. For Vaishnavas, He is the only Ultimate Reality or God. In Trimurti belief, He is the second aspect of God in the Trimurti (also called the Hindu Trinity), along with Brahma and Shiva. Known as the Preserver, He is most famously identified with His Avatars, especially Krishna and Rama.", 
            "link": "/wiki/Vishnu", 
            "name": "Vishnu"
        }, 
        {
            "def": "Vishvakarmā (विश्वकर्मा): Vishwakarma is the presiding deity of all craftsmen and architects. he is the divine craftsman of the whole universe, and the official builder of all the gods' palaces. Vishwakarma is also the designer of all the flying chariots of the gods, and all their weapons.", 
            "link": "/wiki/Vishvakarma", 
            "name": "Vishvakarmā"
        }, 
        {
            "def": "Viśvamitra (विश्‍वामित्र): Brahmarishi Visvamitra or Vishvamitra was one of the most venerated rishi or sages of since ancient times in India. He was originally a Kshatriya but by austerities earned the title of Brahmarishi. He is also credited as the author of most of Mandala 3 of the Rigveda, including the Gayatri Mantra.", 
            "link": "/wiki/Vishvamitra", 
            "name": "Viśvamitra"
        }, 
        {
            "def": "Visoka (विसोक): Bhima's charioteer.", 
            "link": "/wiki/Visoka", 
            "name": "Visoka"
        }, 
        {
            "def": "Visvarupa (विस्‍वरुप): Name of Twashta's son who became the preceptor of the gods, Brihaspati having left when insulted by Indra.", 
            "link": "/w/index.php?title=Visvarupa&action=edit&redlink=1", 
            "name": "Visvarupa"
        }, 
        {
            "def": "Vivimsati (विविस्‍मति): A Kaurava hero and Duryodhana's brother.", 
            "link": "/w/index.php?title=Vivimsati&action=edit&redlink=1", 
            "name": "Vivimsati"
        }, 
        {
            "def": "Viswarupa (विस्‍वरुप): All-pervading, all-including form. See the description in the Bhagavad Gita chapter eleven.", 
            "link": "/w/index.php?title=Viswarupa&action=edit&redlink=1", 
            "name": "Viswarupa"
        }, 
        {
            "def": "Vriddhakshatra (वृद्घक्षत्र): King of the Sindhus, father of Jayadratha into whose lap his son Jayadratha's head was caused to fall by Arjuna after cutting off Jayadratha's head.", 
            "link": "/w/index.php?title=Vriddhakshatra&action=edit&redlink=1", 
            "name": "Vriddhakshatra"
        }, 
        {
            "def": "Vrika (वृक): A Panchala prince who fell in battle.", 
            "link": "/w/index.php?title=Vrika&action=edit&redlink=1", 
            "name": "Vrika"
        }, 
        {
            "def": "Vrikasthala (वृकस्थल): One of the provinces asked by Pandavas. This province and town were situated in the southern part of Kuru Kingdom (Kuru Proper + Kurujangala). Krishna visited the town of Vrikasthala (in Gurgaon district of Hariyana) and camped there for onee night (5,84).", 
            "link": "/w/index.php?title=Vrikasthala&action=edit&redlink=1", 
            "name": "Vrikasthala"
        }, 
        {
            "def": "Vrindavana: A wood in the district of Mathura where Krishna passed his youth, under the name of Gopala, among the cowherds.", 
            "link": "/wiki/Vrindavana", 
            "name": "Vrindavana"
        }, 
        {
            "def": "Vrisha (वृष), Achala(अचल): Sakuni's brothers.", 
            "link": "/w/index.php?title=Vrisha&action=edit&redlink=1", 
            "name": "Vrisha"
        }, 
        {
            "def": "Vrishdarbha (वृषदर्भ): A king of Benares, associated with the story of \"The king, the Pigeon, and Hawk\".", 
            "link": "/w/index.php?title=Vrishdarbha&action=edit&redlink=1", 
            "name": "Vrishdarbha"
        }, 
        {
            "def": "Vrishni (वृषणि): A descendent of Yadu, and the ancestor from whom Krsna got the name Varshneya", 
            "link": "/wiki/Vrishni", 
            "name": "Vrishni"
        }, 
        {
            "def": "Vrishnis, (वृषणि): The descendant of Vrishni, son of Madhu, whose ancestor was the eldest son of Yadu. Krsna belonged to this branch of the Lunar race. The people of Dwaraka were known as the Vrishnis. Tribals of this race were devoted to the Pandavas, who with Sri Krishna visited the Pandavas in their exile.", 
            "link": "/w/index.php?title=Vrishnis&action=edit&redlink=1", 
            "name": "Vrishnis"
        }, 
        {
            "def": "Vrishasena (वृषसेन): Son of Karna, A warrior on the Kaurava side, slain by Arjuna.", 
            "link": "/wiki/Vrishasena", 
            "name": "Vrishasena"
        }, 
        {
            "def": "Vritra (वृत्र): Means \"the enveloper\". Vritra, was an Asura and also a serpent or dragon, the personification of drought and enemy of Indra. Vritra was also known in the Vedas as Ahi (\"snake\"), cognate with Azhi Dahaka of Zoroastrian mythology and he is said to have had three heads. He was son of Twashta who was defeated by Indra's weapons Vajrayudha. He was born out of his father's sacrificial flames and became Indra's mortal enemy.", 
            "link": "/wiki/Vritra", 
            "name": "Vritra"
        }, 
        {
            "def": "Vrikodara (वृकोदर): Wolf-bellied, an epithet of Bhima, denoting his slimness of waist and insatiable hunger.", 
            "link": "/w/index.php?title=Vrikodara&action=edit&redlink=1", 
            "name": "Vrikodara"
        }, 
        {
            "def": "Vyasa (व्‍यास): Compiler of the Vedas, son of sage Parasara.", 
            "link": "/wiki/Vyasa", 
            "name": "Vyasa"
        }, 
        {
            "def": "Vyuha (व्‍युह): Battle arrays.", 
            "link": "/wiki/Vyuha", 
            "name": "Vyuha"
        }, 
        {
            "def": "Yādavas (यादव): The descendants of Yadu, who dwelt by the Yamuna river.", 
            "link": "/wiki/Yadu", 
            "name": "Yādavas"
        }, 
        {
            "def": "Yadu (यदु): A prince of the lunar dynasty; Yadu is the name of one of the five Aryan clans mentioned in the Rig Veda. His descendants are called Yadavas. The epic Mahabharata and Puranas refer to Yadu as the eldest son of mythological king Yayati.", 
            "link": "/wiki/Yadu", 
            "name": "Yadu"
        }, 
        {
            "def": "Yaduvamsis: Those of the clan of Yadu.", 
            "link": "/w/index.php?title=Yaduvamsis&action=edit&redlink=1", 
            "name": "Yaduvamsis"
        }, 
        {
            "def": "Yajnignna (यज्ञ): A Vedic ritual of sacrifice performed to please the Devas, or sometimes to the Supreme Spirit Brahman. Often it involves a fire, which represents the god Agni, in the centre of the stage and items are offered into the fire.", 
            "link": "/w/index.php?title=Yajnignna&action=edit&redlink=1", 
            "name": "Yajnignna"
        }, 
        {
            "def": "Yakṣa (यक्ष): Yaksha or Yakkha (Pāli) is the name of a broad class of nature-spirits or minor deities who appear in Hindu and Buddhist mythology. The feminine form of the word is yakṣī or yakṣiṇī (Pāli: yakkhī or yakkhinī). subjects of Kubera, the god of wealth.", 
            "link": "/wiki/Yaksha", 
            "name": "Yakṣa"
        }, 
        {
            "def": "Yama (यम): Yama, also known as Yamarāja (यमराज) is the lord of death, first recorded in the Vedas. God of dharma, whose son was Yudhishthira. It is he whose questions Yudhishthira answered correctly whereupon his dead brothers were brought back to life on the banks of the enchanted pool.", 
            "link": "/wiki/Yama", 
            "name": "Yama"
        }, 
        {
            "def": "Yamas: A yama (Sanskrit), literally translates as a \"restraint\", a rule or code of conduct for living virtuously.", 
            "link": "/wiki/Yamas", 
            "name": "Yamas"
        }, 
        {
            "def": "Yamuna (जमुना): A river (also spelled Jamuna), joining with the Ganges. Literally meaning \"twins\" in Sanskrit, as it runs parallel to the Ganges, its name is mentioned at many places in the Rig Veda, written during the Vedic period ca between 1700–1100 BCE, and also in the later Atharvaveda, and the Brahmanas including Aitareya Brahmana and Shatapatha Brahmana.", 
            "link": "/wiki/Yamuna", 
            "name": "Yamuna"
        }, 
        {
            "def": "Yashodā (यशोदा): Yasodā was wife of Nanda and foster-mother of, Krishna, who was given to them by Vasudeva. Yasoda also played an important role in the upbrinding of Balarama and his sister Subhadra. She is also sometimes described as having her own daughter, known as Ekānaṅgā.", 
            "link": "/wiki/Yasoda", 
            "name": "Yashodā"
        }, 
        {
            "def": "Yavakrida: Son of Sage Bharadwaja who was bent upon mastering the Vedas.", 
            "link": "/w/index.php?title=Yavakrida&action=edit&redlink=1", 
            "name": "Yavakrida"
        }, 
        {
            "def": "Yayati (ययाति): Emperor of the Bharata race who rescued Devayani from the well into which she had been thrown by Sharmishtha. He later married both Devayani and Sarmishtha. One of the ancestors of the Pandavas who became prematurely old due to Sukracharya's curse.", 
            "link": "/wiki/Yayati", 
            "name": "Yayati"
        }, 
        {
            "def": "Yoga (योग): Spiritual practices performed primarily as a means to enlightenment (or bodhi). Traditionally, Karma Yoga, Bhakti Yoga, Jnana Yoga, and Raja Yoga are considered the four main yogas. In the West, yoga has become associated with the asanas (postures) of Hatha Yoga, popular as fitness exercises.", 
            "link": "/wiki/Yoga", 
            "name": "Yoga"
        }, 
        {
            "def": "Yoga Sutra (योग सूत्र): One of the six darshanas of Hindu or Vedic schools and, alongside the Bhagavad Gita and Hatha Yoga Pradipika, are a milestone in the history of Yoga.", 
            "link": "/wiki/Yoga_Sutra", 
            "name": "Yoga Sutra"
        }, 
        {
            "def": "Yogi (योगी): One who practices yoga, These designations are mostly reserved for advanced practitioners. The word \"yoga\" itself—from the Sanskrit root yuj (\"to yoke\") --is generally translated as \"union\" or \"integration\" and may be understood as union with the Divine, or integration of body, mind, and spirit.", 
            "link": "/wiki/Yogi", 
            "name": "Yogi"
        }, 
        {
            "def": "Yudhāmanyu (युधामन्यु): A Panchala prince supporting the Pandavas, who was assigned the task of protecting the wheels of Arjuna's chariot along with Uttamauja. He was slain in his sleep by Ashvatthama.", 
            "link": "/w/index.php?title=Yudhamanyu&action=edit&redlink=1", 
            "name": "Yudhāmanyu"
        }, 
        {
            "def": "Yudhishthira (युधिष्ठिर): Yudhishthira was the eldest son of King Pandu and Queen Kunti, king of Hastinapura and Indraprastha, and World Emperor. He was the principal protagonist of the Kurukshetra War, and for his unblemished piety, known as Dharmaraja.", 
            "link": "/wiki/Yudhishthira", 
            "name": "Yudhishthira"
        }, 
        {
            "def": "Yuga (युग): In Hindu philosophy (and in the teachings of Surat Shabd Yoga) the cycle of creation is divided into four yugas (ages or eras).", 
            "link": "/wiki/Yuga", 
            "name": "Yuga"
        }, 
        {
            "def": "Yuga Dharma (युगधर्म): One aspect of Dharma, as understood by Hindus. Yuga dharma is an aspect of dharma that is valid for a Yuga,. The other aspect of dharma is Sanatan Dharma, dharma which is valid for eternity.", 
            "link": "/wiki/Yuga_Dharma", 
            "name": "Yuga Dharma"
        }, 
        {
            "def": "Yuyudhāna (युयुधान): Another name of Satyaki, who was not killed in the warfare but in a mutual fight among Yadavas.", 
            "link": "/wiki/Yuyudhana", 
            "name": "Yuyudhāna"
        }, 
        {
            "def": "Yuyutsu (युयुत्सू): A noble son of Dhritarashtra who bent his head in shame and sorrow when Yudhishthira lost Draupadi. He also disapproved of the unfair way in which Abhimanyu was killed.", 
            "link": "/wiki/Yuyutsu", 
            "name": "Yuyutsu"
        }
    ]
}