{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_figure_skating_terms", 
    "words": [
        {
            "def": "A one-foot turn with a change of edge that results in a '3' shaped tracing on the ice.", 
            "link": "/wiki/3_turn", 
            "name": "3 turn"
        }, 
        {
            "def": "An abbreviation for the Four Continents Figure Skating Championships", 
            "link": null, 
            "name": "4CC"
        }, 
        {
            "def": "A scoring system used in which skaters were scored relative to each other. The lowest score was a 0.0 and the highest was a 6.0.", 
            "link": "/wiki/6.0_system", 
            "name": "6.0 scoring system"
        }, 
        {
            "def": "The standard abbreviation for the Axel jump.", 
            "link": null, 
            "name": "A"
        }, 
        {
            "def": "Either \"old enough\" or \"young enough\" to compete internationally at a certain level. Skaters who have turned 13 but not yet 19 (21 for the man in pairs and ice dancing) before the July 1 when a new season begins are eligible to compete in junior-level events for the whole season. Skaters who have turned 15 prior to that date in their place of birth are age-eligible for senior-level events. The overlap in age eligibility allows for some Senior-age-eligible skaters to compete at Junior-level events, and vice versa.", 
            "link": null, 
            "name": "Age-eligible"
        }, 
        {
            "def": "A leg position in which the free leg is lifted behind the body with the knee bent at an angle and is held behind at a 90-degree angle to the skating foot. This is the leg position often used for the Layback spin.", 
            "link": null, 
            "name": "Attitude"
        }, 
        {
            "def": "A leg position in which the free leg is extended behind the body in a straight line. This is the leg position used for the basic camel spin.", 
            "link": null, 
            "name": "Arabesque"
        }, 
        {
            "def": "The only jump counted as a jump element that starts from skating forward. An axel jump has an extra half rotation (180 degrees), and as all jumps is landed with the skater gliding backwards. It was named after Axel Paulsen.", 
            "link": "/wiki/Axel_jump", 
            "name": "Axel jump (A)"
        }, 
        {
            "def": "A reverse somersault in the air. They are banned in competition, but play a role in show skating and exhibitions.", 
            "link": "/wiki/Backflip_(acrobatic)", 
            "name": "Backflip"
        }, 
        {
            "def": "A spin performed on a back outside edge.", 
            "link": null, 
            "name": "Backspin"
        }, 
        {
            "def": "a spread-eagle like move where the skater glides on two outside edges with knees bent. It is named after Natalia Bestemianova.", 
            "link": "/wiki/Besti_squat", 
            "name": "Besti squat"
        }, 
        {
            "def": "Backward inside death spiral.", 
            "link": null, 
            "name": "BiDs"
        }, 
        {
            "def": "A catch-foot position where the free leg is pulled above the head from behind. Can be either a spin or a spiral position. By regulation, a spin becomes a Biellmann at the moment the skate passes over the level of the head. It is named after Denise Biellmann, who popularized the position but did not invent it.", 
            "link": "/wiki/Biellmann", 
            "name": "Biellmann spin"
        }, 
        {
            "def": "The vertical barrier between the ice and the ground at the point where the ice ends. In non-Olympic competitions, they are usually covered with advertisements for the sponsors. At the Olympics, they are usually covered by designs or the Olympic logo.", 
            "link": null, 
            "name": "Boards"
        }, 
        {
            "def": "Backward outside death spiral.", 
            "link": null, 
            "name": "BoDs"
        }, 
        {
            "def": "A one-foot turn with a change of edge that results in a '}' shape traced on the ice.", 
            "link": "/wiki/Bracket_turn", 
            "name": "Bracket turn"
        }, 
        {
            "def": "A flying spin with a two-foot takeoff. The body goes almost parallel to the ice in the air, with a scissoring leg motion.", 
            "link": "/wiki/Figure_skating_spins", 
            "name": "Butterfly jump"
        }, 
        {
            "def": "Permission to compete in the a higher level of competition without having competed in the requisite qualifying competition.", 
            "link": null, 
            "name": "Bye"
        }, 
        {
            "def": "A scoring abbreviation for the compulsory dance in an ice dancing competition.", 
            "link": null, 
            "name": "CD"
        }, 
        {
            "def": "Abbreviation for Code of Points", 
            "link": null, 
            "name": "COP"
        }, 
        {
            "def": "A spin position during which the free leg is extended in the air in an arabesque position parallel to the ice.", 
            "link": "/wiki/Camel_spin", 
            "name": "Camel spin"
        }, 
        {
            "def": "An element in which the knees are bent and the back is bent backwards, parallel to the ice. The element can be performed with the hands on the ice or with them extended in the air.", 
            "link": "/wiki/Cantilever_(figure_skating)", 
            "name": "Cantilever"
        }, 
        {
            "def": "A lift without rotation.", 
            "link": null, 
            "name": "Carry lift"
        }, 
        {
            "def": "A spin or spiral position in which the free leg is held by one or both hands. The most notable catch-foot position is the Biellmann.", 
            "link": null, 
            "name": "Catch-foot"
        }, 
        {
            "def": "A spin that stays in one spot on the ice. The opposite of traveling.", 
            "link": null, 
            "name": "Centered"
        }, 
        {
            "def": "When a medal-winning or otherwise noteworthy program is not shown on television. This term is named after Michael Chack, whose bronze medal winning performance at the U.S. Championships was not aired on television.", 
            "link": null, 
            "name": "Chack, Chacked, Chacking"
        }, 
        {
            "def": "A spin that changes position from a back inside edge (forward spin) on one foot to a back outside edge (backspin) on the other foot (or vice versa), while retaining the same rotational direction.", 
            "link": null, 
            "name": "Change-foot spin"
        }, 
        {
            "def": "An ice dancing step that can be a simple chasse, a crossed chasse, or a slide chasse.", 
            "link": null, 
            "name": "Chasse"
        }, 
        {
            "def": "Stopping the rotation of a jump or a spin.", 
            "link": null, 
            "name": "Check"
        }, 
        {
            "def": "Another name for the toe-loop jump.", 
            "link": null, 
            "name": "Cherry-flip"
        }, 
        {
            "def": "A jump that was not fully rotated in midair, with either the first rotation starting on the ice or the final rotation finishing after the landing.", 
            "link": null, 
            "name": "Cheated"
        }, 
        {
            "def": "A two-foot turn with a change of edge that results in a change of lobe.", 
            "link": "/wiki/Choctaw_turn", 
            "name": "Choctaw turn"
        }, 
        {
            "def": "A spiral position in which the torso is bent down towards the skating leg, with the free leg held in a 180 degree vertical split position. Also known as a candlestick spiral.", 
            "link": "/wiki/Charlotte_spiral", 
            "name": "Charlotte spiral"
        }, 
        {
            "def": "An informal name for the ISU Judging System.", 
            "link": null, 
            "name": "Code of Points"
        }, 
        {
            "def": "Two or more elements (jumps, spin positions) performed in succession.", 
            "link": null, 
            "name": "Combination"
        }, 
        {
            "def": "A lift combining two short lifts.", 
            "link": null, 
            "name": "Combination lift"
        }, 
        {
            "def": "Formerly the first of the three programs in ice dance. All teams perform the same dance to the standard music. In 2010, the ISU eliminated the compulsory and original dances and merged them into what is now the short dance. The compulsory portion is now officially known as the pattern dance.", 
            "link": "/wiki/Compulsory_dance", 
            "name": "Compulsory dance"
        }, 
        {
            "def": "Specific patterns traced in the ice by a skater's blade. While originally a major part of a skating competition, figures were removed entirely from international competition in 1990.", 
            "link": "/wiki/Compulsory_figures", 
            "name": "Compulsory figures"
        }, 
        {
            "def": "A one-foot turn on the same edge but results in a change of lobe with the rotation outside the original lobe.", 
            "link": "/wiki/Counter_turn", 
            "name": "Counter turn"
        }, 
        {
            "def": "In ice dancing, a step that is begun with the feet crossed, the legs crossing above the knee, so the motion is begun by the outside edge of the free foot.", 
            "link": null, 
            "name": "Cross stroke"
        }, 
        {
            "def": "In ice dancing, a series of two edges across two steps (such as inside and outside). On the second step, the free foot crosses the skating foot and is placed on the ice beside the skating foot.", 
            "link": null, 
            "name": "Crossed chasse"
        }, 
        {
            "def": "In ice dancing, a step that is begun with the free foot in the air. It is then crossed below the knee to the opposite side of the skating foot, so that the free foot touches down on the ice on the outside edge of the skating foot. The leg is crossed behind.", 
            "link": null, 
            "name": "Crossed step behind"
        }, 
        {
            "def": "In ice dancing, a step that is begun with the free foot in the air. It is then crossed below the knee to the opposite side of the skating foot, so that the free foot touches down on the ice on the outside edge of the skating foot. The leg is crossed in front.", 
            "link": null, 
            "name": "Crossed step forward"
        }, 
        {
            "def": "Crossing one foot over the other as a way of gaining speed and turning corners.", 
            "link": "/wiki/Crossover_(figure_skating)", 
            "name": "Crossovers"
        }, 
        {
            "def": "A two-foot skating move in which the skater's legs are both bent at least 90 degrees.", 
            "link": null, 
            "name": "Crouch"
        }, 
        {
            "def": "A type of dance lift in which the lifter moves along a curve across the ice. The lift may be performed on one foot or two.", 
            "link": null, 
            "name": "Curve lift"
        }, 
        {
            "def": "See ice dancing.", 
            "link": null, 
            "name": "Dance"
        }, 
        {
            "def": "In ice dancing, a small jump used to change foot or direction. The jump is performed by both partners while in hold or while very close together.", 
            "link": null, 
            "name": "Dance jump"
        }, 
        {
            "def": "Type of lift where the lifter may not raise his arms above his shoulders.", 
            "link": null, 
            "name": "Dance lift"
        }, 
        {
            "def": "A spin performed in ice dancing by both partners while in hold. It is similar to a pair spin.", 
            "link": null, 
            "name": "Dance spin"
        }, 
        {
            "def": "A type of flying entry into a spin.", 
            "link": null, 
            "name": "Death drop"
        }, 
        {
            "def": "An element in pair skating in which the woman skates on a deep edge with her body close to the ice and skates in a circle around the man, who is in a low pivot position and holding her by the arm.", 
            "link": "/wiki/Death_spiral_(figure_skating)", 
            "name": "Death spiral"
        }, 
        {
            "def": "A part of skating governed by unique rules. Currently, the four disciplines that compete at the Olympic Games are men's singles, ladies singles, pair skating, and ice dancing.", 
            "link": null, 
            "name": "Discipline"
        }, 
        {
            "def": "A jump with two full rotations (720 degrees) in the air (two and a half rotations for double Axel).", 
            "link": null, 
            "name": "Double"
        }, 
        {
            "def": "A jump or throw jump where the element is missing a half rotation or more.", 
            "link": null, 
            "name": "Downgraded"
        }, 
        {
            "def": "The act of choosing the starting order before the event. May be either open (public) or closed (private).", 
            "link": null, 
            "name": "Draw"
        }, 
        {
            "def": "Refers to performing a jump on the wrong edge.", 
            "link": null, 
            "name": "Edge violation"
        }, 
        {
            "def": "An identifiable component of a program. Includes spins, spirals, jumps, footwork, lifts, etc.", 
            "link": null, 
            "name": "Element"
        }, 
        {
            "def": "Skaters who earn money only from ISU-approved competitions and exhibitions. Only eligible skaters may compete in the Olympic Games.", 
            "link": null, 
            "name": "Eligible"
        }, 
        {
            "def": "May refer either to part of the skate blade, or the result of skating on that part. May be either inside (towards the body) or outside (away from the body), and forward or backward, for a total for four different edges. A \"deep edge\" is a deep lean on the edge of the skate. Deep edges are rewarded, while skating on a \"flat\" (on both edges at the same time) is discouraged.", 
            "link": null, 
            "name": "Edge"
        }, 
        {
            "def": "A general term to refer to any of the three jumps that take off from an edge.", 
            "link": null, 
            "name": "Edge jump"
        }, 
        {
            "def": "An ISU Championship for skaters from European countries.", 
            "link": "/wiki/European_Figure_Skating_Championships", 
            "name": "European Figure Skating Championships"
        }, 
        {
            "def": "An informal name for the European Figure Skating Championships.", 
            "link": null, 
            "name": "Europeans"
        }, 
        {
            "def": "Non-competition skating or a show. Exhibitions often feature elements banned in competition as well as spotlights and show lighting. Also: the gala after a competition in which the highest placing skaters perform a show program.", 
            "link": null, 
            "name": "Exhibition"
        }, 
        {
            "def": "The way a body part is held in a stretched position.", 
            "link": null, 
            "name": "Extension"
        }, 
        {
            "def": "The standard abbreviation for the flip jump.", 
            "link": null, 
            "name": "F"
        }, 
        {
            "def": "A scoring abbreviation for the free dance in an ice dancing competition.", 
            "link": null, 
            "name": "FD"
        }, 
        {
            "def": "The scoring abbreviation for the free skating in a singles and pairs competition.", 
            "link": null, 
            "name": "FS"
        }, 
        {
            "def": "A spiral position in which the free leg is lifted, held upwards in front of the body, and lowered, in the style of an opening and closing Japanese fan.", 
            "link": null, 
            "name": "Fan spiral"
        }, 
        {
            "def": "Forward inside death spiral.", 
            "link": null, 
            "name": "FiDs"
        }, 
        {
            "def": "See compulsory figures.", 
            "link": null, 
            "name": "Figures"
        }, 
        {
            "def": "Skating on both edges at the same time. In general, it is less desirable than skating on one edge.", 
            "link": null, 
            "name": "Flat"
        }, 
        {
            "def": "A grouping of skaters at a competition who warm up together immediately prior to competing. The final flight of the free skating in single skating is made up of the highest-scoring six skaters from the short program.", 
            "link": null, 
            "name": "Flight"
        }, 
        {
            "def": "A toe-assisted figure skating jump that takes off from the back inside edge.", 
            "link": "/wiki/Flip_jump", 
            "name": "Flip jump (F)"
        }, 
        {
            "def": "Resurface the ice.", 
            "link": null, 
            "name": "Flood (v.)"
        }, 
        {
            "def": "A portmanteau of \"flip\" and \"Lutz\", for an improperly executed lutz jump, where the outside take-off edge is mistakenly changed to an inside edge, making it a flip jump.", 
            "link": null, 
            "name": "Flutz"
        }, 
        {
            "def": "A jump that lands in a spinning position. Commonly performed flying spins include flying camel spins and flying sit spins.", 
            "link": null, 
            "name": "Flying spin"
        }, 
        {
            "def": "Forward outside death spiral.", 
            "link": null, 
            "name": "FoDs"
        }, 
        {
            "def": "A spin performed on a back inside edge.", 
            "link": null, 
            "name": "Forward spin"
        }, 
        {
            "def": "Formerly the third and final program in an ice dance competition. As of 2010, the free dance is the second and final program in an ice dance competition.", 
            "link": "/wiki/Free_dance_(figure_skating)", 
            "name": "Free dance"
        }, 
        {
            "def": "The leg that is not on the ice.", 
            "link": null, 
            "name": "Free leg"
        }, 
        {
            "def": "Originally a term for the part of the skating competition that was not compulsory figures. Now the official name of the long program. Also: free skate/free program.", 
            "link": "/wiki/Free_skating", 
            "name": "Free skating (FS)"
        }, 
        {
            "def": "An ISU Championship for skaters from non-European countries.", 
            "link": "/wiki/Four_Continents_Figure_Skating_Championships", 
            "name": "Four Continents Figure Skating Championships"
        }, 
        {
            "def": "A sequence of edges, turns, and hops. Often a required element.", 
            "link": null, 
            "name": "Footwork sequence"
        }, 
        {
            "def": "An abbreviation for a Grand Prix event.", 
            "link": null, 
            "name": "GP"
        }, 
        {
            "def": "An abbreviation for the Grand Prix of Figure Skating Final", 
            "link": null, 
            "name": "GPF"
        }, 
        {
            "def": "An abbreviation for Grade Of Execution.", 
            "link": null, 
            "name": "GOE"
        }, 
        {
            "def": "In addition to referring to the winner of a particular figure skating competition, all skaters who have passed the USFSA's highest-level skill tests are called \"gold medalists\"; the latter usage is especially common on coaches' resumes.", 
            "link": null, 
            "name": "Gold medalist"
        }, 
        {
            "def": "A part of the ISU Judging System.", 
            "link": null, 
            "name": "Grade Of Execution"
        }, 
        {
            "def": "Figures performed on two feet.", 
            "link": null, 
            "name": "Grapevines"
        }, 
        {
            "def": "A series of six international invitational events that build to the Grand Prix Final.", 
            "link": "/wiki/ISU_Grand_Prix_of_Figure_Skating", 
            "name": "Grand Prix"
        }, 
        {
            "def": "A catch-foot layback spin where the free leg is brought up to head level, but not above. In some cases, the head is dropped back and it appears that the skate blade is in a position to cut the hair of the skater performing the spin. This position is often performed as a segue between a layback spin and a Biellmann spin.", 
            "link": null, 
            "name": "Haircutter"
        }, 
        {
            "def": "The groove in the middle of a blade between the inside and outside edges.", 
            "link": null, 
            "name": "Hollow"
        }, 
        {
            "def": "A small jump that does not include a rotation.", 
            "link": null, 
            "name": "Hop"
        }, 
        {
            "def": "A move in which a skater glides on a deep edge with the body stretched in a very low position, almost horizontal to the ice. Several variations in position are possible.", 
            "link": null, 
            "name": "Hydroblading"
        }, 
        {
            "def": "Use of the ice surface. Skaters who cover more ice while gliding or executing an element are said to have greater ice coverage.", 
            "link": null, 
            "name": "Ice coverage"
        }, 
        {
            "def": "The skating discipline in which two skaters perform a choreographed dance.", 
            "link": "/wiki/Ice_dancing", 
            "name": "Ice dancing"
        }, 
        {
            "def": "An abbreviated term for the ISU Judging System", 
            "link": null, 
            "name": "IJS"
        }, 
        {
            "def": "A two-footed move in which the skater skates with the legs parallel, with one foot on a forward edge and the other leg on a backward edge on a different but parallel edge (i.e., inside or outside). The knee of the forward leg is bent. The move is similar to a spread eagle.", 
            "link": "/wiki/Ina_Bauer_(element)", 
            "name": "Ina Bauer"
        }, 
        {
            "def": "\"Professional\" skaters; skaters who receive money from sources not approved by the ISU.", 
            "link": null, 
            "name": "Ineligible"
        }, 
        {
            "def": "The edge of a skate blade facing towards the body.", 
            "link": null, 
            "name": "Inside edge"
        }, 
        {
            "def": "An upright spin position in which the skater pulls the free leg up in a split towards the front of the body, creating an I position.", 
            "link": null, 
            "name": "I-spin"
        }, 
        {
            "def": "The international governing body for ice skating sports.", 
            "link": "/wiki/International_Skating_Union", 
            "name": "International Skating Union"
        }, 
        {
            "def": "An abbreviation for the International Skating Union.", 
            "link": null, 
            "name": "ISU"
        }, 
        {
            "def": "A championship-level competition held by the ISU. The four figure skating ISU Championships are the World Figure Skating Championships, the World Junior Figure Skating Championships, the Four Continents Figure Skating Championships, and the European Figure Skating Championships. The senior synchronized skating ISU Championships are the World Synchronized Skating Championships and the junior-level equivalent is World Junior Synchronized Skating Championships.", 
            "link": null, 
            "name": "ISU Championship"
        }, 
        {
            "def": "A judging system which produces a total score from the technical elements score (TES) and the program components score (PCS). The skater with the highest total score wins.", 
            "link": "/wiki/ISU_Judging_System", 
            "name": "ISU Judging System"
        }, 
        {
            "def": "An abbreviation for the Junior Grand Prix.", 
            "link": null, 
            "name": "JGP"
        }, 
        {
            "def": "The original name for the sit spin.", 
            "link": null, 
            "name": "Jackson Haines spin"
        }, 
        {
            "def": "A skating move where a skater pushes off the ice into the air, rotates, and typically lands on one foot going backwards. There are seven rotational jumps; Axel, salchow, loop, toe loop, flip, lutz, and waltz.", 
            "link": "/wiki/Figure_skating_jump", 
            "name": "Jump"
        }, 
        {
            "def": "Two or more jumps performed one right after the other, without intervening steps or turns. Jump combinations most commonly involve the toe loop or loop jump as the final jump, because they start from the back outside edge, which is the normal landing edge for all six jumps.", 
            "link": null, 
            "name": "Jump combination"
        }, 
        {
            "def": "Two or more jumps connected by turns or hops.", 
            "link": null, 
            "name": "Jump sequence"
        }, 
        {
            "def": "A skater who has reached the minimum age and has not exceeded the maximum age defined by the ISU for junior level competition.", 
            "link": null, 
            "name": "Junior age-eligible"
        }, 
        {
            "def": "A series of eight international events that build to the Junior Grand Prix Final. It is the junior level complement to the ISU Grand Prix of Figure Skating.", 
            "link": "/wiki/ISU_Junior_Grand_Prix", 
            "name": "Junior Grand Prix"
        }, 
        {
            "def": "The level below Senior (Olympic) level competition. International competitions for Juniors include the ISU Junior Grand Prix and the World Junior Figure Skating Championships.", 
            "link": null, 
            "name": "Junior level"
        }, 
        {
            "def": "A name for various competitions in different countries. In the United States, the Junior Olympics referred to a competition held to determine the national champions at the Intermediate and Juvenile levels.", 
            "link": null, 
            "name": "Junior Olympics"
        }, 
        {
            "def": "An informal name for the World Junior Figure Skating Championships. Also: World Juniors.", 
            "link": null, 
            "name": "Junior Worlds"
        }, 
        {
            "def": "A dance hold used in ice dancing.", 
            "link": null, 
            "name": "Killian"
        }, 
        {
            "def": "The area next to the rink at major competitions where the skaters wait to get their results.", 
            "link": "/wiki/Kiss_and_cry", 
            "name": "Kiss and cry"
        }, 
        {
            "def": "An abbreviation for the long program.", 
            "link": null, 
            "name": "LP"
        }, 
        {
            "def": "The official term for female competitors.", 
            "link": null, 
            "name": "Ladies"
        }, 
        {
            "def": "The leg on which a skater lands a jump. Opposite of free leg. For right-handed skaters, it is usually the right leg, and vice versa.", 
            "link": null, 
            "name": "Landing leg"
        }, 
        {
            "def": "A type of hand-to-hand pair lift.", 
            "link": null, 
            "name": "Lasso lift"
        }, 
        {
            "def": "A spin position in which the back is arched and head dropped back, the free leg bent behind, and the arms often stretched to the ceiling or arched overhead.", 
            "link": "/wiki/Layback_spin", 
            "name": "Layback spin"
        }, 
        {
            "def": "An air position in jumps where the free leg is held at a right angle to the landing leg, crossing it above the knee, so that it appears to be \"wrapped\" around the other. Most skaters keep their legs more vertical and crossed at the ankles when they jump.", 
            "link": null, 
            "name": "Leg wrap"
        }, 
        {
            "def": "The assigned difficulty of an element under the ISU Judging System. The highest difficulty level is Level 4.", 
            "link": null, 
            "name": "Level (judging)"
        }, 
        {
            "def": "The division by competitive level of skill. International ISU competitions currently take place at the Novice, Junior, Senior, and Adult levels.", 
            "link": null, 
            "name": "Level (skating)"
        }, 
        {
            "def": "A pairs and ice dance element in which one skater lifts his or her partner while rotating. Pairs lifts, unlike dance, go over the head. Some dancers perform genderbending or \"reverse\" lifts, in which the woman lifts the man.", 
            "link": "/wiki/Figure_skating_lifts", 
            "name": "Lift"
        }, 
        {
            "def": "A portmanteau of \"lutz\" and \"flip\", for an improperly executed flip jump, where the inside take-off edge is mistakenly changed to an outside edge, making it a lutz jump.", 
            "link": null, 
            "name": "Lip"
        }, 
        {
            "def": "The standard abbreviation for the loop jump.", 
            "link": null, 
            "name": "Lo"
        }, 
        {
            "def": "A semicircle created on the ice", 
            "link": null, 
            "name": "Lobe"
        }, 
        {
            "def": "A group of dance lifts which may last up to ten seconds in competition on the senior level.", 
            "link": null, 
            "name": "Long lift"
        }, 
        {
            "def": "An unofficial, but widely used, name for the second and longer of the two programs performed by singles and pair skaters at a competition. The time limit is 4.5 minutes for men's singles and pairs and 4 minutes for ladies' singles at the senior (Olympic) level.", 
            "link": null, 
            "name": "Long program (LP)"
        }, 
        {
            "def": "", 
            "link": null, 
            "name": "An abbreviation for long program."
        }, 
        {
            "def": "An edge jump that takes off from the back outside edge.", 
            "link": "/wiki/Loop_jump", 
            "name": "Loop jump (Lo)"
        }, 
        {
            "def": "A skating move in which one leg is bent sharply at the knee and the other is extended backwards in a straight line with the boot or blade touching the ice.", 
            "link": null, 
            "name": "Lunge"
        }, 
        {
            "def": "A toepick-assisted jump with an entrance from a back outside edge and landing on the back outside edge of the opposite foot.", 
            "link": "/wiki/Lutz_jump", 
            "name": "Lutz jump (Lz)"
        }, 
        {
            "def": "The standard abbreviation for the Lutz jump.", 
            "link": null, 
            "name": "Lz"
        }, 
        {
            "def": "Two or more skaters skating in such a way that they are mirroring each other. The opposite of unison skating.", 
            "link": null, 
            "name": "Mirror skating"
        }, 
        {
            "def": "A two-footed turn on the same edge that continues along the same lobe.", 
            "link": "/wiki/Mohawk_turn", 
            "name": "Mohawk turn"
        }, 
        {
            "def": "A country's national championships, used to decide their national champion. The highest-level competition on the national level. See: List of national championships in figure skating.", 
            "link": null, 
            "name": "Nationals"
        }, 
        {
            "def": "A level of competition below Junior. Novice level skaters compete in some international events, but there are no Championship-level events for Novice level skaters.", 
            "link": null, 
            "name": "Novice level"
        }, 
        {
            "def": "A scoring abbreviation for the original dance in an ice dancing competition.", 
            "link": null, 
            "name": "OD"
        }, 
        {
            "def": "In ice dancing, a step that is started close to the skating foot that doesn't cross in front or behind.", 
            "link": null, 
            "name": "Open stroke"
        }, 
        {
            "def": "Under the 6.0 system, the skater's ranking within the group of skaters by a specific judge. Ordinals were what counted, not the specific marks.", 
            "link": null, 
            "name": "Ordinal"
        }, 
        {
            "def": "Formerly the second program of an ice dance competition. In 2010, the ISU eliminated the compulsory and original dances, merging them into what is now the short dance.", 
            "link": "/wiki/Original_dance", 
            "name": "Original dance"
        }, 
        {
            "def": "The edge of a skate blade facing away from the body.", 
            "link": null, 
            "name": "Outside edge"
        }, 
        {
            "def": "A jump in which the skater rotates past the position for landing the jump in the air, or fails to check the rotation on landing.", 
            "link": null, 
            "name": "Over-rotated"
        }, 
        {
            "def": "Type of lift where the lifter raises his arms above his shoulders.", 
            "link": null, 
            "name": "Pair lift"
        }, 
        {
            "def": "A spin in which two skaters rotate around a single axis while holding on to each other.", 
            "link": null, 
            "name": "Pair spin"
        }, 
        {
            "def": "A skating discipline in which a partnership, typically composed of a male and female skater, performs overhead lifts, twist lifts, throw jumps, side-by-side spins and jumps. A partnership composed of two men or two women skating together is called a similar pair.", 
            "link": "/wiki/Pair_skating", 
            "name": "Pair skating"
        }, 
        {
            "def": "A sit spin that has the leg tucked over the other and the upper body is bent over the leg.", 
            "link": null, 
            "name": "Pancake spin"
        }, 
        {
            "def": "Since 2010, the official name of the compulsory dance.", 
            "link": null, 
            "name": "Pattern dance"
        }, 
        {
            "def": "The highest score a skater has earned in ISU competition. Scores from national championships do not count as personal bests.", 
            "link": null, 
            "name": "Personal best (PB)"
        }, 
        {
            "def": "A two-footed movement in which one foot is flexed and the toe picks are inserted into the ice as a pivot point, and the other foot travels around the pivot point, such as the movement of a drafting compass.", 
            "link": null, 
            "name": "Pivot"
        }, 
        {
            "def": "During a jump, when a skater prematurely abandons their tight rotational position (\"opens up\") in mid-air, resulting in fewer than the desired rotations.", 
            "link": null, 
            "name": "Popping (a jump)"
        }, 
        {
            "def": "A jump for the purpose of displaying a position, such as stag jumps and split jumps.", 
            "link": null, 
            "name": "Positional jump"
        }, 
        {
            "def": "The second set of scores in the old 6.0 judging system, also known as \"Artistic Impression\".", 
            "link": null, 
            "name": "Presentation"
        }, 
        {
            "def": "A type of hand-to-hand pair lift.", 
            "link": null, 
            "name": "Press lift"
        }, 
        {
            "def": "Skaters who are not eligible to compete in ISU events. See: Ineligible.", 
            "link": null, 
            "name": "Professional"
        }, 
        {
            "def": "Skating elements set to music performed by a skater in a defined length of time. All senior-level disciplines currently skate two programs in most ISU events. Before the 2010/11 season, ice dancers performed three or four programs.", 
            "link": null, 
            "name": "Program"
        }, 
        {
            "def": "See quadruple jump.", 
            "link": null, 
            "name": "Quad"
        }, 
        {
            "def": "A jump with four full rotations (1440 degrees) in the air. The only quadruple jumps to have been completed in competition are the toe loop, salchow, and lutz by men, and just the salchow for ladies. In a quadruple Axel, the skater would have done 4.5 revolutions (1620 degrees).", 
            "link": null, 
            "name": "Quadruple jump"
        }, 
        {
            "def": "A round of competition prior to the short program or compulsory dance to determine which skaters qualify to compete in the competition itself.", 
            "link": null, 
            "name": "Qualifying round"
        }, 
        {
            "def": "A pair or dance lift in which the lifter rotates in one direction, then switches and rotates in the other direction, while traveling across the ice.", 
            "link": null, 
            "name": "Reverse rotational lift"
        }, 
        {
            "def": "Another term for the loop jump.", 
            "link": null, 
            "name": "Rittberger"
        }, 
        {
            "def": "A one-foot turn on the same edge but results in a change of lobe with the rotation inside the original lobe.", 
            "link": "/wiki/Rocker_turn", 
            "name": "Rocker turn"
        }, 
        {
            "def": "In ice dancing, a forward or backward edge that is either short or long. Can be a swing roll or a cross roll.", 
            "link": null, 
            "name": "Roll"
        }, 
        {
            "def": "A pair or dance lift in which the lifter rotates in one direction while traveling across the ice.", 
            "link": null, 
            "name": "Rotation lift"
        }, 
        {
            "def": "A jump done for the purpose of rotating in the air. All jumps which count as elements under the ISU Judging System are rotational jumps. Positional jumps count as transitions.", 
            "link": null, 
            "name": "Rotational jump"
        }, 
        {
            "def": "A split jump in which the skater performs a straddle position with the legs and the body forming a \"v\" shape. Many also touch their toes.", 
            "link": "/wiki/Split_jump", 
            "name": "Russian split"
        }, 
        {
            "def": "The standard abbreviation for the Salchow jump.", 
            "link": null, 
            "name": "S"
        }, 
        {
            "def": "An edge jump that takes off from the back outside edge. The jump is named after Ulrich Salchow.", 
            "link": "/wiki/Salchow_jump", 
            "name": "Salchow jump (S)"
        }, 
        {
            "def": "Permission to hold a competition or show, granted by the ISU or national governing body. Eligible skaters may only compete in sanctioned events.", 
            "link": null, 
            "name": "Sanction"
        }, 
        {
            "def": "An abbreviation of side-by-side.", 
            "link": null, 
            "name": "SBS"
        }, 
        {
            "def": "See compulsory figures.", 
            "link": null, 
            "name": "School figures"
        }, 
        {
            "def": "An upright spin in which the skater has the free leg crossed over the ankle of the spinning leg.", 
            "link": null, 
            "name": "Scratch spin"
        }, 
        {
            "def": "A skater or team's highest score in a particular season.", 
            "link": null, 
            "name": "Season's best (SB)"
        }, 
        {
            "def": "A skater who has reached the minimum age defined by the ISU for senior level competition.", 
            "link": null, 
            "name": "Senior age-eligible"
        }, 
        {
            "def": "A senior-level international competition held with an ISU sanction that is not a Grand Prix or ISU Championship event. Senior B events include the Nebelhorn Trophy.", 
            "link": null, 
            "name": "Senior B"
        }, 
        {
            "def": "Olympic-level competition.", 
            "link": null, 
            "name": "Senior level"
        }, 
        {
            "def": "A type of dance lift in which the lifter moves in a serpentine pattern across the ice.", 
            "link": null, 
            "name": "Serpentine lift"
        }, 
        {
            "def": "A positional (as opposed to rotational) jump in which the skater jumps upwards and bends both legs backwards reminiscent of a sheep. The back is often arched.", 
            "link": null, 
            "name": "Sheep jump"
        }, 
        {
            "def": "A skating position in which the skater travels on one foot with the skating leg in a bent position and the other leg held forward, parallel to the ice. This is the basic position for a sit spin.", 
            "link": null, 
            "name": "Shoot-the-duck"
        }, 
        {
            "def": "A segment in an ice dance competition combining features of the discontinued compulsory and original dances; each team performs a required pattern from one of the pattern dances for about half the dance, then performs original choreography, with some required elements, to a theme or rhythm specified by the ISU.", 
            "link": "/wiki/Short_dance", 
            "name": "Short dance"
        }, 
        {
            "def": "A group of dance lifts which may last up to six seconds in competition on the senior level.", 
            "link": null, 
            "name": "Short lift"
        }, 
        {
            "def": "The first and shorter of the two programs performed by singles and pair skaters at a competition. This program has certain required elements that must be completed.", 
            "link": "/wiki/Short_program_(figure_skating)", 
            "name": "Short program (SP)"
        }, 
        {
            "def": "An upright spin position in which the leg is held upwards towards the front of the body, but not all the way. The leg is held by the ankle or the calf, not the blade.", 
            "link": null, 
            "name": "Shotgun spin"
        }, 
        {
            "def": "Pair skating elements such as spins and jumps that are performed with the skaters next to each other, as opposed to pair spins or throw jumps, which are performed as a team.", 
            "link": null, 
            "name": "Side-by-side (SBS)"
        }, 
        {
            "def": "A move that a skater is known for and frequently performs, sometimes performed in a unique or unusual way.", 
            "link": null, 
            "name": "Signature move"
        }, 
        {
            "def": "A pair team made up of two men or two women.", 
            "link": null, 
            "name": "Similar pair"
        }, 
        {
            "def": "In ice dancing, a series of two edges across two steps (such as inside and outside). On the second step, the free foot is placed on the ice beside the skating foot and is then lifted parallel to the ice.", 
            "link": null, 
            "name": "Simple chasse"
        }, 
        {
            "def": "A jump with one full rotation (360 degrees) in the air (one and a half rotations for a single axel)", 
            "link": null, 
            "name": "Single (jump)"
        }, 
        {
            "def": "The skating discipline where one skater performs alone on the ice.", 
            "link": "/wiki/Single_skating", 
            "name": "Single (discipline)"
        }, 
        {
            "def": "A spin position with the spinning leg bent at the knee and the free leg extended forward.", 
            "link": "/wiki/Sit_spin", 
            "name": "Sit spin"
        }, 
        {
            "def": "In ice dancing, a series of two edges across two steps (such as inside and outside). On the second step, the free foot is placed on the ice beside the skating foot and then slides off the ice in the direction the skater is skating.", 
            "link": null, 
            "name": "Slide chasse"
        }, 
        {
            "def": "A rotation upon the ice surface. Spins are performed on the round part of the blade, just behind the toe pick.", 
            "link": "/wiki/Figure_skating_spins", 
            "name": "Spin"
        }, 
        {
            "def": "An edge skated with the free leg extended at or above hip level. Spirals are a required element for ladies' and pairs competitions. A good spiral depends on edge control and speed across the ice, not necessarily leg position.", 
            "link": "/wiki/Figure_skating_spirals", 
            "name": "Spiral"
        }, 
        {
            "def": "A position in which the legs are parallel to each other and extended in opposite directions on either the horizontal or vertical axes.", 
            "link": "/wiki/Split_(gymnastics)", 
            "name": "Split"
        }, 
        {
            "def": "A jump in the air in which a split is achieved, rather than any specific rotation.", 
            "link": "/wiki/Split_jumps", 
            "name": "Split jumps"
        }, 
        {
            "def": "A twist lift in which, prior to rotating, the lady performs a split with each leg separated by at least a 45° angle from the body axis.", 
            "link": null, 
            "name": "Split twist"
        }, 
        {
            "def": "The scoring abbreviation for the short program in a singles or pairs competition.", 
            "link": null, 
            "name": "SP"
        }, 
        {
            "def": "An element performed with both feet on the ice, the blades turned out with the heels pointing towards each other. It can be performed on inside edges or outside edges.", 
            "link": "/wiki/Spread_eagle_(figure_skating)", 
            "name": "Spread eagle"
        }, 
        {
            "def": "A split jump in which the front leg is bent under the body.", 
            "link": "/wiki/Split_jump", 
            "name": "Stag leap"
        }, 
        {
            "def": "A pair or dance lift performed \"on the spot\", without ice coverage.", 
            "link": null, 
            "name": "Stationary lift"
        }, 
        {
            "def": "In ice dancing, a one-foot tracing on the ice.", 
            "link": null, 
            "name": "Step"
        }, 
        {
            "def": "When a skater either under- or over-rotates a jump so that he or she does not land cleanly and must put the free leg down prematurely.", 
            "link": null, 
            "name": "Step-out"
        }, 
        {
            "def": "A series of footwork and field moves performed during a program. May be circular, straight line, or serpentine in pattern.", 
            "link": "/wiki/Step_sequence", 
            "name": "Step sequence"
        }, 
        {
            "def": "A dance lift in which the lifter moves in a straight line across the ice. This lift may be performed on one foot or two.", 
            "link": null, 
            "name": "Straight-line lift"
        }, 
        {
            "def": "A way of moving across the ice and gaining speed by using the edges of the blades.", 
            "link": null, 
            "name": "Stroking"
        }, 
        {
            "def": "Colloquial name of the rule stating that a skater must wait out a certain amount of time from international competition when changing the country they represent. The informal name refers to Julia Soldatova.", 
            "link": null, 
            "name": "Soldatova rule"
        }, 
        {
            "def": "A way of moving across the ice on two feet by pushing the feet outwards from a 90 degree angle V and then pulling them together again, forming an oval on the ice. Also known as scissors, fishes, lemons, or sculling.", 
            "link": null, 
            "name": "Swizzle"
        }, 
        {
            "def": "A discipline of ice skating in which groups of figure skaters perform together as one unit.", 
            "link": "/wiki/Synchronized_skating", 
            "name": "Synchronized skating"
        }, 
        {
            "def": "The standard abbreviation for the toe loop.", 
            "link": null, 
            "name": "T"
        }, 
        {
            "def": "A jump arm position variation made famous by Brian Boitano (hence 'Tano) where one arm is extended overhead instead of folded at the chest during a jump. This increases the difficulty of a jump.", 
            "link": null, 
            "name": "'Tano jump"
        }, 
        {
            "def": "A one-foot turn with a change of edge that results in a '3' shaped tracing on the ice.", 
            "link": null, 
            "name": "Three-turn"
        }, 
        {
            "def": "A pair element in which one skater throws the other into the air, where she completes a normal skating jump. Throw jumps usually have more height and power than normal jumps because of the extra help involved.", 
            "link": "/wiki/Figure_skating_jumps", 
            "name": "Throw jump"
        }, 
        {
            "def": "A toe-assisted jump that takes off from the back outside edge.", 
            "link": "/wiki/Toe_loop_jump", 
            "name": "Toe loop jump (T)"
        }, 
        {
            "def": "A general term to refer to any of the three jumps that use a toe pick assist.", 
            "link": null, 
            "name": "Toe jump"
        }, 
        {
            "def": "The teeth at the front of a skate blade that assists a skater in jumps and spins.", 
            "link": "/wiki/Figure_skate", 
            "name": "Toe pick"
        }, 
        {
            "def": "In ice dancing, a step in which the skater walks from one toe pick to the other.", 
            "link": null, 
            "name": "Toe step"
        }, 
        {
            "def": "When a spinning skater moves across the ice while spinning instead of centering the spin in one spot.", 
            "link": null, 
            "name": "Traveling"
        }, 
        {
            "def": "A jump with three full rotations (1080 degrees) in the air (3 and a half rotations for the triple axel)", 
            "link": null, 
            "name": "Triple jump"
        }, 
        {
            "def": "The landing of a jump where both feet touch the ice. A proper landing is on one foot.", 
            "link": null, 
            "name": "Two-footed landing"
        }, 
        {
            "def": "A quick multi-rotational turn on one foot while moving forwards or backwards.", 
            "link": "/wiki/Twizzle", 
            "name": "Twizzle"
        }, 
        {
            "def": "A jump or throw jump that is missing more than a quarter but less than one-half of a revolution.", 
            "link": null, 
            "name": "Under-rotated"
        }, 
        {
            "def": "Two or more skaters performing the same steps or elements at the same time.", 
            "link": null, 
            "name": "Unison skating"
        }, 
        {
            "def": "One of the three main spin positions.", 
            "link": "/wiki/Upright_spin", 
            "name": "Upright spin"
        }, 
        {
            "def": "a single or double rotation jump taken off from a backwards inside edge", 
            "link": null, 
            "name": "Walley jump"
        }, 
        {
            "def": "a 180 degree rotation, one of the first jumps skaters learn", 
            "link": null, 
            "name": "Waltz jump"
        }, 
        {
            "def": "See Flight.", 
            "link": null, 
            "name": "Warm-up group"
        }, 
        {
            "def": "An ISU Championship at the World-level in which skaters compete for the title of World Champion.", 
            "link": "/wiki/World_Figure_Skating_Championships", 
            "name": "World Figure Skating Championships"
        }, 
        {
            "def": "An ISU Championship at the World-level in which skaters who are Junor age eligible compete for the title of World Junior Champion.", 
            "link": "/wiki/World_Junior_Figure_Skating_Championships", 
            "name": "World Junior Figure Skating Championships"
        }, 
        {
            "def": "Informal name for the World Junior Figure Skating Championships. Also: Junior Worlds.", 
            "link": null, 
            "name": "World Juniors"
        }, 
        {
            "def": "Informal name for the World Figure Skating Championships", 
            "link": null, 
            "name": "Worlds"
        }, 
        {
            "def": "A ranking based on certain international results over the current and preceding two seasons.", 
            "link": null, 
            "name": "World Standings (WS)"
        }, 
        {
            "def": "An upright spin position in which a skater pulls the free leg up into a vertical split towards the side of the body, creating a Y shape.", 
            "link": "/wiki/Figure_skating_spins", 
            "name": "Y-spin"
        }, 
        {
            "def": "A spiral position in which the free leg is held up in a vertical split towards the side of the body, creating a Y position.", 
            "link": "/wiki/Figure_skating_spirals", 
            "name": "Y-spiral"
        }, 
        {
            "def": "A colloquial name for a rule stating that skaters are only allowed to perform a jump once in a program, twice if the jump is in combination with another jump. This rule applies only to triple jumps in senior level competition. The colloquial name refers to Elaine Zayak.", 
            "link": null, 
            "name": "Zayak Rule"
        }
    ]
}