{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_mill_machinery", 
    "words": [
        {
            "def": "The axle carries the waterwheel. It can also carry the Pit Wheel at its opposite end.", 
            "link": null, 
            "name": "Axle"
        }, 
        {
            "def": "The Bedstone is the bottom of a pair of millstones. It does not move. The upper stone is called the Runner Stone.", 
            "link": null, 
            "name": "Bedstone"
        }, 
        {
            "def": "The Crown Wheel is a driving wheel located at the top of the Upright Shaft", 
            "link": null, 
            "name": "Crown Wheel"
        }, 
        {
            "def": "The Great Spur Wheel is a large gear attached to the Upright Shaft. It drives one or more Stone Nuts in a corn mill. If mounted on a Layshaft it is called a Spur Wheel and only drives one Stone Nut", 
            "link": null, 
            "name": "Great Spur Wheel"
        }, 
        {
            "def": "An internal framework supporting the gears and millstones. This isolation prevents damage to the building from the vibrations of the workings.", 
            "link": null, 
            "name": "Hurst Frame"
        }, 
        {
            "def": "A Layshaft in a watermill is a horizontal shaft, carrying a Wallower and one or more Spur Wheels. The term can also refer to a minor shaft driving machinery by pulleys and belts.", 
            "link": null, 
            "name": "Layshaft"
        }, 
        {
            "def": "Millstones driven from above are known as Overdrift stones.", 
            "link": null, 
            "name": "Overdrift"
        }, 
        {
            "def": "The Pit Wheel is mounted on the opposite end of the axle to the waterwheel. It drives the Wallower on the Upright Shaft or Layshaft.", 
            "link": null, 
            "name": "Pit Wheel"
        }, 
        {
            "def": "Some waterwheels have a rack attached to the circumference, which drives the mill via a pinion mounted on a separate axle, which has a Pit Wheel at its opposite end. This is known as Rim Drive.", 
            "link": null, 
            "name": "Rim Drive"
        }, 
        {
            "def": "The Runner Stone is the topmost of a pair of millstones. It is driven by the Stone Nut. The lower stone is called a Bedstone.", 
            "link": null, 
            "name": "Runner Stone"
        }, 
        {
            "def": "A Stone Nut is a small gear driven by the Great Spur Wheel or Spur Wheel. It drives the Runner Stone. In most watermills, the stones are driven from below. These are called Underdrift stones. A few watermills drove the stones from above, known as Overdrift stones.", 
            "link": null, 
            "name": "Stone Nut"
        }, 
        {
            "def": "Millstones driven from beneath are known as Underdrift stones.", 
            "link": null, 
            "name": "Underdrift"
        }, 
        {
            "def": "The Upright Shaft in the main driven shaft in a watermill. It carries the wallower, Great Spur Wheel and sometimes a Crown Wheel.", 
            "link": null, 
            "name": "Upright Shaft"
        }, 
        {
            "def": "The Wallower is a small gear at the base of the upright shaft in a watermill, it is driven by the Pit Wheel.", 
            "link": null, 
            "name": "Wallower"
        }, 
        {
            "def": "A waterwheel is a source of power for a watermill. It is mounted on the axle and drives the mill by a Pit Wheel or Rim Drive. In some watermills, the Waterwheel was replaced by a Turbine.", 
            "link": null, 
            "name": "Waterwheel"
        }, 
        {
            "def": "The Bedstone is the bottom of a pair of millstones. It does not move. The upper stone is called the Runner Stone.", 
            "link": null, 
            "name": "Bedstone"
        }, 
        {
            "def": "The Brake Wheel is the main driving wheel in a Smock or Tower mill, and in some post mills. It is carried on the Windshaft and drives the Wallower on the Upright Shaft", 
            "link": null, 
            "name": "Brake Wheel"
        }, 
        {
            "def": "The Buck is an East-Anglian term for the body of a post-mill.", 
            "link": null, 
            "name": "Buck"
        }, 
        {
            "def": "The Crown Tree is the central, single baulk of timber, usually oak, that rests on top of the post in a post mill. Attached to it are the side-girts and the rest of the frame of the buck.", 
            "link": null, 
            "name": "Crown Tree"
        }, 
        {
            "def": "In a windmill, a Crown Wheel is an auxiliary gear on the Upright Shaft.", 
            "link": null, 
            "name": "Crown wheel"
        }, 
        {
            "def": "A fantail is a small windmill which is used to keep a windmill facing into the wind automatically.", 
            "link": null, 
            "name": "Fantail"
        }, 
        {
            "def": "The Great Spur Wheel is carried on the Upright Shaft It drives the Stone Nuts. Millstones driven by the Great Spur Wheel can be either Overdrift or Underdrift.", 
            "link": null, 
            "name": "Great Spur Wheel"
        }, 
        {
            "def": "The Head Wheel is carried on the Windshaft in a Post Mill and has a brake around its circumference. It drives a Stone Nut, Millstones driven by the Head Wheel are always Overdrift stones.", 
            "link": null, 
            "name": "Head Wheel"
        }, 
        {
            "def": "See Stock", 
            "link": null, 
            "name": "Middling"
        }, 
        {
            "def": "Millstones driven from above are known as Overdrift stones.", 
            "link": null, 
            "name": "Overdrift"
        }, 
        {
            "def": "The pivot centering a post mill on top of the main post.", 
            "link": null, 
            "name": "Pintle"
        }, 
        {
            "def": "The Runner Stone is the topmost of a pair of millstones. It is driven by the Stone Nut. The lower stone is called a Bedstone.", 
            "link": null, 
            "name": "Runner Stone"
        }, 
        {
            "def": "An iron collar and plate bearing that fits over the pintle of a post-mill's post, that supports the weight of the crown tree, around which the buck of the mill is constructed. An example is visible at High Salvington windmill.", 
            "link": null, 
            "name": "Samson Head"
        }, 
        {
            "def": "The beam that passes through the canister of the windshaft, which the sails are bolted onto.", 
            "link": null, 
            "name": "Stock"
        }, 
        {
            "def": "The Stone Nut is a small gear driven by the Great Spur Wheel, Head Wheel, or Tail Wheel. It drives the Runner Stone either from above (Overdrift) or below (Underdrift).", 
            "link": null, 
            "name": "Stone Nut"
        }, 
        {
            "def": "The Tail Wheel is carried on the Windshaft in a Post Mill and drives a Stone Nut. Millstones driven by the Tail Wheel are always Overdrift stones.", 
            "link": null, 
            "name": "Tail Wheel"
        }, 
        {
            "def": "The Trestle is the substructure of a Post Mill, usually enclosed in a protective structure called a roundhouse, which also serves as a storage facility. Post mills without a roundhouse are called Open Trestle Post Mills.", 
            "link": null, 
            "name": "Trestle"
        }, 
        {
            "def": "Millstones driven from beneath are known as Underdrift stones.", 
            "link": null, 
            "name": "Underdrift"
        }, 
        {
            "def": "The Upright Shaft is the main vertical shaft found in Smock and Tower mills. It is also found in some Post mills. It carries the Wallower at its top end, and a Great Spur Wheel at the bottom end. The Great Spur Wheel drves two or more Stone nuts.", 
            "link": null, 
            "name": "Upright Shaft"
        }, 
        {
            "def": "The Wallower is a driven gear at the top of the Upright Shaft in Smock, Tower and some Post mills. It is driven by the Brake Wheel", 
            "link": null, 
            "name": "Wallower"
        }, 
        {
            "def": "The Windshaft carries the Sails and also the Brake Wheel (Smock and Tower mills, and in some Post mills) or the Head Wheel and Tail Wheel in a Post Mill. Windshafts can be wholly made of wood, or wood with a cast iron Poll End (where the Sails are mounted) or entirely of cast iron.", 
            "link": null, 
            "name": "Windshaft"
        }
    ]
}