{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_tennis_terms", 
    "words": [
        {
            "def": " ace: Serve where the tennis ball lands inside the service box and is not touched by the receiver; thus, a shot that is both a serve and a winner is an ace. Aces are usually powerful and generally land on or near one of the corners at the back of the service box. Initially the term was used to indicate the scoring of a point.[1][2]", 
            "link": "/wiki/Ace_(tennis)", 
            "name": "ace"
        }, 
        {
            "def": " action: Synonym of spin", 
            "link": null, 
            "name": "action"
        }, 
        {
            "def": " ad: Used by the chair umpire to announce the score when a player has the advantage, meaning they won the point immediately after a deuce. See scoring in tennis", 
            "link": null, 
            "name": "ad"
        }, 
        {
            "def": " ad court: Left side of the court of each player, so called because the ad (advantage) point immediately following a deuce is always served to this side of the court.[2]", 
            "link": null, 
            "name": "ad court"
        }, 
        {
            "def": " advantage: When one player wins the first point from a deuce and needs one more point to win the game; not applicable when using deciding points.[1]", 
            "link": null, 
            "name": "advantage"
        }, 
        {
            "def": " advantage set: Set won by a player or team having won at least six games with a two-game advantage over the opponent (as opposed to a tiebreak format). Final sets in the singles draws of the Australian Open, the French Open, Wimbledon, and the tennis Olympic event, and Fed Cup, are all advantage sets. The Davis Cup was until 2015, when it switched to tie breaks.", 
            "link": null, 
            "name": "advantage set"
        }, 
        {
            "def": " all: Used by the chair umpire to announce scores when both players have the same number of points or the same number of games. When both players are at 40, the preferred term is deuce.[3]", 
            "link": null, 
            "name": "all"
        }, 
        {
            "def": " All-Comers: Tournament in which all players took part except the reigning champion. The winner of the All-Comers event would play the title holder in the Challenge Round.[4][3]", 
            "link": null, 
            "name": "All-Comers"
        }, 
        {
            "def": " all-court (or all-court game): Style of play that is a composite of all the different playing styles, which includes baseline, transition, and serve and volley styles.[5][6]", 
            "link": null, 
            "name": "all-court"
        }, 
        {
            "def": " alley: Area of the court between the singles and the doubles sidelines, which together are known as tramlines.[7]", 
            "link": null, 
            "name": "alley"
        }, 
        {
            "def": " alternate: Player or team that gains acceptance into the main draw of a tournament when a main draw player or team withdraws, when there is no qualifying tournament which could provide a lucky loser instead.", 
            "link": null, 
            "name": "alternate"
        }, 
        {
            "def": " approach shot: A groundstroke shot used as a setup as the player approaches the net, often using underspin or topspin.[8]", 
            "link": null, 
            "name": "approach shot"
        }, 
        {
            "def": " ATP: Acronym for Association of Tennis Professionals, the main organizing body of men's professional tennis; governs the ATP World Tour with the largest tournaments for men.", 
            "link": null, 
            "name": "ATP"
        }, 
        {
            "def": " ATP Champions' Race (or ATP Rankings Race To London): ATP point ranking system that starts at the beginning of the year and by the end of the year mirrors the ATP entry system ranking. The top eight players at the end of the year qualify for the ATP World Tour Finals.[9]", 
            "link": null, 
            "name": "ATP Champions' Race"
        }, 
        {
            "def": " ATP World Tour Finals: Formerly known as the Tennis Masters Cup (see T below), it is the annual season-ending tournament featuring eight of the top-ranked men in the world (plus two alternates).[10]", 
            "link": null, 
            "name": "ATP World Tour Finals"
        }, 
        {
            "def": " Australian formation: In doubles, a formation where the server and partner stand on the same side of the court before starting the point.[11][12]", 
            "link": null, 
            "name": "Australian formation"
        }, 
        {
            "def": " backhand: Stroke in which the ball is hit with the back of the racket hand facing the ball at the moment of contact. A backhand is often hit by a right-handed player when the ball is on the left side of the court, and vice versa.[4]", 
            "link": "/wiki/Backhand", 
            "name": "backhand"
        }, 
        {
            "def": " backhand smash: A type of smash played over the backhand side.[13]", 
            "link": null, 
            "name": "backhand smash"
        }, 
        {
            "def": " backcourt: The area of the tennis court between the baseline and the service line.[13]", 
            "link": null, 
            "name": "backcourt"
        }, 
        {
            "def": " backspin: Shot that rotates the ball backwards after it is hit; also known as slice or underspin. The trajectory of the shot is affected by an upward force that lifts the ball. See Magnus effect.[13]", 
            "link": "/wiki/Backspin", 
            "name": "backspin"
        }, 
        {
            "def": " backswing: Portion of a swing where the racket is swung backwards in preparation for the forward motion to hit the ball.[4]", 
            "link": null, 
            "name": "backswing"
        }, 
        {
            "def": " bagel: Colloquial term for winning or losing a set 6–0 (the shape of the zero being reminiscent of the round shape of a bagel). See also breadstick.[14][15][16]", 
            "link": null, 
            "name": "bagel"
        }, 
        {
            "def": " Bagnall–Wild: A method of draw which places all byes in the first round. Introduced in the 1880s.[17][18]", 
            "link": null, 
            "name": "Bagnall–Wild"
        }, 
        {
            "def": " ball boy (ball girl or ballkid): a person, commonly a child tasked with retrieving tennis balls from the court that have gone out of play and supplying the balls to the players before their service. Ball boys in net positions normally kneel near the net and run across the court to collect the ball, while ball boys in the back positions stand in the back along the perimeter of the arena. Ball boys in the back are responsible for giving the balls to the player serving.[19]", 
            "link": "/wiki/Ball_boy", 
            "name": "ball boy"
        }, 
        {
            "def": " ball toss: The action of throwing up the ball prior to the serve.[19]", 
            "link": null, 
            "name": "ball toss"
        }, 
        {
            "def": " baseline: Line at the farthest ends of the court indicating the boundary of the area of play. If the ball goes over the base it will be the other player's point.[20][21]", 
            "link": "https://en.wiktionary.org/wiki/Baseline", 
            "name": "baseline"
        }, 
        {
            "def": " baseliner: Player who plays around the baseline during play and relies on the quality of his or her ground strokes.[21]", 
            "link": null, 
            "name": "baseliner"
        }, 
        {
            "def": " big serve: Forceful serve, usually giving an advantage in the point for the server.", 
            "link": null, 
            "name": "big serve"
        }, 
        {
            "def": " bisque: One stroke (point), which may be claimed by the receiver at any part of the set. Part of the handicapping odds and used during the early era of the sport. Abolished by the LTA in 1890.[22]", 
            "link": null, 
            "name": "bisque"
        }, 
        {
            "def": " block (or blocked return): Defensive shot with relatively little backswing and shortened action instead of a full swing, usually while returning a serve.[23]", 
            "link": null, 
            "name": "block"
        }, 
        {
            "def": " bounce: The upward movement of the ball after it has hit the ground. The trajectory of the bounce can be affected by the surface and weather, the amount and type of spin and the power of the shot.[20]", 
            "link": null, 
            "name": "bounce"
        }, 
        {
            "def": " breadstick: Colloquial term for winning or losing a set 6–1, with the straight shape of the one supposedly being reminiscent of the straight shape of a breadstick. See also bagel.[24]", 
            "link": null, 
            "name": "breadstick"
        }, 
        {
            "def": " break: To win a game as the receiving player or team, thereby breaking serve. At high level of play the server is more likely to win a game, so breaks are often key moments of a match. Noun: break (service break) (e.g. \"to be a break down\" means \"to have, in a set, one break fewer than the opponent\", \"to be a double break up\" means \"to have, in a set, two breaks more than the opponent\").[25]", 
            "link": "https://en.wiktionary.org/wiki/break", 
            "name": "break"
        }, 
        {
            "def": " break back: To win a game as the receiving player or team immediately after losing the previous game as the serving player or team.", 
            "link": null, 
            "name": "break back"
        }, 
        {
            "def": " break point: Point which, if won by the receiver, would result in a break of service; arises when the score is 30–40 or 40–ad. A double break point or two break points arises at 15–40; a triple break point or three break points arises at 0–40.[26]", 
            "link": null, 
            "name": "break point"
        }, 
        {
            "def": " breaker: Colloquial term for tiebreak.[26]", 
            "link": null, 
            "name": "breaker"
        }, 
        {
            "def": " brutaliser: Smashing the ball directly at the opponent.", 
            "link": null, 
            "name": "brutaliser"
        }, 
        {
            "def": " buggy whip: Forehand hit with a follow-through that does not go across the body and finish on the opposite side, but rather goes from low to high, crosses the opposite shoulder (optionally) and finishes on the same side (similar to the driver of a horse-drawn carriage whipping a horse). Used, for example, by Rafael Nadal (racket head crosses the opposite shoulder) and Maria Sharapova (racket head stays on the same shoulder).[27]", 
            "link": null, 
            "name": "buggy whip"
        }, 
        {
            "def": " bumper guard: A piece of plastic that protects the outside of the upper-half of the racket head.[26]", 
            "link": null, 
            "name": "bumper guard"
        }, 
        {
            "def": " bye: Automatic advancement of a player to the next round of a tournament without facing an opponent. Byes are often awarded in the first round to the top-seeded players in a tournament.[20]", 
            "link": "/wiki/Bye_(sports)", 
            "name": "bye"
        }, 
        {
            "def": " call: Verbal utterance by a line judge or chair umpire declaring that a ball landed outside the valid area of play.[28]", 
            "link": null, 
            "name": "call"
        }, 
        {
            "def": " cannonball: Somewhat archaic term for a very fast, flat serve.[28]", 
            "link": null, 
            "name": "cannonball"
        }, 
        {
            "def": " can opener: Serve hit by a right-handed player with slice, landing on or near the intersection of the singles tramline and service line in the deuce court (landing in the ad court for a left-handed player).", 
            "link": null, 
            "name": "can opener"
        }, 
        {
            "def": " career Golden Slam: In addition to having won all four major titles in their career, a player that has also won an Olympic gold medal (in singles play) is said to have achieved a career Golden Slam. Only four players have ever achieved this: Steffi Graf (1988), Andre Agassi (1996), Rafael Nadal (2010) and Serena Williams (2012). Tennis at the Olympics was not played 1928–1984.", 
            "link": null, 
            "name": "career Golden Slam"
        }, 
        {
            "def": " career Grand Slam: Players who have won all 4 Major tournaments at any time in their career are said to have won a career Grand Slam.", 
            "link": null, 
            "name": "career Grand Slam"
        }, 
        {
            "def": " carve: To hit a groundstroke shot with a combination of sidespin and underspin.", 
            "link": null, 
            "name": "carve"
        }, 
        {
            "def": " centre mark: Small mark located at the centre of the baseline. When serving the player must stand on the correct side of the mark corresponding with the score.[29]", 
            "link": null, 
            "name": "centre mark"
        }, 
        {
            "def": " challenge: When a player requests an official review of the spot where the ball landed, using electronic ball tracking technology. See Hawk-Eye. Challenges are only available in some large tournaments.", 
            "link": null, 
            "name": "challenge"
        }, 
        {
            "def": " Challenge Round: Final round of a tournament, in which the winner of a single-elimination phase faces the previous year's champion, who plays only that one match. The challenge round was used in the early history of Wimbledon (from 1877 through 1921) and the US Open (from 1884 through 1911), and, until 1972, in the Davis Cup.[4][30]", 
            "link": null, 
            "name": "Challenge Round"
        }, 
        {
            "def": " Challenger: A tour of tournaments one level below the top-tier ATP World Tour. Currently, Challenger tournaments comprise the ATP Challenger Tour. Players, generally ranked around world no. 80 to world no. 300, compete on the Challenger tour in an effort to gain ranking points which allow them to gain entry to tournaments on the ATP World Tour.", 
            "link": null, 
            "name": "Challenger"
        }, 
        {
            "def": " change-over (or change of ends): 90 second rest time after every odd-numbered game when the players change ends.[31]", 
            "link": null, 
            "name": "change-over"
        }, 
        {
            "def": " chip: Blocking a shot with underspin, creating a low trajectory.[32]", 
            "link": null, 
            "name": "chip"
        }, 
        {
            "def": " chip and charge: Type of approach shot which involves hitting a slice shot while rapidly moving forward and following the shot into the net. Aimed at putting the opponent under pressure.[32]", 
            "link": null, 
            "name": "chip and charge"
        }, 
        {
            "def": " chop: Shot hit with extreme underspin, opposite of topspin.[20][33]", 
            "link": null, 
            "name": "chop"
        }, 
        {
            "def": " closed stance: Classic technique in which the ball is hit while the hitter's body is facing at an angle between parallel to the baseline and with his back turned to the opponent.[34]", 
            "link": null, 
            "name": "closed stance"
        }, 
        {
            "def": " code violation: On the ATP tour and WTA tours, a rule violation such as voicing an obscenity or hitting a ball into the stands (not during the point). The first violation results in a warning; the second, a point penalty; the third, a game penalty; and the fourth, forfeiting the match.", 
            "link": null, 
            "name": "code violation"
        }, 
        {
            "def": " consolidate (a break): To hold serve in the game immediately following a break of serve.", 
            "link": null, 
            "name": "consolidate"
        }, 
        {
            "def": " counterpuncher: Defensive baseliner. See tennis strategy.", 
            "link": null, 
            "name": "counterpuncher"
        }, 
        {
            "def": " court: Area designated for playing a game of tennis.[35][36]", 
            "link": "/wiki/Tennis_court", 
            "name": "court"
        }, 
        {
            "def": " crosscourt shot: Hitting the ball diagonally into the opponent's court.[37]", 
            "link": null, 
            "name": "crosscourt shot"
        }, 
        {
            "def": " cross-over: Player crossing the net into the opponent's court. It can be done either in a friendly fashion, or maliciously, thereby invoking a code violation. The latter sometimes happens when it is uncertain whether the ball on a decisive point landed inside or outside the court when playing on clay, thus leaving a mark.", 
            "link": null, 
            "name": "cross-over"
        }, 
        {
            "def": " cyclops: Device formerly used at Wimbledon and other tournaments to detect a serve that landed long, past the service line. The device emitted an audible noise when the serve was long. Succeeded by Hawk-Eye.[38]", 
            "link": "/wiki/Cyclops_(computer_system)", 
            "name": "cyclops"
        }, 
        {
            "def": " dampener A small rubber device affixed to the strings of the racket to absorb some of the vibration caused by hitting the ball.[39]", 
            "link": null, 
            "name": "dampener"
        }, 
        {
            "def": " Davis Cup: International, annual men's tennis competition in which teams from participating countries compete in a single-elimination format, with matches occurring at several stages during the year.[40]", 
            "link": "/wiki/Davis_Cup", 
            "name": "Davis Cup"
        }, 
        {
            "def": " dead net (dead net cord): Situation in which a player scores by inadvertently hitting the ball in such a way that it touches the upper cord of the net and rolls over to the other side; the player is said to have \"gotten (caught) a dead net (dead net cord)\" and considered to be lucky.", 
            "link": null, 
            "name": "dead net"
        }, 
        {
            "def": " dead rubber: Davis/Fed Cup match which is played after the victor of the tie has already been decided. Dead rubbers may or may not be played, depending on the coaches' agreement to do so, and are usually best of three, instead of five, sets. Typically, players who play the dead rubber are lower-ranked members of the team looking to gain Davis/Fed Cup match experience.[41]", 
            "link": "/wiki/Dead_rubber", 
            "name": "dead rubber"
        }, 
        {
            "def": " deciding point: In doubles, the point played when the game score reaches deuce and there is no ad play; the game is decided in favor of whichever team wins the deuce point.", 
            "link": null, 
            "name": "deciding point"
        }, 
        {
            "def": " dedans: An open gallery that is one of the winning openings placed at the service end of the court in court tennis; the spectators at a court-tennis match", 
            "link": null, 
            "name": "dedans"
        }, 
        {
            "def": " deep shot: Shot that lands near the baseline, as opposed to near the net or mid-court.", 
            "link": null, 
            "name": "deep shot"
        }, 
        {
            "def": " default: Disqualification of a player in a match by the chair umpire after the player has received four code violation warnings, generally for his/her conduct on court. A double default occurs when both players are disqualified.", 
            "link": null, 
            "name": "default"
        }, 
        {
            "def": " deuce: Score of 40–40 in a game. A player must win two consecutive points from a deuce to win the game, unless the tournament employs deciding points, as in the 2010 ATP World Tour Finals. A player who has won one point after deuce is said to have the advantage.", 
            "link": null, 
            "name": "deuce"
        }, 
        {
            "def": " deuce court: Right side of the court of each player, so called because into which the ball is served when the score is deuce.", 
            "link": null, 
            "name": "deuce court"
        }, 
        {
            "def": " dink: Onomatopoetic term for a shot with little pace, usually hit close to the net.[42]", 
            "link": null, 
            "name": "dink"
        }, 
        {
            "def": " dirtballer: Colloquial term for a clay court specialist.[42]", 
            "link": null, 
            "name": "dirtballer"
        }, 
        {
            "def": " disadvantage: Player or team which is 40-advantage down.", 
            "link": null, 
            "name": "disadvantage"
        }, 
        {
            "def": " double bagel: Two sets won to love; see bagel.[43]", 
            "link": null, 
            "name": "double bagel"
        }, 
        {
            "def": " double fault: Two serving faults in a row in one point, causing the player serving to lose the point.[43]", 
            "link": null, 
            "name": "double fault"
        }, 
        {
            "def": " doubles: Match played by four players, two per side of the court. A doubles court is 9 ft (2.97m) wider than a singles court.[44]", 
            "link": null, 
            "name": "doubles"
        }, 
        {
            "def": " down the line: Ball hit straight along the sideline to the opponent's side of the court.[37]", 
            "link": null, 
            "name": "down the line"
        }, 
        {
            "def": " draw: The schedule of matches in a tennis tournament. The starting fixtures are determined by a combined process of player seeding and random selection, and may or may not involve a public draw ceremony. A qualifying draw is set up to arrange the starting lineup of the qualifying competition (qualies), from where unseeded players qualify for a place in the starting lineup or the main draw of the tournament.[37]", 
            "link": null, 
            "name": "draw"
        }, 
        {
            "def": " drive volley (swing volley): Attacking type of backhand or forehand volley usually executed from a position in mid-court and played with pace at shoulder height.[45]", 
            "link": "/wiki/Drive_volley", 
            "name": "drive volley"
        }, 
        {
            "def": " drop shot: Play in which the player hits the ball lightly enough to just go over the net, usually with backspin; designed to catch a player who is away from the net off guard.[37]", 
            "link": "/wiki/Drop_shot", 
            "name": "drop shot"
        }, 
        {
            "def": " drop volley: Drop shot executed from a volley position.", 
            "link": null, 
            "name": "drop volley"
        }, 
        {
            "def": " elbow: Corner of the baseline and the doubles alley.", 
            "link": null, 
            "name": "elbow"
        }, 
        {
            "def": " entry system: Ranking system used by the ATP and WTA tours, so named because it determines whether a player has a sufficiently high ranking to gain direct acceptance (not as a qualifier or wildcard) into the main draw of a tournament. A player's Entry System ranking is different from his or her Race ranking, which is reset to zero at the beginning of each year. A player carries points and the associated Entry ranking continuously unless those points are lost at a tournament at which the player had previously earned them.", 
            "link": null, 
            "name": "entry system"
        }, 
        {
            "def": " error: A shot that does not land (correctly) in the opponent's court, resulting in the loss of a point.[45]", 
            "link": null, 
            "name": "error"
        }, 
        {
            "def": " exhibition: Tournament in which players compete for the purpose of entertaining the crowd or raising money, but not ranking points on the ATP or WTA tours.", 
            "link": null, 
            "name": "exhibition"
        }, 
        {
            "def": " fault: Serve that fails to land the ball in the opponent's service box, therefore not starting the point. See also double fault and foot fault.[46]", 
            "link": null, 
            "name": "fault"
        }, 
        {
            "def": " Fed Cup (or Federation Cup): International, annual women's tennis competition in which teams from participating countries compete in a single-elimination format tournament with matches occurring at several stages during the year.[47]", 
            "link": "/wiki/Fed_Cup", 
            "name": "Fed Cup"
        }, 
        {
            "def": " first serve: The first of the two attempts to serve that a player is allowed at the beginning of a point. A let serve that lands inbounds does not count as a serve.", 
            "link": null, 
            "name": "first serve"
        }, 
        {
            "def": " five: Number of games completed (e.g. \"7–5\" is spoken as \"seven–five\"), or a spoken abbreviation of \"15\" in points (e.g. a score of 40–15 is sometimes spoken as \"forty–five\").", 
            "link": null, 
            "name": "five"
        }, 
        {
            "def": " flat (or flat shot): Shot with relatively little spin and usually hard-hit.[45]", 
            "link": "/wiki/Flat_(tennis)", 
            "name": "flat"
        }, 
        {
            "def": " flatliner: Player who hits the ball flat with a very low trajectory with exceptional depth and accuracy so that the ball often strikes the line. Examples include Andre Agassi and Lindsay Davenport.", 
            "link": null, 
            "name": "flatliner"
        }, 
        {
            "def": " follow through: Portion of a swing after the ball is hit.[48][45]", 
            "link": null, 
            "name": "follow through"
        }, 
        {
            "def": " foot fault: Type of service fault in which a player, during the serve, steps on or over the baseline into the court before striking the ball. A foot fault may also occur if the player steps on or across the center hash mark and its imaginary perpendicular extension from the baseline to the net. The definition of a foot fault has changed several times since the introduction of (lawn) tennis.[49]", 
            "link": null, 
            "name": "foot fault"
        }, 
        {
            "def": " forced error: Error caused by an opponent's good play; contrasted with an unforced error. Counting forced errors as well as unforced errors is partly subjective.[45]", 
            "link": null, 
            "name": "forced error"
        }, 
        {
            "def": " forehand: Stroke in which the player hits the ball with the front of the racket hand facing the ball; contrasted with backhand.[49]", 
            "link": "/wiki/Forehand", 
            "name": "forehand"
        }, 
        {
            "def": " frame shot: A mishit on the frame of the racket rather than the strings.", 
            "link": null, 
            "name": "frame shot"
        }, 
        {
            "def": " fry: See breadstick.", 
            "link": null, 
            "name": "fry"
        }, 
        {
            "def": " Futures: Series of men's tour tennis tournaments which comprise the ITF Men's Circuit, a tour two levels below the ATP World Tour and one level below the ATP Challenger Tour. Players compete in Futures events (generally when ranked below world no. 300 or so) to garner enough ranking points to gain entry into Challenger events.", 
            "link": null, 
            "name": "Futures"
        }, 
        {
            "def": " game: A game consists of a sequence of points played with the same player serving and is a segment of a set. Each set consists of at least six games.[50]", 
            "link": null, 
            "name": "game"
        }, 
        {
            "def": " game point: Situation in which the server is leading and needs one more point to win the game. See also break point.[50]", 
            "link": "/wiki/Tennis_score", 
            "name": "game point"
        }, 
        {
            "def": " ghost in to the net: To approach the net from the baseline while the opposing player is focused on retrieving a ball and therefore unaware that the player is approaching the net.", 
            "link": null, 
            "name": "ghost in to the net"
        }, 
        {
            "def": " GOAT: Colloquial acronym for Greatest Of All Time.", 
            "link": null, 
            "name": "GOAT"
        }, 
        {
            "def": " Golden Bagel Award: Award for male players winning the most bagels (sets won 6–0), from January 1 until the year-end tournament. Davis Cup matches and incomplete sets are not counted.", 
            "link": "/wiki/Golden_Bagel_Award", 
            "name": "Golden Bagel Award"
        }, 
        {
            "def": " Golden set: Set which is won without dropping a single point.", 
            "link": "/wiki/Golden_set_(tennis)", 
            "name": "Golden set"
        }, 
        {
            "def": " Golden Slam: Winning the Grand Slam and the tennis Olympic gold medal in a calendar year. This has only been achieved by Steffi Graf in 1988. See also career Golden Slam", 
            "link": "/wiki/Golden_Slam", 
            "name": "Golden Slam"
        }, 
        {
            "def": " Grand Slam: The Grand Slam means winning all four of the prestigious major tournaments in a calendar year. \"Grand Slam\" is also commonly used to refer to any one of the four tournaments: the Australian Open, the French Open (Roland Garros), Wimbledon, and the U.S. Open. See also career Grand Slam.[49]", 
            "link": "/wiki/Grand_Slam_(tennis)", 
            "name": "Grand Slam"
        }, 
        {
            "def": " Gran Willy: a name for the tweener, a between-the-legs trick shot. Named for Guillermo Vilas, who pioneered the shot in the 1970s. See also tweener and Sabatweenie.", 
            "link": null, 
            "name": "Gran Willy"
        }, 
        {
            "def": " grinding: Playing out points with a series of shots from the baseline. See also attrition.", 
            "link": null, 
            "name": "grinding"
        }, 
        {
            "def": " grip: a grip is a way of holding the racket in order to hit shots during a match. The three most commonly used conventional grips are the Continental, the Eastern and the Western. Most players change grips during a match depending on what shot they are hitting. For further information on grips, including all the types, see grip (tennis).[51]", 
            "link": null, 
            "name": "grip"
        }, 
        {
            "def": " grommet strip: Strip of plastic containing small tubes that are placed in the frame's string holes to prevent the strings from rubbing against the abrasive frame.[52]", 
            "link": null, 
            "name": "grommet strip"
        }, 
        {
            "def": " groundie: Colloquial word for a groundstroke.", 
            "link": null, 
            "name": "groundie"
        }, 
        {
            "def": " groundstroke: Forehand or backhand shot that is executed after the ball bounces once on the court.[50]", 
            "link": "/wiki/Groundstroke", 
            "name": "groundstroke"
        }, 
        {
            "def": " grunting: noises made by players while either serving or hitting the ball.[53]", 
            "link": "/wiki/Grunting_(tennis)", 
            "name": "grunting"
        }, 
        {
            "def": " gut: Type of racket string. Can be made from catgut or synthetic gut.[50]", 
            "link": "/wiki/Strings_(tennis)#Natural_Gut", 
            "name": "gut"
        }, 
        {
            "def": " hacker: Player whose clumsy strokes seem more accidental than intentional.[50]", 
            "link": null, 
            "name": "hacker"
        }, 
        {
            "def": " Hail Mary: Extremely high lob, for defensive purposes.", 
            "link": null, 
            "name": "Hail Mary"
        }, 
        {
            "def": " half court: The area of the court in the vicinity of the service line.", 
            "link": null, 
            "name": "half court"
        }, 
        {
            "def": " half volley: A groundstroke shot made immediately after a bounce or simultaneous to the bounce and played with the racket close to the ground.[53]", 
            "link": "/wiki/Half_volley", 
            "name": "half volley"
        }, 
        {
            "def": " handicapping A system in which competitors are given advantages or compensations to equalize the chances of winning.[53][54]", 
            "link": null, 
            "name": "handicapping"
        }, 
        {
            "def": " hardcourt (or hard court): A type of court which is made of asphalt or concrete with a synthetic/acrylic layer on top. They can vary in color and tend to play medium-fast to fast.", 
            "link": null, 
            "name": "hardcourt"
        }, 
        {
            "def": " Hawk-Eye: Computer system connected to cameras to track the path of the ball for replay purposes; used with the player challenge system to contest and review designated line calls.", 
            "link": "/wiki/Hawk-Eye", 
            "name": "Hawk-Eye"
        }, 
        {
            "def": " head (or racket head): Portion of the racket that contains the strings.[55]", 
            "link": null, 
            "name": "head"
        }, 
        {
            "def": " heavy (ball): Ball hit with so much topspin that it feels \"heavy\" when the opposing player strikes it.", 
            "link": null, 
            "name": "heavy"
        }, 
        {
            "def": " hold (or hold serve): To win the game when serving. Compare break.", 
            "link": null, 
            "name": "hold"
        }, 
        {
            "def": " hot shot: Colloquial term, see tweener.", 
            "link": null, 
            "name": "hot shot"
        }, 
        {
            "def": " I-formation: Formation used in doubles where the net player on the serving team crouches roughly at the centre service line; used mainly to counter teams that prefer a crosscourt return.[56][57]", 
            "link": null, 
            "name": "I-formation"
        }, 
        {
            "def": " inside-out: Running around the backhand side and hitting a crosscourt forehand. Vice versa for inside out backhand.", 
            "link": null, 
            "name": "inside-out"
        }, 
        {
            "def": " inside-in: Running around the backhand side to hit a forehand down the line. Vice versa for inside in backhand.", 
            "link": null, 
            "name": "inside-in"
        }, 
        {
            "def": " insurance break: Break that achieves an overall advantage of two breaks of serve.", 
            "link": null, 
            "name": "insurance break"
        }, 
        {
            "def": " ITF: Acronym for International Tennis Federation, the governing body of world tennis. Founded in 1913 as the International Lawn Tennis Federation (ILTF).[58]", 
            "link": null, 
            "name": "ITF"
        }, 
        {
            "def": " IPIN: Acronym for International Player Identification Number, a registration number required for all professional tennis players and administered by the governing body ITF.", 
            "link": null, 
            "name": "IPIN"
        }, 
        {
            "def": " jamming: Serving or returning straight into the opponent's body.", 
            "link": null, 
            "name": "jamming"
        }, 
        {
            "def": " junk ball: A shot or return stroke in which the ball tends to be slow and possibly also without spin; often introduced unpredictably to upset the flow of the game and the rhythm of the opposition.", 
            "link": null, 
            "name": "junk ball"
        }, 
        {
            "def": " junior exempt (\"JE\"): High-ranking junior players can be awarded a spot in the draw of a tournament through the ITF's junior exempt project.[59]", 
            "link": null, 
            "name": "junior exempt"
        }, 
        {
            "def": " kick serve: Type of spin serve that bounces high. Introduced in the United States in the late 1880s and called the American twist.[60][61]", 
            "link": "/wiki/Twist_serve", 
            "name": "kick serve"
        }, 
        {
            "def": " knock-up: Practice or warm-up session without scoring which usually precedes the start of competitive play.[50][62]", 
            "link": null, 
            "name": "knock-up"
        }, 
        {
            "def": " lawn tennis: \"Regular\" tennis, as opposed to real tennis, the game from which tennis is derived. Reflects the fact that the game was first played on grass.[63]", 
            "link": null, 
            "name": "lawn tennis"
        }, 
        {
            "def": " let (or do-over): A call that requires the point to be replayed. The umpire indicates this type of let by announcing \"Let. First serve,\" or \"Let. Second serve.\" Lets typically occur when an otherwise-valid serve makes contact with the net before hitting the ground. Theoretically, a player could serve an infinite number of otherwise-valid let serves, but a serve that touches the net and then lands out of bounds counts as one of the two allowed serves. A let can also be called during play when there is some distraction to either player not caused by the players themselves, such as a ball boy moving behind a receiver, debris flying across the court in windy conditions, or a ball accidentally falling out of a player's pocket or entering from a neighboring court. The call is made by the chair umpire when one is assigned to the match, as in professional matches, or one of the players when there is no chair umpire. When a receiver is legitimately unprepared for a serve, a let is technically the result, even if the word goes unspoken.[64][65]", 
            "link": null, 
            "name": "let"
        }, 
        {
            "def": " let-check: Electronic sensor on the net that assists chair umpires in calling lets by detecting vibration. Typically, it is used only on show courts in professional matches, like electronic review. Players and commentators occasionally complain that such devices are too sensitive, that is, indicate too many false positives.", 
            "link": null, 
            "name": "let-check"
        }, 
        {
            "def": " line call (or call): Call made by the line judge. A call of 'out' will be made in combination with an outstretched arm pointing sideways if a ball lands outside the court and if the ball is 'in', i.e. lands on or within the outer lines, this is indicated by holding both hands flattened and the arms stretched downwards.[66]", 
            "link": null, 
            "name": "line call"
        }, 
        {
            "def": " line judge (or line umpire): Person designated to observe the passage of tennis balls over the boundary lines of the court. A line judge can declare that a play was inside or outside the play area and cannot be overruled by the players. Line judges must defer to an umpire's decision, even when it contradicts their own observations.[53][67]", 
            "link": null, 
            "name": "line judge"
        }, 
        {
            "def": " lob: Stroke in which the ball is hit high above the net. If the opposing player or players are up at the net, the intention may be an offensive lob in order to win the point outright. In a defensive lob, the intent is to give the player time to recover and get in position, or, if the opponents are at the net, to force them to chase down the lob. See also moonball.[53]", 
            "link": "/wiki/Lob_(tennis)", 
            "name": "lob"
        }, 
        {
            "def": " lingering death tiebreak: Version of the tiebreak played as the best of twelve points, with a two-point advantage needed to clinch the set.[68]", 
            "link": null, 
            "name": "lingering death tiebreak"
        }, 
        {
            "def": " lob volley: Type of volley shot aimed at lobbing the ball over the opponent and normally played when the opponent is in the vicinity of the net.[69]", 
            "link": null, 
            "name": "lob volley"
        }, 
        {
            "def": " love: Scoring term indicating zero (e.g. \"15-0\" is spoken \"fifteen-love\"; \"to hold to love\" means \"to win the game when serving with the opponent scoring zero points\"; \"to break to love\" means \"to win the game when receiving with the opponent scoring zero points\"). Thought to be derived from either the French term, l'oeuf, literally the egg, meaning nothing or the Dutch word lof, meaning honour.[70][71][72]", 
            "link": null, 
            "name": "love"
        }, 
        {
            "def": " love game: Shutout game, won without the opponent scoring a single point.[73]", 
            "link": null, 
            "name": "love game"
        }, 
        {
            "def": " lucky loser (\"LL\"): Highest-ranked player to lose in the final round of qualifying into a tournament, but still ends up getting qualified due to a sudden withdrawal by one of the players already in the main draw. In Grand Slam events, one of the four highest-ranked losers in the final qualifying round is randomly picked as the lucky loser.", 
            "link": null, 
            "name": "lucky loser"
        }, 
        {
            "def": " Mac-Cam: High-speed video camera used for televised instant replays of close shots landing on/near the baseline. Name derived from John McEnroe.", 
            "link": "/wiki/Mac-Cam", 
            "name": "Mac-Cam"
        }, 
        {
            "def": "main draw: See draw.", 
            "link": null, 
            "name": "main draw"
        }, 
        {
            "def": " Masters Cup: Former name of the year-end ATP championship, in which the eight highest-ranked players compete in a round-robin format.", 
            "link": "/wiki/Masters_Cup", 
            "name": "Masters Cup"
        }, 
        {
            "def": " match: A contest between two players (singles match) or two teams of players (doubles match), normally played as the best of three or five sets.[53][69]", 
            "link": null, 
            "name": "match"
        }, 
        {
            "def": " match point: Situation in which the player who is leading needs one more point to win the match. Variations of the term are possible; e.g. championship point is the match point in the final match of a championship or a gold medal point is the match point in the final match of the Olympics.[69]", 
            "link": null, 
            "name": "match point"
        }, 
        {
            "def": " Mercedes Super 9: Former name for the nine ATP Masters Series Tournaments", 
            "link": null, 
            "name": "Mercedes Super 9"
        }, 
        {
            "def": " mini-break: Point won from the opponent's serve. The term is usually used in a tiebreak, but it can be used during normal service games as well. To be \"up a mini-break\" means that the player has one more mini-break than his/her opponent.", 
            "link": null, 
            "name": "mini-break"
        }, 
        {
            "def": " mini-hold: Point won by the server, usually in a tiebreak.", 
            "link": null, 
            "name": "mini-hold"
        }, 
        {
            "def": " MIPTC: Acronym for Men's International Professional Tennis Council, administrative body of the tournaments that comprised the Grand Prix tennis circuit. Existed from 1974 until the creation of the ATP Tour in 1989.", 
            "link": null, 
            "name": "MIPTC"
        }, 
        {
            "def": " mis-hit: Stroke in which the racket fails to make contact with the ball in the \"sweetspot\" area of the strings.", 
            "link": null, 
            "name": "mis-hit"
        }, 
        {
            "def": " mixed doubles: Match played by four players, two male, two female, one of each sex per side of the court.[69]", 
            "link": null, 
            "name": "mixed doubles"
        }, 
        {
            "def": " moonball: A type of groundstroke that is hit with a lot of topspin, usually with the forehand, to create a high, slow, floating shot that lands close to the opponent's baseline. See also lob.[74][75]", 
            "link": null, 
            "name": "moonball"
        }, 
        {
            "def": " MOP: Point at 0–30; stands for major opportunity point.", 
            "link": null, 
            "name": "MOP"
        }, 
        {
            "def": " net: Interlaced fabric, cord, and tape stretched across the entire width of the court; it is held up by the posts.[76]", 
            "link": null, 
            "name": "net"
        }, 
        {
            "def": "net cord: see dead net cord", 
            "link": null, 
            "name": "net cord"
        }, 
        {
            "def": " net point: Point won or lost on approaching the net, as opposed to a point won or lost by a stroke from the baseline.", 
            "link": null, 
            "name": "net point"
        }, 
        {
            "def": " net posts: Posts on each side of the court which hold up the net. The net posts are placed 3 feet (0.914 m) outside the doubles court on each side, unless a singles net is used, in which case the posts are placed 3 feet (0.914 m) outside the singles court.[35]", 
            "link": null, 
            "name": "net posts"
        }, 
        {
            "def": " net sticks (or singles sticks): Pair of poles placed on the singles line to support the net during a singles match.[69]", 
            "link": null, 
            "name": "net sticks"
        }, 
        {
            "def": " new balls: New set of balls replacing the old ones during the game from time to time due to the fact that strokes make the ball heat up and alter its bounce characteristics; the player first to serve one of the new balls shows it to the opponent.", 
            "link": null, 
            "name": "new balls"
        }, 
        {
            "def": " no-man's land: Area between the service line and the baseline, where a player is most vulnerable.[69]", 
            "link": null, 
            "name": "no-man's land"
        }, 
        {
            "def": " non-endemic products: Products for tennis sponsorship that are not intrinsic to the sport such as watches, cars, jewelry.", 
            "link": null, 
            "name": "non-endemic products"
        }, 
        {
            "def": " not up: Call given by the umpire when an opponent plays a ball that has already bounced twice i.e. the ball was out of play when the player played it", 
            "link": null, 
            "name": "not up"
        }, 
        {
            "def": " NTRP rating: National Tennis Rating Program rating; system used in the United States to rank players on a scale from 1 to 7, with 1 being an absolute beginner and 7 a touring pro.[77]", 
            "link": null, 
            "name": "NTRP rating"
        }, 
        {
            "def": " official: Member of the officiating team: tournament referee, chair umpire, or linesman.", 
            "link": "/wiki/Official_(tennis)", 
            "name": "official"
        }, 
        {
            "def": " On serve: Situation where both players or teams have the same number of breaks in a set. While on serve, neither player or team can win the set without a break of serve. An advantage set requires at least one break to win.", 
            "link": null, 
            "name": "On serve"
        }, 
        {
            "def": " OP: Stands for opportunity point; 15–30, an opportunity to potentially break serve.", 
            "link": null, 
            "name": "OP"
        }, 
        {
            "def": " Open Era: Period in tennis which began in 1968 when tournaments became open to both amateurs and professional players.[78]", 
            "link": null, 
            "name": "Open Era"
        }, 
        {
            "def": " open stance: Modern technique in which the hitter's body facing is at an angle between parallel to the baseline and facing the opponent. See also closed stance.", 
            "link": null, 
            "name": "open stance"
        }, 
        {
            "def": " out: A ball that has landed outside the playing area.[79]", 
            "link": null, 
            "name": "out"
        }, 
        {
            "def": " overgrip (or overwrap): Material wrapped over the handle of the racket to absorb moisture or add gripping assistance.[79]", 
            "link": null, 
            "name": "overgrip"
        }, 
        {
            "def": " overhead: Stroke in which the player hits the ball over his/her head; if the shot is hit relatively strongly, it is referred to as a smash; smashes are often referred to as simply overheads, although not every overhead shot is a smash.[80]", 
            "link": null, 
            "name": "overhead"
        }, 
        {
            "def": " overrule: To reverse a call made by a line judge, done by the umpire.[80]", 
            "link": null, 
            "name": "overrule"
        }, 
        {
            "def": " paint the lines: To hit shots that land as close to the lines of the court as possible.", 
            "link": null, 
            "name": "paint the lines"
        }, 
        {
            "def": " pass (or passing shot): Type of shot, usually played in the vicinity of the baseline, that passes by (not over) the opponent at the net. See also lob.[81]", 
            "link": null, 
            "name": "pass"
        }, 
        {
            "def": " percentage tennis: Style of play consisting of safe shots with large margins of error. Aimed at keeping the ball in play in anticipation of an opponent's error.", 
            "link": null, 
            "name": "percentage tennis"
        }, 
        {
            "def": " poaching (noun: poach): In doubles, an aggressive move where the player at the net moves to volley a shot intended for his/her partner.[82][81]", 
            "link": null, 
            "name": "poaching"
        }, 
        {
            "def": " point: Period of play between the first successful service of a ball and the point at which that ball goes out of play. It is the smallest unit of scoring in tennis.[83]", 
            "link": "/wiki/Point_(tennis)", 
            "name": "point"
        }, 
        {
            "def": " pre-qualifying: Tournament in which the winner earns a wildcard into a tournament's qualifying draw.", 
            "link": null, 
            "name": "pre-qualifying"
        }, 
        {
            "def": " pressureless ball: Special type of tennis ball that does not have a core of pressurized air as standard balls do, but rather has a core made of solid rubber, or a core filled tightly with micro-particles. Quality pressureless balls are approved for top-pro play generally, but pressureless balls are typically used mostly at high altitudes, where standard balls would be greatly affected by the difference between the high pressure in the ball and the thin air.", 
            "link": null, 
            "name": "pressureless ball"
        }, 
        {
            "def": " protected ranking (\"PR\"): Players injured for a minimum of six months can ask for a protected ranking, which is based on his or her average ranking during the first three months of his or her injury. The player can use his or her protected ranking to enter tournaments' main draws or qualifying competitions when coming back from injury.[9]", 
            "link": null, 
            "name": "protected ranking"
        }, 
        {
            "def": " pulp: 30–30, not quite deuce.", 
            "link": null, 
            "name": "pulp"
        }, 
        {
            "def": " pusher: Player who does not try to hit winners, but only to return the ball safely; often used in a derogative manner.", 
            "link": "/wiki/Pusher_(tennis)", 
            "name": "pusher"
        }, 
        {
            "def": " putaway: Offensive shot to try to end the point with no hope of a return.[84]", 
            "link": null, 
            "name": "putaway"
        }, 
        {
            "def": " qualies: Short for qualification rounds or similar.[85]", 
            "link": null, 
            "name": "qualies"
        }, 
        {
            "def": " qualification round: Final round of play in a pre-tournament qualification competition, also known as qualies.[85]", 
            "link": null, 
            "name": "qualification round"
        }, 
        {
            "def": " qualifier (\"Q\"): Player who reaches the tournament's main draw by competing in a pre-tournament qualifying competition, rather than automatically by virtue of his/her world ranking, by being awarded a wildcard, or other exemption.[85]", 
            "link": null, 
            "name": "qualifier"
        }, 
        {
            "def": "qualifying draw: See draw.", 
            "link": null, 
            "name": "qualifying draw"
        }, 
        {
            "def": " racket (or racquet): Bat with a long handle and a large looped frame with a string mesh tautly stretched across it, the frame made of wood, metal, graphite, composite, or some other synthetic material, used by a tennis player to hit the tennis ball during a game of tennis.[86][87]", 
            "link": "/wiki/Tennis_racket", 
            "name": "racket"
        }, 
        {
            "def": " racket abuse (racquet abuse): When a player slams their racket into the ground or net in frustration. Can result in a warning from the umpire or docking of points.", 
            "link": null, 
            "name": "racket abuse"
        }, 
        {
            "def": " rally: Following the service of a tennis ball, a series of return hits of the ball that ends when one or other player fails to return the ball within the court boundary or fails to return a ball that falls within the play area.[88]", 
            "link": "/wiki/Rally_(tennis)", 
            "name": "rally"
        }, 
        {
            "def": " rankings: A hierarchical listing of players based on their recent achievements. Used to determine qualification for entry and seeding in tournaments.[82]", 
            "link": null, 
            "name": "rankings"
        }, 
        {
            "def": " rating: A system used by national tennis organizations to group players of comparable skills. The rating of players is dependent on their match record.[89]", 
            "link": null, 
            "name": "rating"
        }, 
        {
            "def": " real tennis (or royal tennis or court tennis): An indoor racket sport which was the predecessor of the modern game of (lawn) tennis. The term 'real' is used as a retronym to distinguish the ancient game from the modern game of lawn tennis. Known also as court tennis in the United States or royal tennis in Australia.[90]", 
            "link": "/wiki/Real_tennis", 
            "name": "real tennis"
        }, 
        {
            "def": " receiver: Player who is receiving the service of the opponent.[88][91]", 
            "link": null, 
            "name": "receiver"
        }, 
        {
            "def": " referee: Person in charge of enforcing the rules in a tournament, as opposed to a tennis match. See also umpire.[92][84]", 
            "link": "/wiki/Official_(Tennis)#Referee", 
            "name": "referee"
        }, 
        {
            "def": " reflex volley: Volley in which the player has no time to plan the shot, and instead reacts instinctively to get the racket in position to return the ball. This occurs frequently in doubles and in advanced singles.", 
            "link": null, 
            "name": "reflex volley"
        }, 
        {
            "def": " registered player: A designation used during the beginning of the Open Era to identify a category of amateur tennis players who were allowed to compete for prize money but stayed under the control of their national associations.", 
            "link": null, 
            "name": "registered player"
        }, 
        {
            "def": " retirement (\"ret.\"): Player's withdrawal during a match, causing the player to forfeit the tournament. Usually this happens due to injury. For a pre-match withdrawal, see walkover.", 
            "link": null, 
            "name": "retirement"
        }, 
        {
            "def": " retriever: Defensive baseliner who relies on returning the ball rather than scoring direct winners. See tennis strategy.[84]", 
            "link": null, 
            "name": "retriever"
        }, 
        {
            "def": " return: Stroke made by the receiver of a service.[93]", 
            "link": null, 
            "name": "return"
        }, 
        {
            "def": " return ace: Shot in which the opponent serves, the receiver returns the serve, and the opponent does not hit the ball.", 
            "link": null, 
            "name": "return ace"
        }, 
        {
            "def": " rising shot: Shot in which the ball is hit before it reaches its apex; also hitting on the rise.", 
            "link": null, 
            "name": "rising shot"
        }, 
        {
            "def": " round of 16: Round of a tournament prior to the quarterfinals in which there are 16 players remaining, corresponds to the fourth round of 128-draw tournament, the third round of a 64-draw, and second round of a 32-draw tournament.", 
            "link": null, 
            "name": "round of 16"
        }, 
        {
            "def": " round robin (\"RR\"): Tournament format in which players are organised into groups of three or four players and compete against all other members of the group. Players are then ranked according to number of matches, sets, and games won and head-to-head records. The top one, two, or four players then qualify for the next stage of the tournament.[88]", 
            "link": null, 
            "name": "round robin"
        }, 
        {
            "def": " rubber: Individual match, singles or doubles, within a Davis Cup or Fed Cup tie.[41][94]", 
            "link": null, 
            "name": "rubber"
        }, 
        {
            "def": " Sabatweenie: a name for the tweener, a between-the-legs trick shot. Named for Gabriela Sabatini, who used the shot in the 1980s. See also Tweener and Gran Willy.", 
            "link": null, 
            "name": "Sabatweenie"
        }, 
        {
            "def": " SABR (Sneak Attack By Roger): a ploy where a returner rushes forward during a serve to catch an opponent off guard with a quick return and net foray.[95][96][97]", 
            "link": null, 
            "name": "SABR"
        }, 
        {
            "def": " satellite: Intermediate junior level of play, equivalent of Level 6", 
            "link": null, 
            "name": "satellite"
        }, 
        {
            "def": " scoring: Method of tracking progress of a match. A match consists of points, game and sets.[98]", 
            "link": null, 
            "name": "scoring"
        }, 
        {
            "def": " scratch: Withdrawal from a match due to an injury.", 
            "link": null, 
            "name": "scratch"
        }, 
        {
            "def": " second serve: Second and final of the two serve attempts a player is allowed at the beginning of a point, not counting net cord let serves that would otherwise be good.", 
            "link": null, 
            "name": "second serve"
        }, 
        {
            "def": " second snap: a tennis ball struck for top spin against lubricated or co-poly strings will get extra rotation on the ball from the mains popping back in position before the ball leaves contact with the racket.", 
            "link": null, 
            "name": "second snap"
        }, 
        {
            "def": " seed (or seeding): Player whose position in a tournament has been arranged based on his/her ranking so as not to meet other ranking players in the early rounds of play. Named for the similarity to scattering seeds widely over the ground to plant them. For a given tournament there is a specified number of seeds, depending on the size of the draw. For ATP tournaments, typically one out of four players are seeds. For example, a 32-draw International Series tournament would have eight seeds. The seeds are chosen and ranked by the tournament organizers and are selected because they are the players with the highest ranking who also, in the estimation of the organizers, have the best chance of winning the tournament. Seed ranking is sometimes controversial, because it does not always match the players' current ATP ranking.[94]", 
            "link": null, 
            "name": "seed"
        }, 
        {
            "def": " serve (noun: service): The starting stroke of each point. The ball must be hit into the opponent's half within the service box.[99]", 
            "link": "/wiki/Serve_(tennis)", 
            "name": "serve"
        }, 
        {
            "def": " service box: Rectangular area of the court, marked by the sidelines and the service lines, that a serve is supposed to land in.[100]", 
            "link": null, 
            "name": "service box"
        }, 
        {
            "def": " service game: With regard to a player, the game in which the player is serving (e.g. \"Player A won a love service game\" means that Player A has won a game where (s)he was serving without the opponent scoring).", 
            "link": null, 
            "name": "service game"
        }, 
        {
            "def": " service line: A line that runs parallel to the net at a distance of 21 ft (6.4m) and forms part of the demarcation of the service box.[101]", 
            "link": null, 
            "name": "service line"
        }, 
        {
            "def": " serve and volley: Method of play to serve and immediately move forward to the net to make a volley with the intent to hit a winner and end the point.[102]", 
            "link": "/wiki/Serve_and_volley", 
            "name": "serve and volley"
        }, 
        {
            "def": " set: A unit of scoring. A set consists of games and the first player to win six games with a two-game advantage wins the set. In most tournaments a tiebreak is used at six games all to decide the outcome of a set.[102]", 
            "link": null, 
            "name": "set"
        }, 
        {
            "def": " set point: Situation in which the player who is leading needs one more point to win a set. If the player is serving in such a situation, (s)he is said to be \"serving for the set\".[102]", 
            "link": null, 
            "name": "set point"
        }, 
        {
            "def": " shamateurism: Amalgamation of 'sham' and 'amateurism', derogatory term used to describe a custom that widely existed before the open era where an amateur player would receive financial remuneration to participate in a tournament in violation of amateur laws.[103]", 
            "link": null, 
            "name": "shamateurism"
        }, 
        {
            "def": " shank: Significantly misdirected shot, the result of hitting the ball in an unintentional manner, typically with the frame of the racket. Such shots typically land outside the court, however, it is possible to hit a shank that lands validly in the court.", 
            "link": null, 
            "name": "shank"
        }, 
        {
            "def": " singles: Match played by two players, one on each side of the court. A singles court is narrower than a doubles court and is bounded by the inner sidelines and the baseline.[101][104]", 
            "link": "/wiki/Singles_(tennis)", 
            "name": "singles"
        }, 
        {
            "def": " singles sticks (or net sticks): Pair of poles which are placed underneath the net near the singles sideline for the purpose of raising it for singles play.", 
            "link": null, 
            "name": "singles sticks"
        }, 
        {
            "def": " sitter: Shot which is hit with very little pace and no spin, which bounces high after landing, thus being an easy shot to put away.[105]", 
            "link": null, 
            "name": "sitter"
        }, 
        {
            "def": " sledgehammer: Two-handed backhand winner down the line.", 
            "link": null, 
            "name": "sledgehammer"
        }, 
        {
            "def": " slice: Shot with underspin (backspin), or a serve with sidespin. Groundstrokes hit with slice tend to have a flat trajectory and a low bounce.[101][104]", 
            "link": null, 
            "name": "slice"
        }, 
        {
            "def": " smash: Strongly hit overhead, typically executed when the player who hits the shot is very close to the net and can therefore hit the ball nearly vertically, often so that it bounces into the stands, making it unreturnable.[101]", 
            "link": "/wiki/Smash_(tennis)", 
            "name": "smash"
        }, 
        {
            "def": " spank: To hit a groundstroke flat with a lot of pace.", 
            "link": null, 
            "name": "spank"
        }, 
        {
            "def": " special exempt (\"SE\"): Players who are unable to appear in a tournament's qualifying draw because they are still competing in a previous tournament can be awarded a spot in the main draw by special exempt.", 
            "link": null, 
            "name": "special exempt"
        }, 
        {
            "def": " spin: Rotation of the ball as it moves through the air, affecting its trajectory and bounce. See backspin, topspin, and underspin.[101]", 
            "link": null, 
            "name": "spin"
        }, 
        {
            "def": " split step: a footwork technique in which a player does a small bounce on both feet, just as the opponent hits the ball. This lets the player go more quickly in either direction.[106]", 
            "link": null, 
            "name": "split step"
        }, 
        {
            "def": " spot serving/spot server: Serving with precision, resulting in the ball landing either on or near the intersection of the center service line and service line or singles tramline and service line.", 
            "link": null, 
            "name": "spot serving"
        }, 
        {
            "def": " squash shot: Forehand or backhand shot typically hit on the run from a defensive position, either with slice, or from behind the player's stance.", 
            "link": null, 
            "name": "squash shot"
        }, 
        {
            "def": " stance: The way a player stands when hitting the ball", 
            "link": null, 
            "name": "stance"
        }, 
        {
            "def": " stick volley: Volley hit crisply, resulting in shot with a sharp downward trajectory.", 
            "link": null, 
            "name": "stick volley"
        }, 
        {
            "def": " stiffness (or racket stiffness): The resistance of the racket to bending upon impact with the ball.[107]", 
            "link": null, 
            "name": "stiffness"
        }, 
        {
            "def": " stop volley: A softly-hit volley which absorbs almost all the power of the shot resulting in the ball dropping just over the net.[108][109]", 
            "link": null, 
            "name": "stop volley"
        }, 
        {
            "def": " stopper: Player who will not win or go deep in a tournament but is good enough to stop a top seed from advancing.", 
            "link": null, 
            "name": "stopper"
        }, 
        {
            "def": " straight sets: Situation in which the winner of a match does not lose a set. A straight set may also mean a set which is won by a score of 6-something; i.e. is won at the first opportunity and does not reach five games all.[108]", 
            "link": null, 
            "name": "straight sets"
        }, 
        {
            "def": " strings: Material woven through the face of the racket. The strings are where contact with the ball is supposed to be made.[110]", 
            "link": "/wiki/Strings_(tennis)", 
            "name": "strings"
        }, 
        {
            "def": " string saver: Tiny piece of plastic that is sometimes inserted where the strings cross, to prevent the strings from abrading each other and prematurely breaking.[111]", 
            "link": null, 
            "name": "string saver"
        }, 
        {
            "def": " stroke: Striking of the ball.[101]", 
            "link": null, 
            "name": "stroke"
        }, 
        {
            "def": " sudden death tiebreak: Version of the tiebreak played as the best of nine points, with the last being a deciding point to clinch the set. Introduced in 1965 by Jimmy Van Alen as a component of the VASSS.[112][113]", 
            "link": null, 
            "name": "sudden death tiebreak"
        }, 
        {
            "def": " super tiebreak: A tiebreak variation played to ten points instead of seven; used in some tournaments to decide a match instead of playing a third set.[114]", 
            "link": null, 
            "name": "super tiebreak"
        }, 
        {
            "def": " sweetspot: Central area of the racket head which is the best location, in terms of control and power, for making contact with the ball.[115]", 
            "link": null, 
            "name": "sweetspot"
        }, 
        {
            "def": "swing volley: See drive volley.", 
            "link": null, 
            "name": "swing volley"
        }, 
        {
            "def": " T (the T): The spot on a tennis court where the center line and the service line intersect perpendicularly to form a \"T\" shape.[116]", 
            "link": null, 
            "name": "T"
        }, 
        {
            "def": " tanking (noun: tank): Colloquial term for losing a match on purpose; or to purposely lose a non-vital set, so as to focus energy and attention on a match-deciding set.[117]", 
            "link": null, 
            "name": "tanking"
        }, 
        {
            "def": " tape it: To play an unforced error that hits the tape at the top of the net.", 
            "link": null, 
            "name": "tape it"
        }, 
        {
            "def": " tennis ball: Soft, hollow, air-filled rubber ball coated in a synthetic fur, used in the game of tennis. The ITF specifies that a tennis ball must have a diameter of 6.54–6.86 cm (2.57–2.70 in) and a weight of 56.0–59.4g. Yellow and white are the only approved colors at tournament level.[4][118]", 
            "link": "/wiki/Tennis_ball", 
            "name": "tennis ball"
        }, 
        {
            "def": " tennis bubble: Indoor tennis facility consisting of a domed structure which is supported by air pressure generated by blowers inside the structure.", 
            "link": null, 
            "name": "tennis bubble"
        }, 
        {
            "def": " tennis dad: Father of a tennis player, often used in reference to a parent actively participating in the player's tennis development and/or career.", 
            "link": null, 
            "name": "tennis dad"
        }, 
        {
            "def": " tennis elbow: Common injury in beginner to intermediate tennis players, possibly due to improper technique or a racket which transmits excessive vibration to the arm.[119]", 
            "link": "/wiki/Tennis_elbow", 
            "name": "tennis elbow"
        }, 
        {
            "def": " Tennis Hall of Fame: International Tennis Hall of Fame located in Newport, Rhode Island, United States and established in 1954; it hosts an annual tournament around the inductee ceremony.[120]", 
            "link": null, 
            "name": "Tennis Hall of Fame"
        }, 
        {
            "def": " the vineyard of tennis: Southern California as characterized by Bud Collins.", 
            "link": null, 
            "name": "the vineyard of tennis"
        }, 
        {
            "def": " tie: Synonymous with match, but used for team competitions such as the Davis Cup and Fed Cup.", 
            "link": null, 
            "name": "tie"
        }, 
        {
            "def": " tiebreak: Special game played when the score is 6–6 in a set to decide the winner of the set; the winner is the first to reach at least seven points with a difference of two points over the opponent.[101][112]", 
            "link": "/wiki/Tennis_score#Scoring_a_tiebreak_game", 
            "name": "tiebreak"
        }, 
        {
            "def": " topspin: Spin of a ball where the top of the ball rotates toward the direction of travel; the spin goes forward over the top of the ball, causing the ball to dip and bounce at a higher angle to the court.[121]", 
            "link": "/wiki/Topspin", 
            "name": "topspin"
        }, 
        {
            "def": " toss: At the beginning of a match, the winner of a coin toss chooses who serves first. In amateur tennis the toss is often performed by spinning the racket.[122][123]", 
            "link": null, 
            "name": "toss"
        }, 
        {
            "def": " touch: Occurs when a player touches any part of the net when the ball is still in play, losing the point.", 
            "link": null, 
            "name": "touch"
        }, 
        {
            "def": " tramline: Line defining the limit of play on the side of a singles or doubles court.[124][125]", 
            "link": null, 
            "name": "tramline"
        }, 
        {
            "def": " trampolining: Effect which occurs when striking a ball flat with a racket that is strung at a very loose tension. Trampolining results in a shot that has a very high velocity.", 
            "link": null, 
            "name": "trampolining"
        }, 
        {
            "def": " triple bagel: Colloquial term for three sets won to love. See bagel.", 
            "link": null, 
            "name": "triple bagel"
        }, 
        {
            "def": " triple crown: Winning the championship in all three tennis disciplines (singles, doubles and mixed doubles) at one event, especially a Grand Slam tournament.", 
            "link": null, 
            "name": "triple crown"
        }, 
        {
            "def": "tube: (Colloquial term) to deliberately and successfully hit the ball, at the opponent's the body; e.g. \"he tubed his opponent.\"", 
            "link": null, 
            "name": "tube"
        }, 
        {
            "def": " tweener (or between-the-legs shot or hot shot): A difficult trick shot in which a player hits the ball between his or her legs. It is usually performed when chasing down a lob with the player's back to the net. Forward-facing tweeners are also sometimes employed, and have been dubbed \"front tweeners\". See also Gran Willy and Sabatweenie.", 
            "link": "/wiki/Tweener_(tennis)", 
            "name": "tweener"
        }, 
        {
            "def": " tweener racket: a tennis racket of mid-weight, mid-head size and mid-stiffness, often used as an transitional racket for young professionals.", 
            "link": "/wiki/Tweener_racket", 
            "name": "tweener racket"
        }, 
        {
            "def": " twist serve (or American twist serve): Serve hit with a combination of slice and topspin which results in a curving trajectory and high bounce in the opposite direction of the ball's flight trajectory. See also kick serve.[126]", 
            "link": null, 
            "name": "twist serve"
        }, 
        {
            "def": " two ball pass: Passing an opponent that has come to the net with a first shot that causes them trouble on the volley followed up by hitting the second ball by them.", 
            "link": null, 
            "name": "two ball pass"
        }, 
        {
            "def": " underspin (or backspin or undercut): Spin of a ball where the top of the ball rotates away from the direction of travel; the spin is underneath the ball, causing the ball to float and to bounce at a lower angle to the court.[127][128]", 
            "link": null, 
            "name": "underspin"
        }, 
        {
            "def": " umpire (or chair umpire): Person designated to enforce the rules of the game during play, usually sitting on a high chair beside the net.[124]", 
            "link": "/wiki/Official_(Tennis)#Chair_umpire", 
            "name": "umpire"
        }, 
        {
            "def": " underhand serve (or underarm serve): Service in which the player serving delivers the ball with his or her racket below shoulder level. In intermediate level tennis this is considered unusual but an acceptable ploy. In upper-intermediate and professional events, the practice would generally be considered insulting.[129]", 
            "link": null, 
            "name": "underhand serve"
        }, 
        {
            "def": " unforced error: Error in a service or return shot that cannot be attributed to any factor other than poor judgement and execution by the player; contrasted with a forced error.[130]", 
            "link": null, 
            "name": "unforced error"
        }, 
        {
            "def": " unseeded player: Player who is not a seed in a tournament.[131]", 
            "link": null, 
            "name": "unseeded player"
        }, 
        {
            "def": " vantage: Archaic term for advantage.[127]", 
            "link": null, 
            "name": "vantage"
        }, 
        {
            "def": " VASSS: Acronym for Van Alen Streamlined Scoring System, an alternative scoring method developed by James Van Alen aimed at avoiding very long matches that can arise under the traditional advantage scoring system. The only element of the VASSS to be adopted by tennis authorities was the tiebreak.[132][133]", 
            "link": null, 
            "name": "VASSS"
        }, 
        {
            "def": " volley: A shot hit, usually in the vicinity of the net, by a player before the ball bounces on their own side of the court.[124][134]", 
            "link": "/wiki/Volley_(tennis)", 
            "name": "volley"
        }, 
        {
            "def": " walkover (\"WO\" or \"w/o\"): Unopposed victory. A walkover is awarded when the opponent fails to start the match for any reason, such as injury. For a mid-match withdrawal, see retirement.", 
            "link": "/wiki/Walkover", 
            "name": "walkover"
        }, 
        {
            "def": " Western grip: Type of grip used if a player wants to generate a lot of topspin on the groundstrokes, is created by placing the index knuckle on bevel 5 of the grip.[135][127]", 
            "link": null, 
            "name": "Western grip"
        }, 
        {
            "def": " wide: A call to indicate that the ball has landed out of court, beyond the sideline.[127][136]", 
            "link": null, 
            "name": "wide"
        }, 
        {
            "def": " wild card (\"WC\"): Player allowed to play in a tournament, even if his or her rank is not adequate or he or she does not register in time. Typically a few places in the draw are reserved for wild cards, which may be for local players who do not gain direct acceptance or for players who are just outside the ranking required to gain direct acceptance. Wild cards may also be given to players whose ranking has dropped due to a long-term injury.[137]", 
            "link": "/wiki/Wild_card_(sports)#Professional_tennis", 
            "name": "wild card"
        }, 
        {
            "def": " whiff: A stroke in which the player misses the ball completely. Whiffing a serve is considered a fault in an official match.[138]", 
            "link": null, 
            "name": "whiff"
        }, 
        {
            "def": " winner: A shot that is not reached by the opponent and wins the point; sometimes also a serve that is reached but not returned into the court.[139][140]", 
            "link": null, 
            "name": "winner"
        }, 
        {
            "def": " WCT: Acronym for World Championship Tennis, a tour for professional male tennis players established in 1968 which lasted until the emergence of the ATP Tour in 1990.", 
            "link": null, 
            "name": "WCT"
        }, 
        {
            "def": " WTA: Acronym for Women's Tennis Association, the main organizing body of women's professional tennis; governs the WTA Tour with the largest tournaments for women.[141][142]", 
            "link": null, 
            "name": "WTA"
        }, 
        {
            "def": " WTA Finals: The annual season-ending tournament featuring eight of the top-ranked women in the world (plus two alternates).", 
            "link": "/wiki/WTA_Finals", 
            "name": "WTA Finals"
        }, 
        {
            "def": " zero pointer: Ranking points received by skipping selected professional tennis tour events which a top ranked player is committed to participate in (mandatory tournaments). Therefore, the player risks getting no points added to his or her ranking even when participating in an alternative tournament in place of the mandatory event.", 
            "link": null, 
            "name": "zero pointer"
        }
    ]
}