{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_ring_theory", 
    "words": [
        {
            "def": "A ring is a set R with two binary operations, usually called addition (+) and multiplication (×), such that R is an abelian group under addition, R is a monoid under multiplication, and multiplication is both left and right distributive over addition. Rings are assumed to have multiplicative identities unless otherwise noted. The additive identity is denoted by 0 and the multiplicative identity by 1. (Warning: some books, especially older books, use the term \"ring\" to mean what here will be called a rng; i.e., they do not require a ring to have a multiplicative identity.)", 
            "link": null, 
            "name": "ring "
        }, 
        {
            "def": "A subset S of the ring (R,+,×) which remains a ring when + and × are restricted to S and contains the multiplicative identity 1 of R is called a subring of R.", 
            "link": null, 
            "name": "subring "
        }, 
        {
            "def": "In a commutative ring, an element a is called an associate of an element b if a divides b and b divides a.", 
            "link": null, 
            "name": "associate "
        }, 
        {
            "def": "An element r of a ring R is central if xr = rx for all x in R. The set of all central elements forms a subring of R, known as the center of R.", 
            "link": null, 
            "name": "central "
        }, 
        {
            "def": "In an integral domain R, an element a is called a divisor of the element b (and we say a divides b) if there exists an element x in R with ax = b.", 
            "link": null, 
            "name": "divisor "
        }, 
        {
            "def": "An element r of a ring is idempotent if r2 = r.", 
            "link": null, 
            "name": "idempotent "
        }, 
        {
            "def": "For a commutative ring B containing a subring A, an element b is integral over A if it satisfies a monic polynomial with coefficients from A.", 
            "link": null, 
            "name": "integral element"
        }, 
        {
            "def": "An element x of an integral domain is irreducible if it is not a unit and for any elements a and b such that x = ab, either a or b is a unit. Note that every prime element is irreducible, but not necessarily vice versa.", 
            "link": null, 
            "name": "irreducible "
        }, 
        {
            "def": "An element x of an integral domain is a prime element if it is not zero and not a unit and whenever x divides a product ab, x divides a or x divides b.", 
            "link": null, 
            "name": "prime element "
        }, 
        {
            "def": "An element r of R is nilpotent if there exists a positive integer n such that rn = 0.", 
            "link": null, 
            "name": "nilpotent "
        }, 
        {
            "def": "An element r of the ring R is a unit if there exists an element r−1 such that rr−1 = r−1r = 1. This element r−1 is uniquely determined by r and is called the multiplicative inverse of r. The set of units forms a group under multiplication.", 
            "link": null, 
            "name": "unit or invertible element "
        }, 
        {
            "def": "An element r of a ring R is von Neumann regular if there exists an element x of R such that r = rxr.", 
            "link": null, 
            "name": "von Neumann regular element "
        }, 
        {
            "def": "An element r of R is a left zero divisor if there exists a nonzero element x in R such that rx = 0 and a right zero divisor or if there exists a nonzero element y in R such that yr = 0. An element r of R is a called a two-sided zero divisor if it is both a left zero divisor and a right zero divisor.", 
            "link": null, 
            "name": "zero divisor "
        }, 
        {
            "def": "A left ideal I is finitely generated if there exist finitely many elements a1, ..., an such that I = Ra1 + ... + Ran. A right ideal I is finitely generated if there exist finitely many elements a1, ..., an such that I = a1R + ... + anR. A two-sided ideal I is finitely generated if there exist finitely many elements a1, ..., an such that I = Ra1R + ... + RanR.", 
            "link": null, 
            "name": "finitely generated ideal "
        }, 
        {
            "def": "A left ideal I of R is a subgroup of R such that aI ⊆ I for all a ∈ R. A right ideal is a subgroup of R such that Ia ⊆ I for all a ∈ R. An ideal (sometimes called a two-sided ideal for emphasis) is a subgroup which is both a left ideal and a right ideal.", 
            "link": null, 
            "name": "ideal "
        }, 
        {
            "def": "The intersection of all maximal left ideals in a ring forms a two-sided ideal, the Jacobson radical of the ring.", 
            "link": null, 
            "name": "Jacobson radical "
        }, 
        {
            "def": "The kernel of a ring homomorphism f : R → S is the set of all elements x of R such that f(x) = 0. Every ideal is the kernel of a ring homomorphism and vice versa.", 
            "link": null, 
            "name": "kernel of a ring homomorphism "
        }, 
        {
            "def": "A left ideal M of the ring R is a maximal left ideal if M ≠ R and the only left ideals containing M are R and M itself. Maximal right ideals are defined similarly. In commutative rings, there is no difference, and one speaks simply of maximal ideals.", 
            "link": null, 
            "name": "maximal ideal "
        }, 
        {
            "def": "An ideal is nil if it consists only of nilpotent elements.", 
            "link": null, 
            "name": "nil ideal "
        }, 
        {
            "def": "An ideal I is nilpotent if the power Ik is {0} for some positive integer k. Every nilpotent ideal is nil, but the converse is not true in general.", 
            "link": null, 
            "name": "nilpotent ideal "
        }, 
        {
            "def": "The set of all nilpotent elements in a commutative ring forms an ideal, the nilradical of the ring. The nilradical is equal to the intersection of all the ring's prime ideals. It is contained in, but in general not equal to, the ring's Jacobson radical.", 
            "link": null, 
            "name": "nilradical "
        }, 
        {
            "def": "An ideal P in a commutative ring R is prime if P ≠ R and if for all a and b in R with ab in P, we have a in P or b in P. Every maximal ideal in a commutative ring is prime. There is also a definition of prime ideal for noncommutative rings.", 
            "link": null, 
            "name": "prime ideal "
        }, 
        {
            "def": "A principal left ideal in a ring R is a left ideal of the form Ra for some element a of R. A principal right ideal is a right ideal of the form aR for some element a of R. A principal ideal is a two-sided ideal of the form RaR for some element a of R.", 
            "link": null, 
            "name": "principal ideal "
        }, 
        {
            "def": "Given a ring R and an ideal I of R, the quotient ring is the ring formed by the set R/I of cosets {a + I : a∈R} together with the operations (a + I) + (b + I) = (a + b) + I and (a + I)(b + I) = ab + I. The relationship between ideals, homomorphisms, and factor rings is summed up in the fundamental theorem on homomorphisms.", 
            "link": null, 
            "name": "quotient ring or factor ring "
        }, 
        {
            "def": "The radical of an ideal I in a commutative ring consists of all those ring elements a power of which lies in I. It is equal to the intersection of all prime ideals containing I.", 
            "link": null, 
            "name": "radical of an ideal "
        }, 
        {
            "def": "A function f : R → S between rings (R, +, ∗) and (S, ⊕, ×) is a ring homomorphism if it satisfies\n\nf(a + b) = f(a) ⊕ f(b)\nf(a ∗ b) = f(a) × f(b)\nf(1) = 1\n\n", 
            "link": null, 
            "name": "ring homomorphism "
        }, 
        {
            "def": "A ring homomorphism that is injective is a ring monomorphism.", 
            "link": null, 
            "name": "ring monomorphism "
        }, 
        {
            "def": "A ring homomorphism that is bijective is a ring isomorphism. The inverse of a ring isomorphism is also a ring isomorphism. Two rings are isomorphic if there exists a ring isomorphism between them. Isomorphic rings can be thought as essentially the same, only with different labels on the individual elements.", 
            "link": null, 
            "name": "ring isomorphism "
        }, 
        {
            "def": "Every nonzero ring R is guaranteed to have two ideals: the zero ideal and the entire ring R. These ideals are usually referred to as trivial ideals. Right ideals, left ideals, and two-sided ideals other than these are called nontrivial.", 
            "link": null, 
            "name": "trivial ideal"
        }, 
        {
            "def": "A ring in which all idempotent elements are central is called an Abelian ring. Such rings need not be commutative.", 
            "link": null, 
            "name": "Abelian ring "
        }, 
        {
            "def": "A ring satisfying the descending chain condition for left ideals is left artinian; if it satisfies the descending chain condition for right ideals, it is right artinian; if it is both left and right artinian, it is called artinian. Artinian rings are noetherian.", 
            "link": null, 
            "name": "artinian ring "
        }, 
        {
            "def": "A ring in which every element is multiplicatively idempotent element is a boolean ring.", 
            "link": null, 
            "name": "boolean ring "
        }, 
        {
            "def": "A ring R is commutative if the multiplication is commutative, i.e. rs = sr for all r,s ∈ R.", 
            "link": null, 
            "name": "commutative ring "
        }, 
        {
            "def": "A Dedekind domain is an integral domain in which every ideal has a unique factorization into prime ideals.", 
            "link": null, 
            "name": "Dedekind domain "
        }, 
        {
            "def": "A ring in which every nonzero element is a unit and 1 ≠ 0 is a division ring.", 
            "link": null, 
            "name": "division ring or skew field "
        }, 
        {
            "def": "A domain is a nonzero ring with no zero divisors except 0. This is the noncommutative generalization of integral domain.", 
            "link": null, 
            "name": "domain "
        }, 
        {
            "def": "A Euclidean domain is an integral domain in which a degree function is defined so that \"division with remainder\" can be carried out. It is so named because the Euclidean algorithm is a well-defined algorithm in these rings. All Euclidean domains are principal ideal domains.", 
            "link": null, 
            "name": "Euclidean domain "
        }, 
        {
            "def": "A field is a commutative division ring. Every finite division ring is a field, as is every finite integral domain.", 
            "link": null, 
            "name": "field "
        }, 
        {
            "def": "a ring that is finitely generated as Z-algebra.", 
            "link": null, 
            "name": "finitely generated ring"
        }, 
        {
            "def": "If R is a commutative ring and A is an R-algebra, then A is a finitely presented R-algebra if it is a quotient of a polynomial ring over R in finitely many variables by a finitely generated ideal.[1]", 
            "link": null, 
            "name": "Finitely presented algebra"
        }, 
        {
            "def": "A ring is left hereditary if its left ideals are all projective modules. Right hereditary rings are defined analogously.", 
            "link": null, 
            "name": "hereditary ring"
        }, 
        {
            "def": "A nonzero commutative ring with no zero divisors except 0.", 
            "link": null, 
            "name": "integral domain or entire ring "
        }, 
        {
            "def": "A ring R has invariant basis number if Rm isomorphic to Rn as R-modules implies m = n.", 
            "link": null, 
            "name": "invariant basis number"
        }, 
        {
            "def": "A ring with a unique maximal left ideal is a local ring. These rings also have a unique maximal right ideal, and the left and the right unique maximal ideals coincide. Certain commutative rings can be embedded in local rings via localization at a prime ideal.", 
            "link": null, 
            "name": "local ring "
        }, 
        {
            "def": "A ring satisfying the ascending chain condition for left ideals is left Noetherian; a ring satisfying the ascending chain condition for right ideals is right Noetherian; a ring that is both left and right Noetherian is Noetherian. A ring is left Noetherian if and only if all its left ideals are finitely generated; analogously for right Noetherian rings.", 
            "link": null, 
            "name": "Noetherian ring "
        }, 
        {
            "def": "See rng of square zero.", 
            "link": null, 
            "name": "null ring"
        }, 
        {
            "def": "A left perfect ring is one satisfying the descending chain condition on right principal ideals. They are also characterized as rings whose flat left modules are all projective modules. Right perfect rings are defined analogously. Artinian rings are perfect.", 
            "link": null, 
            "name": "perfect ring"
        }, 
        {
            "def": "A nonzero ring R is called a prime ring if for any two elements a and b of R with aRb = 0, we have either a = 0 or b = 0. This is equivalent to saying that the zero ideal is a prime ideal. Every simple ring and every domain is a prime ring.", 
            "link": null, 
            "name": "prime ring "
        }, 
        {
            "def": "A left primitive ring is a ring that has a faithful simple left R-module. Every simple ring is primitive. Primitive rings are prime.", 
            "link": null, 
            "name": "primitive ring "
        }, 
        {
            "def": "An integral domain in which every ideal is principal is a principal ideal domain. All principal ideal domains are unique factorization domains.", 
            "link": null, 
            "name": "principal ideal domain "
        }, 
        {
            "def": "a special type of Artinian ring which is also a self-injective ring on both sides. Every semisimple ring is quasi-Frobenius.", 
            "link": null, 
            "name": "quasi-Frobenius ring "
        }, 
        {
            "def": "A rng in which xy = 0 for all x and y. These are sometimes also called zero rings, even though they usually do not have a 1.", 
            "link": null, 
            "name": "rng of square zero"
        }, 
        {
            "def": "A ring R is left self-injective if the module RR is an injective module. While rings with unity are always projective as modules, they are not always injective as modules.", 
            "link": null, 
            "name": "self-injective ring"
        }, 
        {
            "def": "This is a ring whose Jacobson radical is zero. Von Neumann regular rings and primitive rings are semiprimitive, however quasi-Frobenius rings and local rings are usually not semiprimitive.", 
            "link": null, 
            "name": "semiprimitive ring or Jacobson semisimple ring"
        }, 
        {
            "def": "A semisimple ring is a ring R that has a \"nice\" decomposition, in the sense that R is a semisimple left R-module. Every semisimple ring is also Artinian, and has no nilpotent ideals. The Artin–Wedderburn theorem asserts that every semisimple ring is a finite product of full matrix rings over division rings.", 
            "link": null, 
            "name": "semisimple ring "
        }, 
        {
            "def": "A non-zero ring which only has trivial two-sided ideals (the zero ideal, the ring itself, and no more) is a simple ring.", 
            "link": null, 
            "name": "simple ring "
        }, 
        {
            "def": "The ring consisting of a single element 0 = 1, also called the zero ring.", 
            "link": null, 
            "name": "trivial ring"
        }, 
        {
            "def": "An integral domain R in which every non-zero non-unit element can be written as a product of prime elements of R. This essentially means that every non-zero non-unit can be written uniquely as a product of irreducible elements.", 
            "link": null, 
            "name": "unique factorization domain or factorial ring"
        }, 
        {
            "def": "A ring for which each element a can be expressed as a = axa for another element x in the ring. Semisimple rings are von Neumann regular.", 
            "link": null, 
            "name": "von Neumann regular ring"
        }, 
        {
            "def": "The ring consisting only of a single element 0 = 1, also called the trivial ring. Sometimes \"zero ring\" is alternatively used to mean rng of square zero.", 
            "link": null, 
            "name": "zero ring"
        }, 
        {
            "def": "This is a way to construct a new ring from given rings by taking the cartesian product of the given rings and defining the algebraic operations component-wise.", 
            "link": null, 
            "name": "direct product of a family of rings "
        }, 
        {
            "def": "A ring formed by the endomorphisms of an algebraic structure. Usually its multiplication is taken to be function composition, while its addition is pointwise addition of the images.", 
            "link": null, 
            "name": "endomorphism ring "
        }, 
        {
            "def": "For commutative rings, a technique to turn a given set of elements of a ring into units. It is named Localization because it can be used to make any given ring into a local ring. To localize a ring R, take a multiplicatively closed subset S containing no zero divisors, and formally define their multiplicative inverses, which shall be added into R. Localization in noncommutative rings is more complicated, and has been in defined several different ways.", 
            "link": null, 
            "name": "localization of a ring "
        }, 
        {
            "def": "Given a ring R, it is possible to construct matrix rings whose entries come from R. Often these are the square matrix rings, but under certain conditions \"infinite matrix rings\" are also possible. Square matrix rings arise as endomorphism rings of free modules with finite rank.", 
            "link": null, 
            "name": "matrix ring"
        }, 
        {
            "def": "Given a ring R, its opposite ring Rop has the same underlying set as R, the addition operation is defined as in R, but the product of s and r in Rop is rs, while the product is sr in R.", 
            "link": "/wiki/Opposite_ring", 
            "name": "opposite ring"
        }, 
        {
            "def": "Given a ring R, its projective line P(R) provides the context for linear fractional transformations of R.", 
            "link": "/wiki/Projective_line_over_a_ring", 
            "name": "projective line over a ring"
        }, 
        {
            "def": "Given R a commutative ring. The polynomial ring R[x] is defined to be the set \n  \n    \n      \n        {\n        \n          a\n          \n            n\n          \n        \n        \n          x\n          \n            n\n          \n        \n        +\n        \n          a\n          \n            n\n            −\n            1\n          \n        \n        \n          x\n          \n            n\n            −\n            1\n          \n        \n        +\n        \n          a\n          \n            n\n            −\n            2\n          \n        \n        \n          x\n          \n            n\n            −\n            2\n          \n        \n        +\n        …\n        +\n        \n          a\n          \n            1\n          \n        \n        x\n        +\n        \n          a\n          \n            0\n          \n        \n        \n          |\n        \n        \n          a\n          \n            n\n          \n        \n        ,\n        \n          a\n          \n            n\n            −\n            1\n          \n        \n        ,\n        \n          a\n          \n            n\n            −\n            2\n          \n        \n        ,\n        …\n        ,\n        \n          a\n          \n            0\n          \n        \n        ∈\n        R\n        }\n      \n    \n    {\\displaystyle \\{a_{n}x^{n}+a_{n-1}x^{n-1}+a_{n-2}x^{n-2}+\\ldots +a_{1}x+a_{0}|a_{n},a_{n-1},a_{n-2},\\ldots ,a_{0}\\in R\\}}\n  \n with addition defined by \n  \n    \n      \n        \n          (\n          \n            ∑\n            \n              i\n            \n          \n          \n            a\n            \n              i\n            \n          \n          \n            x\n            \n              i\n            \n          \n          )\n        \n        +\n        \n          (\n          \n            ∑\n            \n              i\n            \n          \n          \n            b\n            \n              i\n            \n          \n          \n            x\n            \n              i\n            \n          \n          )\n        \n        =\n        \n          ∑\n          \n            i\n          \n        \n        (\n        \n          a\n          \n            i\n          \n        \n        +\n        \n          b\n          \n            i\n          \n        \n        )\n        \n          x\n          \n            i\n          \n        \n      \n    \n    {\\displaystyle \\left(\\sum _{i}a_{i}x^{i}\\right)+\\left(\\sum _{i}b_{i}x^{i}\\right)=\\sum _{i}(a_{i}+b_{i})x^{i}}\n  \n, and with multiplication defined by \n  \n    \n      \n        \n          (\n          \n            ∑\n            \n              i\n            \n          \n          \n            a\n            \n              i\n            \n          \n          \n            x\n            \n              i\n            \n          \n          )\n        \n        ⋅\n        \n          (\n          \n            ∑\n            \n              j\n            \n          \n          \n            b\n            \n              j\n            \n          \n          \n            x\n            \n              j\n            \n          \n          )\n        \n        =\n        \n          ∑\n          \n            k\n          \n        \n        \n          (\n          \n            ∑\n            \n              i\n              ,\n              j\n              :\n              i\n              +\n              j\n              =\n              k\n            \n          \n          \n            a\n            \n              i\n            \n          \n          \n            b\n            \n              j\n            \n          \n          )\n        \n        \n          x\n          \n            k\n          \n        \n      \n    \n    {\\displaystyle \\left(\\sum _{i}a_{i}x^{i}\\right)\\cdot \\left(\\sum _{j}b_{j}x^{j}\\right)=\\sum _{k}\\left(\\sum _{i,j:i+j=k}a_{i}b_{j}\\right)x^{k}}\n  \n.", 
            "link": "/wiki/Polynomial_ring", 
            "name": "polynomial ring"
        }, 
        {
            "def": "Given R a ring and an endomorphism \n  \n    \n      \n        σ\n        ∈\n        \n          \n            End\n          \n        \n        (\n        R\n        )\n      \n    \n    {\\displaystyle \\sigma \\in {\\textrm {End}}(R)}\n  \n of R. The skew polynomial ring \n  \n    \n      \n        R\n        [\n        x\n        ;\n        σ\n        ]\n      \n    \n    {\\displaystyle R[x;\\sigma ]}\n  \n is defined to be the set \n  \n    \n      \n        {\n        \n          a\n          \n            n\n          \n        \n        \n          x\n          \n            n\n          \n        \n        +\n        \n          a\n          \n            n\n            −\n            1\n          \n        \n        \n          x\n          \n            n\n            −\n            1\n          \n        \n        +\n        \n          a\n          \n            n\n            −\n            2\n          \n        \n        \n          x\n          \n            n\n            −\n            2\n          \n        \n        +\n        …\n        +\n        \n          a\n          \n            1\n          \n        \n        x\n        +\n        \n          a\n          \n            0\n          \n        \n        \n          |\n        \n        \n          a\n          \n            n\n          \n        \n        ,\n        \n          a\n          \n            n\n            −\n            1\n          \n        \n        ,\n        \n          a\n          \n            n\n            −\n            2\n          \n        \n        ,\n        …\n        ,\n        \n          a\n          \n            0\n          \n        \n        ∈\n        R\n        }\n      \n    \n    {\\displaystyle \\{a_{n}x^{n}+a_{n-1}x^{n-1}+a_{n-2}x^{n-2}+\\ldots +a_{1}x+a_{0}|a_{n},a_{n-1},a_{n-2},\\ldots ,a_{0}\\in R\\}}\n  \n, with addition defined as usual, and multiplication defined by the relation \n  \n    \n      \n        x\n        a\n        =\n        σ\n        (\n        a\n        )\n        x\n        \n        ∀\n        a\n        ∈\n        R\n      \n    \n    {\\displaystyle xa=\\sigma (a)x\\;\\forall a\\in R}\n  \n.", 
            "link": "/wiki/Polynomial_ring#Differential_and_skew-polynomial_rings", 
            "name": "skew polynomial ring"
        }, 
        {
            "def": "The characteristic of a ring is the smallest positive integer n satisfying nx = 0 for all elements x of the ring, if such an n exists. Otherwise, the characteristic is 0.", 
            "link": null, 
            "name": "characteristic "
        }, 
        {
            "def": "The maximal length of a strictly increasing chain of prime ideals in the ring.", 
            "link": null, 
            "name": "Krull dimension of a commutative ring "
        }, 
        {
            "def": "A structure that is a group under addition, a semigroup under multiplication, and whose multiplication distributes on the right over addition.", 
            "link": null, 
            "name": "nearring"
        }, 
        {
            "def": "An algebraic structure satisfying the same properties as a ring, except that multiplication need not have an identity element. The term \"rng\" is meant to suggest that it is a \"ring\" without an \"identity\".", 
            "link": null, 
            "name": "rng (or pseudo-ring)"
        }, 
        {
            "def": "An algebraic structure satisfying the same properties as a ring, except that addition need only be an abelian monoid operation, rather than an abelian group operation. That is, elements in a semiring need not have additive inverses.", 
            "link": null, 
            "name": "semiring "
        }
    ]
}