{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_Riemannian_and_metric_geometry", 
    "words": [
        {
            "def": "Alexandrov space a generalization of Riemannian manifolds with upper, lower or integral curvature bounds (the last one works only in dimension 2)", 
            "link": null, 
            "name": "Alexandrov space"
        }, 
        {
            "def": "Arc-wise isometry the same as path isometry.", 
            "link": null, 
            "name": "Arc-wise isometry"
        }, 
        {
            "def": "Autoparallel the same as totally geodesic", 
            "link": null, 
            "name": "Autoparallel"
        }, 
        {
            "def": "Barycenter, see center of mass.", 
            "link": null, 
            "name": "Barycenter"
        }, 
        {
            "def": "bi-Lipschitz map. A map \n  \n    \n      \n        f\n        :\n        X\n        →\n        Y\n      \n    \n    {\\displaystyle f:X\\to Y}\n  \n is called bi-Lipschitz if there are positive constants c and C such that for any x and y in X", 
            "link": null, 
            "name": "bi-Lipschitz map."
        }, 
        {
            "def": "Busemann function given a ray, γ : [0, ∞)→X, the Busemann function is defined by", 
            "link": "/wiki/Busemann_function", 
            "name": "Busemann function"
        }, 
        {
            "def": "Cartan–Hadamard theorem is the statement that a connected, simply connected complete Riemannian manifold with non-positive sectional curvature is diffeomorphic to Rn via the exponential map; for metric spaces, the statement that a connected, simply connected complete geodesic metric space with non-positive curvature in the sense of Alexandrov is a (globally) CAT(0) space.", 
            "link": "/wiki/Cartan%E2%80%93Hadamard_theorem", 
            "name": "Cartan–Hadamard theorem"
        }, 
        {
            "def": "Cartan extended Einstein's General relativity to Einstein-Cartan theory, using Riemannian-Cartan geometry instead of Riemannian geometry. This extension provides affine torsion, which allows for non-symmetric curvature tensors and the incorporation of spin-orbit coupling.", 
            "link": "/wiki/%C3%89lie_Cartan", 
            "name": "Cartan"
        }, 
        {
            "def": "Center of mass. A point q ∈ M is called the center of mass of the points \n  \n    \n      \n        \n          p\n          \n            1\n          \n        \n        ,\n        \n          p\n          \n            2\n          \n        \n        ,\n        …\n        ,\n        \n          p\n          \n            k\n          \n        \n      \n    \n    {\\displaystyle p_{1},p_{2},\\dots ,p_{k}}\n  \n if it is a point of global minimum of the function", 
            "link": null, 
            "name": "Center of mass"
        }, 
        {
            "def": "Conformal map is a map which preserves angles.", 
            "link": "/wiki/Conformal_map", 
            "name": "Conformal map"
        }, 
        {
            "def": "Conformally flat a M is conformally flat if it is locally conformally equivalent to a Euclidean space, for example standard sphere is conformally flat.", 
            "link": null, 
            "name": "Conformally flat"
        }, 
        {
            "def": "Conjugate points two points p and q on a geodesic \n  \n    \n      \n        γ\n      \n    \n    {\\displaystyle \\gamma }\n  \n are called conjugate if there is a Jacobi field on \n  \n    \n      \n        γ\n      \n    \n    {\\displaystyle \\gamma }\n  \n which has a zero at p and q.", 
            "link": "/wiki/Conjugate_points", 
            "name": "Conjugate points"
        }, 
        {
            "def": "Convex function. A function f on a Riemannian manifold is a convex if for any geodesic \n  \n    \n      \n        γ\n      \n    \n    {\\displaystyle \\gamma }\n  \n the function \n  \n    \n      \n        f\n        ∘\n        γ\n      \n    \n    {\\displaystyle f\\circ \\gamma }\n  \n is convex. A function f is called \n  \n    \n      \n        λ\n      \n    \n    {\\displaystyle \\lambda }\n  \n-convex if for any geodesic \n  \n    \n      \n        γ\n      \n    \n    {\\displaystyle \\gamma }\n  \n with natural parameter \n  \n    \n      \n        t\n      \n    \n    {\\displaystyle t}\n  \n, the function \n  \n    \n      \n        f\n        ∘\n        γ\n        (\n        t\n        )\n        −\n        λ\n        \n          t\n          \n            2\n          \n        \n      \n    \n    {\\displaystyle f\\circ \\gamma (t)-\\lambda t^{2}}\n  \n is convex.", 
            "link": "/wiki/Geodesic_convexity", 
            "name": "Convex function."
        }, 
        {
            "def": "Convex A subset K of a Riemannian manifold M is called convex if for any two points in K there is a shortest path connecting them which lies entirely in K, see also totally convex.", 
            "link": "/wiki/Geodesic_convexity", 
            "name": "Convex"
        }, 
        {
            "def": "Diameter of a metric space is the supremum of distances between pairs of points.", 
            "link": null, 
            "name": "Diameter"
        }, 
        {
            "def": "Developable surface is a surface isometric to the plane.", 
            "link": "/wiki/Developable_surface", 
            "name": "Developable surface"
        }, 
        {
            "def": "Dilation of a map between metric spaces is the infimum of numbers L such that the given map is L-Lipschitz.", 
            "link": null, 
            "name": "Dilation"
        }, 
        {
            "def": "Exponential map: Exponential map (Lie theory), Exponential map (Riemannian geometry)", 
            "link": null, 
            "name": "Exponential map"
        }, 
        {
            "def": "First fundamental form for an embedding or immersion is the pullback of the metric tensor.", 
            "link": "/wiki/First_fundamental_form", 
            "name": "First fundamental form"
        }, 
        {
            "def": "Geodesic is a curve which locally minimizes distance.", 
            "link": "/wiki/Geodesic", 
            "name": "Geodesic"
        }, 
        {
            "def": "Geodesic flow is a flow on a tangent bundle TM of a manifold M, generated by a vector field whose trajectories are of the form \n  \n    \n      \n        (\n        γ\n        (\n        t\n        )\n        ,\n        \n          γ\n          ′\n        \n        (\n        t\n        )\n        )\n      \n    \n    {\\displaystyle (\\gamma (t),\\gamma '(t))}\n  \n where \n  \n    \n      \n        γ\n      \n    \n    {\\displaystyle \\gamma }\n  \n is a geodesic.", 
            "link": "/wiki/Geodesic_flow", 
            "name": "Geodesic flow"
        }, 
        {
            "def": "Geodesic metric space is a metric space where any two points are the endpoints of a minimizing geodesic.", 
            "link": null, 
            "name": "Geodesic metric space"
        }, 
        {
            "def": "Hadamard space is a complete simply connected space with nonpositive curvature.", 
            "link": null, 
            "name": "Hadamard space"
        }, 
        {
            "def": "Horosphere a level set of Busemann function.", 
            "link": "/wiki/Horosphere", 
            "name": "Horosphere"
        }, 
        {
            "def": "Injectivity radius The injectivity radius at a point p of a Riemannian manifold is the largest radius for which the exponential map at p is a diffeomorphism. The injectivity radius of a Riemannian manifold is the infimum of the injectivity radii at all points. See also cut locus.", 
            "link": null, 
            "name": "Injectivity radius"
        }, 
        {
            "def": "For complete manifolds, if the injectivity radius at p is a finite number r, then either there is a geodesic of length 2r which starts and ends at p or there is a point q conjugate to p (see conjugate point above) and on the distance r from p. For a closed Riemannian manifold the injectivity radius is either half the minimal length of a closed geodesic or the minimal distance between conjugate points on a geodesic.", 
            "link": null, 
            "name": "conjugate point"
        }, 
        {
            "def": "Infranilmanifold Given a simply connected nilpotent Lie group N acting on itself by left multiplication and a finite group of automorphisms F of N one can define an action of the semidirect product \n  \n    \n      \n        N\n        ⋊\n        F\n      \n    \n    {\\displaystyle N\\rtimes F}\n  \n on N. An orbit space of N by a discrete subgroup of \n  \n    \n      \n        N\n        ⋊\n        F\n      \n    \n    {\\displaystyle N\\rtimes F}\n  \n which acts freely on N is called an infranilmanifold. An infranilmanifold is finitely covered by a nilmanifold.", 
            "link": null, 
            "name": "Infranilmanifold"
        }, 
        {
            "def": "Isometry is a map which preserves distances.", 
            "link": "/wiki/Isometry", 
            "name": "Isometry"
        }, 
        {
            "def": "Jacobi field A Jacobi field is a vector field on a geodesic γ which can be obtained on the following way: Take a smooth one parameter family of geodesics \n  \n    \n      \n        \n          γ\n          \n            τ\n          \n        \n      \n    \n    {\\displaystyle \\gamma _{\\tau }}\n  \n with \n  \n    \n      \n        \n          γ\n          \n            0\n          \n        \n        =\n        γ\n      \n    \n    {\\displaystyle \\gamma _{0}=\\gamma }\n  \n, then the Jacobi field is described by", 
            "link": "/wiki/Jacobi_field", 
            "name": "Jacobi field"
        }, 
        {
            "def": "Length metric the same as intrinsic metric.", 
            "link": null, 
            "name": "Length metric"
        }, 
        {
            "def": "Levi-Civita connection is a natural way to differentiate vector fields on Riemannian manifolds.", 
            "link": "/wiki/Levi-Civita_connection", 
            "name": "Levi-Civita connection"
        }, 
        {
            "def": "Lipschitz convergence the convergence defined by Lipschitz metric.", 
            "link": null, 
            "name": "Lipschitz convergence"
        }, 
        {
            "def": "Lipschitz distance between metric spaces is the infimum of numbers r such that there is a bijective bi-Lipschitz map between these spaces with constants exp(-r), exp(r).", 
            "link": null, 
            "name": "Lipschitz distance"
        }, 
        {
            "def": "Logarithmic map is a right inverse of Exponential map.", 
            "link": null, 
            "name": "Logarithmic map"
        }, 
        {
            "def": "Minimal surface is a submanifold with (vector of) mean curvature zero.", 
            "link": "/wiki/Minimal_surface", 
            "name": "Minimal surface"
        }, 
        {
            "def": "Natural parametrization is the parametrization by length.", 
            "link": null, 
            "name": "Natural parametrization"
        }, 
        {
            "def": "Net. A sub set S of a metric space X is called \n  \n    \n      \n        ϵ\n      \n    \n    {\\displaystyle \\epsilon }\n  \n-net if for any point in X there is a point in S on the distance \n  \n    \n      \n        ≤\n        ϵ\n      \n    \n    {\\displaystyle \\leq \\epsilon }\n  \n. This is distinct from topological nets which generalise limits.", 
            "link": null, 
            "name": "Net"
        }, 
        {
            "def": "Nilmanifold: An element of the minimal set of manifolds which includes a point, and has the following property: any oriented \n  \n    \n      \n        \n          S\n          \n            1\n          \n        \n      \n    \n    {\\displaystyle S^{1}}\n  \n-bundle over a nilmanifold is a nilmanifold. It also can be defined as a factor of a connected nilpotent Lie group by a lattice.", 
            "link": "/wiki/Nilmanifold", 
            "name": "Nilmanifold"
        }, 
        {
            "def": "Normal bundle: associated to an imbedding of a manifold M into an ambient Euclidean space \n  \n    \n      \n        \n          \n            \n              R\n            \n          \n          \n            N\n          \n        \n      \n    \n    {\\displaystyle {\\mathbb {R} }^{N}}\n  \n, the normal bundle is a vector bundle whose fiber at each point p is the orthogonal complement (in \n  \n    \n      \n        \n          \n            \n              R\n            \n          \n          \n            N\n          \n        \n      \n    \n    {\\displaystyle {\\mathbb {R} }^{N}}\n  \n) of the tangent space \n  \n    \n      \n        \n          T\n          \n            p\n          \n        \n        M\n      \n    \n    {\\displaystyle T_{p}M}\n  \n.", 
            "link": null, 
            "name": "Normal bundle"
        }, 
        {
            "def": "Nonexpanding map same as short map", 
            "link": null, 
            "name": "Nonexpanding map"
        }, 
        {
            "def": "Polyhedral space a simplicial complex with a metric such that each simplex with induced metric is isometric to a simplex in Euclidean space.", 
            "link": "/wiki/Polyhedral_space", 
            "name": "Polyhedral space"
        }, 
        {
            "def": "Principal curvature is the maximum and minimum normal curvatures at a point on a surface.", 
            "link": "/wiki/Principal_curvature", 
            "name": "Principal curvature"
        }, 
        {
            "def": "Principal direction is the direction of the principal curvatures.", 
            "link": null, 
            "name": "Principal direction"
        }, 
        {
            "def": "Proper metric space is a metric space in which every closed ball is compact. Every proper metric space is complete.", 
            "link": null, 
            "name": "Proper metric space"
        }, 
        {
            "def": "Quasigeodesic has two meanings; here we give the most common. A map \n  \n    \n      \n        f\n        :\n        I\n        →\n        Y\n      \n    \n    {\\displaystyle f:I\\to Y}\n  \n (where \n  \n    \n      \n        I\n        ⊆\n        \n          R\n        \n      \n    \n    {\\displaystyle I\\subseteq \\mathbb {R} }\n  \n is a subsegment) is called a quasigeodesic if there are constants \n  \n    \n      \n        K\n        ≥\n        1\n      \n    \n    {\\displaystyle K\\geq 1}\n  \n and \n  \n    \n      \n        C\n        ≥\n        0\n      \n    \n    {\\displaystyle C\\geq 0}\n  \n such that for every \n  \n    \n      \n        x\n        ,\n        y\n        ∈\n        I\n      \n    \n    {\\displaystyle x,y\\in I}\n  \n", 
            "link": null, 
            "name": "Quasigeodesic"
        }, 
        {
            "def": "Quasi-isometry. A map \n  \n    \n      \n        f\n        :\n        X\n        →\n        Y\n      \n    \n    {\\displaystyle f:X\\to Y}\n  \n is called a quasi-isometry if there are constants \n  \n    \n      \n        K\n        ≥\n        1\n      \n    \n    {\\displaystyle K\\geq 1}\n  \n and \n  \n    \n      \n        C\n        ≥\n        0\n      \n    \n    {\\displaystyle C\\geq 0}\n  \n such that", 
            "link": "/wiki/Quasi-isometry", 
            "name": "Quasi-isometry."
        }, 
        {
            "def": "and every point in Y has distance at most C from some point of f(X). Note that a quasi-isometry is not assumed to be continuous. For example any map between compact metric spaces is a quasi isometry. If there exists a quasi-isometry from X to Y, then X and Y are said to be quasi-isometric.", 
            "link": null, 
            "name": "quasi-isometric"
        }, 
        {
            "def": "Radius of metric space is the infimum of radii of metric balls which contain the space completely.", 
            "link": null, 
            "name": "Radius"
        }, 
        {
            "def": "Radius of convexity at a point p of a Riemannian manifold is the largest radius of a ball which is a convex subset.", 
            "link": null, 
            "name": "Radius of convexity"
        }, 
        {
            "def": "Ray is a one side infinite geodesic which is minimizing on each interval", 
            "link": null, 
            "name": "Ray"
        }, 
        {
            "def": "Riemannian submersion is a map between Riemannian manifolds which is submersion and submetry at the same time.", 
            "link": "/wiki/Riemannian_submersion", 
            "name": "Riemannian submersion"
        }, 
        {
            "def": "Second fundamental form is a quadratic form on the tangent space of hypersurface, usually denoted by II, an equivalent way to describe the shape operator of a hypersurface,", 
            "link": "/wiki/Second_fundamental_form", 
            "name": "Second fundamental form"
        }, 
        {
            "def": "Shape operator for a hypersurface M is a linear operator on tangent spaces, Sp: TpM→TpM. If n is a unit normal field to M and v is a tangent vector then", 
            "link": null, 
            "name": "Shape operator"
        }, 
        {
            "def": "Short map is a distance non increasing map.", 
            "link": "/wiki/Short_map", 
            "name": "Short map"
        }, 
        {
            "def": "Sol manifold is a factor of a connected solvable Lie group by a lattice.", 
            "link": "/wiki/Sol_manifold", 
            "name": "Sol manifold"
        }, 
        {
            "def": "Submetry a short map f between metric spaces is called a submetry if there exists R > 0 such that for any point x and radius r < R we have that image of metric r-ball is an r-ball, i.e.", 
            "link": null, 
            "name": "Submetry"
        }, 
        {
            "def": "Systole. The k-systole of M, \n  \n    \n      \n        s\n        y\n        s\n        \n          t\n          \n            k\n          \n        \n        (\n        M\n        )\n      \n    \n    {\\displaystyle syst_{k}(M)}\n  \n, is the minimal volume of k-cycle nonhomologous to zero.", 
            "link": "/wiki/Systolic_geometry", 
            "name": "Systole"
        }, 
        {
            "def": "Totally convex. A subset K of a Riemannian manifold M is called totally convex if for any two points in K any geodesic connecting them lies entirely in K, see also convex.", 
            "link": null, 
            "name": "Totally convex."
        }, 
        {
            "def": "Totally geodesic submanifold is a submanifold such that all geodesics in the submanifold are also geodesics of the surrounding manifold.", 
            "link": null, 
            "name": "Totally geodesic"
        }, 
        {
            "def": "Uniquely geodesic metric space is a metric space where any two points are the endpoints of a unique minimizing geodesic.", 
            "link": null, 
            "name": "Uniquely geodesic metric space"
        }, 
        {
            "def": "Word metric on a group is a metric of the Cayley graph constructed using a set of generators.", 
            "link": "/wiki/Word_metric", 
            "name": "Word metric"
        }
    ]
}