{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_Christianity", 
    "words": [
        {
            "def": "Advent - a season observed in many Western Christian churches, a time of expectant waiting and preparation for the celebration of the Nativity of Jesus at Christmas.", 
            "link": "/wiki/Advent", 
            "name": "Advent"
        }, 
        {
            "def": "Almah a girl who has reached puberty but is still under the shielding protection of her family. For theological reasons, the meaning and definition of this word (especially the definition of \"virgin\") can be controversial, particularly when applied to Isaiah 7:14.", 
            "link": "/wiki/Almah", 
            "name": "Almah"
        }, 
        {
            "def": "Amen - the word Amen (Hebrew: אָמֵן, Modern Amen, Tiberian 'Āmēn ; Arabic: آمين‎‎, ’Āmīn ; \"So be it; truly\"[1]) is a declaration of affirmation[2][3] found in the Hebrew Bible and the New Testament.[1] It has always been in use within Judaism, and would find its way into Islam. It has been generally adopted in Christian worship as a concluding formula for prayers and hymns.[3] Common English translations of the word amen include: \"Verily\", \"Truly\", \"So be it\", and \"Let it be\".[1] It can also be used colloquially to express strong agreement,[3] as in, for instance, amen to that..[4]", 
            "link": "/wiki/Amen", 
            "name": "Amen"
        }, 
        {
            "def": "Ancient of Days - a name for God in Aramaic: Atik Yomin; in the Greek Septuagint: Palaios Hemeron; and in the Vulgate: Antiquus Dierum.", 
            "link": "/wiki/Ancient_of_Days", 
            "name": "Ancient of Days"
        }, 
        {
            "def": "Anno Domini (A.D.) - Latin term for Year of the Lord, the Lord in this case being Jesus, by Christian reckoning, the Messiah. Due to western dominance of the world, this has become the common world calendar system, though many cultures separately maintain their own calendars based on various events. Recently, the terms \"Common Era\" (C.E.) and \"Anno Mundi\" (A.M.) have come into use.", 
            "link": "/wiki/Anno_Domini", 
            "name": "Anno Domini (A.D.)"
        }, 
        {
            "def": "Anointing - to pour or smear with perfumed oil, milk, water, melted butter or other substances. People and things are anointed to symbolize the introduction of a sacramental or divine influence, a holy emanation, spirit, power or god.", 
            "link": "/wiki/Anointing", 
            "name": "Anointing"
        }, 
        {
            "def": "Antichrist - in Christian eschatology, the Antichrist or anti-Christ, has come to mean a person, another entity, or an image of a person, that is an embodiment of evil. The word 'Antichrist' is translated from the combination of two ancient Greek words αντί + χριστος ('anti + khristos), which can mean anti \"opposite\" (of) khristos \"anointed\" therefore \"opposite of Christ\" (the meaning of christ as the 'anointed one', having become secondary to its meaning as the honorific of Jesus of Nazareth) or anti \"as\" (if) khristos \"messiah\" thus \"in place of Christ\" or a substitute for Christ.", 
            "link": "/wiki/Antichrist", 
            "name": "Antichrist"
        }, 
        {
            "def": "Antilegomena - was an epithet used by the Church Fathers to denote those books of the New Testament which, although sometimes publicly read in the churches, were not — for a considerable amount of time — considered to be genuine, or received into the canon of Scripture. They were thus contrasted with the \"Homologoumena\" (from Greek ομολογουμένα), or universally acknowledged writings", 
            "link": "/wiki/Antilegomena", 
            "name": "Antilegomena"
        }, 
        {
            "def": "Antinomianism - in theology, is the idea that members of a particular religious group are under no obligation to obey the laws of ethics or morality, and that salvation is by predestination only", 
            "link": "/wiki/Antinomianism", 
            "name": "Antinomianism"
        }, 
        {
            "def": "Apocalypse - any prophetic revelation or so-called End Time scenario, or to the end of the world in general", 
            "link": "/wiki/Apocalypse", 
            "name": "Apocalypse"
        }, 
        {
            "def": "Apostasy - (from Greek αποστασία, meaning a defection or revolt, from απο, apo, \"away, apart\", στασις, stasis, \"standing\") is a term generally employed to describe the formal abandonment or renunciation of one's religion, especially if the motive is deemed unworthy. In a technical sense, as used sometimes by sociologists without the pejorative connotations of the word, the term refers to renunciation and criticism of, or opposition to, one's former religion", 
            "link": "/wiki/Apostasy", 
            "name": "Apostasy"
        }, 
        {
            "def": "Apostle - (Ἀπόστολος, apostolos, \"someone sent out\", e.g. with a message or as a delegate) were, according to the Synoptic Gospels and Christian tradition, disciples (followers) whom Jesus of Nazareth had chosen, named, and trained in order to send them on a specific mission.", 
            "link": "/wiki/Apostle_(Christian)", 
            "name": "Apostle"
        }, 
        {
            "def": "Apostolic Age - traditionally the period of the Twelve Apostles, dating from the Crucifixion of Jesus (c. 26–36) and the Great Commission until the death of John the Apostle", 
            "link": "/wiki/Apostolic_Age", 
            "name": "Apostolic Age"
        }, 
        {
            "def": "Apostolic Decree - Acts 15:19-21 See Council of Jerusalem", 
            "link": "/wiki/Apostolic_Decree", 
            "name": "Apostolic Decree"
        }, 
        {
            "def": "Aramaic - believed to be the primary language of Jesus.", 
            "link": "/wiki/Aramaic_of_Jesus", 
            "name": "Aramaic"
        }, 
        {
            "def": "Ascension of Jesus - a Christian doctrine that says Jesus ascended to heaven in the presence of his Eleven Apostles following his resurrection, and that in heaven he sits at the right hand of God the Father", 
            "link": "/wiki/Ascension_of_Jesus", 
            "name": "Ascension of Jesus"
        }, 
        {
            "def": "Atonement - a doctrine found within both Christianity and Judaism. It describes how sin can be forgiven by God. In Judaism, Atonement is said to be the process of forgiving or pardoning a transgression. This was originally accomplished through rituals performed by a High Priest on the holiest day of the Jewish year: Yom Kippur (Day of Atonement). In Christian theology the atonement refers to the forgiving or pardoning of sin through the crucifixion of Jesus Christ which made possible the reconciliation between God and man. Within Christianity there are numerous technical theories for how such atonement might work, including the ransom theory, the Abelardian theory, the substitutionary atonement theory with its variations, and the Anselmian satisfaction theory.", 
            "link": "/wiki/Atonement_in_Christianity", 
            "name": "Atonement"
        }, 
        {
            "def": "Baptism - baptism (Greek βάπτισμα and βαπτισμός, from βαπτίζω, baptizô, immerse, perform ablutions) is a religious act of purification by water usually associated with admission to membership or fullness of membership of Christianity.", 
            "link": "/wiki/Baptism", 
            "name": "Baptism"
        }, 
        {
            "def": "Bauer lexicon - the standard English lexicon of Biblical Greek.", 
            "link": "/wiki/Bauer_lexicon", 
            "name": "Bauer lexicon"
        }, 
        {
            "def": "Christ - the English term for the Greek word Χριστός (Christós), which literally means \"The Anointed One.\" The Hebrew word for Christ is מָשִׁיחַ (Mašíaḥ, usually transliterated Messiah). The word may be misunderstood by some as being the surname of Jesus due to the frequent juxtaposition of Jesus and Christ in the Christian Bible and other Christian writings. Often used as a more formal-sounding synonym for Jesus, the word is in fact a title, hence its common reciprocal use Christ Jesus, meaning The Anointed One, Jesus.", 
            "link": "/wiki/Christ", 
            "name": "Christ"
        }, 
        {
            "def": "Christendom - In a cultural sense, it refers to the religion itself, or to the worldwide community of Christians, adherents of Christianity.[5] or refer collectively to Christian majority countries or countries in which Christian civilization dominates[6] or nations in which Christianity is the established religion.", 
            "link": "/wiki/Christendom", 
            "name": "Christendom"
        }, 
        {
            "def": "Christian - a person who adheres to Christianity, a monotheistic[7] religion centered on the life and teachings of Jesus Christ as presented in the New Testament[8] and prophesied in the Old Testament.[9]", 
            "link": "/wiki/Christian", 
            "name": "Christian"
        }, 
        {
            "def": "Church of the Holy Sepulchre - traditionally believed to be the site of Golgatha and the Empty tomb.", 
            "link": "/wiki/Church_of_the_Holy_Sepulchre", 
            "name": "Church of the Holy Sepulchre"
        }, 
        {
            "def": "Circumcision controversy in early Christianity - Jesus and Paul and presumably the Jewish Christians were circumcised according to biblical tradition, the Council of Jerusalem made the practice optional for converts as is the case today among most Christians.", 
            "link": "/wiki/Circumcision_controversy_in_early_Christianity", 
            "name": "Circumcision controversy in early Christianity"
        }, 
        {
            "def": "Easter - Easter, Pascha, or Resurrection Day, is an important religious feast in the Christian liturgical year. It celebrates the resurrection of Jesus, which Christians believe occurred on the third day after his crucifixion some time in the period AD 27 to 33. Easter also refers to the season of the church year called Eastertide or the Easter Season. Traditionally the Easter Season lasted for the forty days from Easter Day until Ascension Day but now officially lasts for the fifty days until Pentecost. The first week of the Easter Season is known as Easter Week or the Octave of Easter. See also Easter controversy.", 
            "link": "/wiki/Easter", 
            "name": "Easter"
        }, 
        {
            "def": "Eucharist - also known as Communion, and the Lord's Supper.", 
            "link": "/wiki/Eucharist", 
            "name": "Eucharist"
        }, 
        {
            "def": "The Fig Tree - the tree and its fruit is mentioned several times in the New Testament, and in the Old Testament as well; but as more than just the common Mediterranean fruit tree, the Common Fig, it is also a symbol or type, subject to various interpretations. The Parable of the barren fig tree is a parable of Jesus recorded in the Gospel of Luke 13:6–9. The parable has no parallels in other gospels. A vinekeeper holds out hope that a barren fig tree will bear fruit next year.", 
            "link": "/wiki/Parable_of_the_barren_fig_tree", 
            "name": "The Fig Tree"
        }, 
        {
            "def": "God - most commonly refers to the deity worshipped by followers of monotheistic and monolatrist religions, whom they believe to be the creator and overseer of the universe.[10]", 
            "link": "/wiki/God", 
            "name": "God"
        }, 
        {
            "def": "Golden Rule - based on Leviticus 19:18 and summarized by Hillel the Elder as \"That which is hateful to you, do not do to your fellow\" and considered the central teaching of the Torah.[11] Summarized by Jesus as \"do to others what you would have them do to you\".[12]", 
            "link": "/wiki/Golden_Rule", 
            "name": "Golden Rule"
        }, 
        {
            "def": "Gospel - from the Old English for 'good news,' this refers to the good news concerning Jesus Christ. It can also refer to any one of the four canonical gospels, named for their traditional authors: the \"Gospel according to Saint Matthew,\" the \"Gospel according to Saint Mark,\" the \"Gospel according to Saint Luke,\" and the \"Gospel according to Saint John.\" The word \"gospel\" can also refer to the literal book which contains any one or all of these texts, which in \"high church\" traditions may be decorated ornately and given special liturgical prominence.", 
            "link": "/wiki/Gospel", 
            "name": "Gospel"
        }, 
        {
            "def": "Incarnation - in traditional Christianity is the belief that the second person of the Trinity, also known as God the Son or the Logos (Word), \"became flesh\" by being conceived in the womb of Mary, also known as the Theotokos (Birth-giver to God) or \"Mater Dei\" (mother of God).", 
            "link": "/wiki/Incarnation_(Christianity)", 
            "name": "Incarnation"
        }, 
        {
            "def": "Jewish Christians - were the original members of the Jewish movement that later became Christianity.", 
            "link": "/wiki/Jewish_Christian", 
            "name": "Jewish Christians"
        }, 
        {
            "def": "Judaizers - those who teach that Christians must observe Jewish laws and customs.", 
            "link": "/wiki/Judaizers", 
            "name": "Judaizers"
        }, 
        {
            "def": "Judeo-Christian - a term used by many Christians since the 1950s to encompass perceived common ethical values based on Christianity and Judaism.", 
            "link": "/wiki/Judeo-Christian", 
            "name": "Judeo-Christian"
        }, 
        {
            "def": "Koine Greek - Greek of the New Testament and Septuagint.", 
            "link": "/wiki/Koine_Greek", 
            "name": "Koine Greek"
        }, 
        {
            "def": "Legalism - in Christian theology, is the act of putting law above gospel by establishing requirements for salvation beyond repentance and faith in Jesus Christ and reducing the broad, inclusive and general precepts of the Bible to narrow and rigid moral codes.[13] It is an over-emphasis of discipline of conduct, or legal ideas, usually implying an allegation of misguided rigour, pride, superficiality, the neglect of mercy, and ignorance of the grace of God or emphasizing the letter of law at the expense of the spirit. Legalism is alleged against any view that obedience to law, not faith in God's grace, is the pre-eminent principle of redemption.", 
            "link": "/wiki/Legalism_(theology)", 
            "name": "Legalism"
        }, 
        {
            "def": "Leviticus 18 - the section of scripture usually cited during debates about homosexuality.", 
            "link": "/wiki/Leviticus_18", 
            "name": "Leviticus 18"
        }, 
        {
            "def": "Logos - (Greek: Λόγος logos, that is, \"word\", \"discourse\" or \"reason\" i.e., rationality or reasoning) is a name or title of Jesus Christ, seen as the pre-existent Second Person of a Trinitarian God. It has been important in endeavoring to establish the doctrine of the divinity and morality of Jesus Christ and his position as God the Son in the Trinity by Trinitarian theologians as set forth in the Chalcedonian Creed.", 
            "link": "/wiki/Logos_(Christianity)", 
            "name": "Logos"
        }, 
        {
            "def": "New Covenant - (Hebrew: ברית חדשה, berit hadashah ; Greek: διαθήκη καινή, diatheke kaine) is used in the Bible (both in the Hebrew Bible and the Greek New Testament) to refer to an epochal relationship of restoration and peace following a period of trial and judgment. As are all covenants between God and man described in the Bible, it is \"a bond in blood sovereignly administered by God.\" [14]", 
            "link": "/wiki/New_Covenant", 
            "name": "New Covenant"
        }, 
        {
            "def": "New Testament (sometimes called the \"new covenant\") - translation of the Greek καινή διαθήκη. Western Christianity so names its Greek scriptures to distinguish them from the Hebrew scriptures (\"Old Testament\"). It consists of \"Gospels,\" Epistles, and the Apocalypse (Revelation). The term (new covenant) comes from 1 Cor. 11:25 and its parallel (Luke 22:20) in which Jesus institutes the Christian eucharist.", 
            "link": "/wiki/New_Testament", 
            "name": "New Testament"
        }, 
        {
            "def": "Old Testament - name used by Western Christians for the Hebrew scriptures to distinguish them from the Greek scriptures, which they call the \"New Testament\". In the New Testament the Hebrew scriptures are simply denoted \"the scriptures\" or \"the holy scriptures\" (Matt. 21:42, John 5:39, 2 Tim. 3:15-16). Some Western Christians suggest a more neutral term, such as Hebrew Bible.", 
            "link": "/wiki/Old_Testament", 
            "name": "Old Testament"
        }, 
        {
            "def": "Papal infallibility -", 
            "link": "/wiki/Papal_infallibility", 
            "name": "Papal infallibility"
        }, 
        {
            "def": "Parousia - advent or appearance of the Messiah and the Messianic Age.", 
            "link": "/wiki/Parousia", 
            "name": "Parousia"
        }, 
        {
            "def": "Pentateuch - the first five books of the Bible, i.e. Genesis, Exodus, Leviticus, Numbers, Deuteronomy, traditionally attributed to Moses, hence also the Mosaic Law. See also Samaritan Pentateuch.", 
            "link": "/wiki/Torah", 
            "name": "Pentateuch"
        }, 
        {
            "def": "Peshitta - the standard version of the Bible for churches in Syriac Christianity.", 
            "link": "/wiki/Peshitta", 
            "name": "Peshitta"
        }, 
        {
            "def": "Pharisees - The Pharisees were at various times a political party, a social movement, and a school of thought in the Holy Land during the time of Second Temple Judaism (536 BCE–70 CE). After the destruction of the Second Temple in 70 CE, Pharisaic beliefs became the foundational, liturgical and ritualistic basis for Rabbinic Judaism.", 
            "link": "/wiki/Pharisees", 
            "name": "Pharisees"
        }, 
        {
            "def": "Predestination - in theology, is the doctrine that all events have been willed by God, usually with reference to the eventual fate of the individual soul.", 
            "link": "/wiki/Predestination", 
            "name": "Predestination"
        }, 
        {
            "def": "Premillennialism - the belief that Jesus will physically return to the earth before the Millennium, a literal thousand-year golden age of peace.", 
            "link": "/wiki/Premillennialism", 
            "name": "Premillennialism"
        }, 
        {
            "def": "Propitiation - is the act of appeasing or making well-disposed a deity, thus incurring divine favor or avoiding divine retribution.", 
            "link": "/wiki/Propitiation", 
            "name": "Propitiation"
        }, 
        {
            "def": "Proselyte - an anglicization of the Koine Greek term προσήλυτος (proselytos), as used in the Septuagint (Greek Old Testament) for \"stranger\", i.e. a \"newcomer to Israel\";[15] a \"sojourner in the land\",[16] and in the Greek New Testament[17] for a first century convert to Judaism, generally from Ancient Greek religion. It is a translation of the Biblical Hebrew phrase גר תושב (ger toshav).[18]", 
            "link": "/wiki/Proselyte", 
            "name": "Proselyte"
        }, 
        {
            "def": "Quartodecimanism - part of the Easter controversy.", 
            "link": "/wiki/Quartodecimanism", 
            "name": "Quartodecimanism"
        }, 
        {
            "def": "Rapture - the belief that either before, or simultaneously with, the Second Coming of Jesus Christ to earth, believers who have died will be raised and believers who are still alive and remain shall be caught up together with them (the resurrected dead believers) in the clouds to meet the Lord in the air.[19][20]", 
            "link": "/wiki/Rapture", 
            "name": "Rapture"
        }, 
        {
            "def": "Remez/Allegory - (from Greek αλλος, allos, \"other\", and αγορευειν, agoreuein, \"to speak in public\") is a figurative mode of representation conveying a meaning other than the literal. Generally treated as a figure of rhetoric, but an allegory does not have to be expressed in language: it may be addressed to the eye, and is often found in realistic painting, sculpture or some other form of mimetic, or representative art. In allegorical representations, relationships between elements of a text or composition are understood to stand for different relationships between elements not found in the text or composition; meaning is thus constituted through the difference between the superficial (or literal) meaning of the text or composition, and a \"deeper\" meaning. In Jewish thought this method is best known through the works of Philo. The extreme form of remez, sod, understands the Tanakh as an allegory for a mystical understanding of the universe and as a means for mystical communion with God; this approach is best known through Kabbalistic texts such as the Zohar. Traditionally, only Jews who have mastered the midrashic method and the corpus of halakha are encouraged to pursue this form of interpretation. In Christianity this method was first promoted by Saint Paul.", 
            "link": "/wiki/Christian_Kabbalah", 
            "name": "Remez/Allegory"
        }, 
        {
            "def": "Sabbath in seventh-day churches - Sabbath is generally a weekly religious day of rest as ordained by the Ten Commandments. Originally denoting a rest day on the seventh day of the week, the term \"Sabbath\" has acquired the connotation of a time of communal worship and now has several meanings in Christian contexts.", 
            "link": "/wiki/Sabbath_in_seventh-day_churches", 
            "name": "Sabbath in seventh-day churches"
        }, 
        {
            "def": "Seven Laws of Noah - according to Judaism, these are the laws applicable to non-Jews, some see a connection to the Apostolic Decree of the Council of Jerusalem.", 
            "link": "/wiki/Seven_Laws_of_Noah", 
            "name": "Seven Laws of Noah"
        }, 
        {
            "def": "Shema Yisrael - in Mark 12:28–34 Jesus refers to the Shema as the first commandment (in importance.)[21]", 
            "link": "/wiki/Shema_Yisrael", 
            "name": "Shema Yisrael"
        }, 
        {
            "def": "Sin\n\nOriginal sin\nEternal sin\n\n", 
            "link": "/wiki/Sin", 
            "name": "Sin"
        }, 
        {
            "def": "Testament\n\nOld Testament\nNew Testament\n\n", 
            "link": "/wiki/Testament_(disambiguation)", 
            "name": "Testament"
        }, 
        {
            "def": "Trinity - used as a synonym for God, in order to call attention to the three distinct persons which share the single divine nature or essence. They are traditionally referred to as the Father, Son, and Holy Spirit, though some modern sects prefer more gender-neutral terms such as Creator, Redeemer and Sustainer.", 
            "link": "/wiki/Trinity", 
            "name": "Trinity"
        }, 
        {
            "def": "Tzitzit - scholars think Jesus wore the tzitzit, see Christianity and fringed garments for details.", 
            "link": "/wiki/Tzitzit", 
            "name": "Tzitzit"
        }, 
        {
            "def": "Yeshua - spelled יֵשׁוּעַ in Hebrew, a common name among Jews of the Second Temple Period, and known to be the name used for Jesus by Messianic Jews and Hebrew Christians.", 
            "link": "/wiki/Yeshua_(name)", 
            "name": "Yeshua"
        }, 
        {
            "def": " Christianity portal", 
            "link": "/wiki/Portal:Christianity", 
            "name": "Christianity portal"
        }
    ]
}