{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_cricket_terms", 
    "words": [
        {
            "def": "A batsman plays across the line when he moves his bat in a direction lateral to the direction of the incoming ball.", 
            "link": null, 
            "name": "Across the line"
        }, 
        {
            "def": "this is a swing across the line of the ball (resembling a scything motion) played without much technique. Often one that results in a chunk of the pitch being dug up by the bat, or that winds up with the ball going to Cow Corner (Q.V.). A type of a slog.[5]", 
            "link": null, 
            "name": "Agricultural shot"
        }, 
        {
            "def": "when a ball, or series of balls, are delivered by a spin bowler with using a more looping trajectory than usual, the bowler is said to be giving the ball some air. In combination with top spin, the objective is to lure the batsman into misreading the length of the ball. In combination with off spin or leg spin, the objective is to give the ball more time to drift.", 
            "link": null, 
            "name": "Air"
        }, 
        {
            "def": "when an innings is ended due to ten of the eleven batsmen on the batting side being either dismissed or unable to bat because of injury or illness.[citation needed]", 
            "link": null, 
            "name": "All out"
        }, 
        {
            "def": "a player adept at both batting and bowling.[6]", 
            "link": "/wiki/All-rounder", 
            "name": "All-rounder"
        }, 
        {
            "def": "a top-order batsman capable of batting for a long duration throughout the innings. Usually batsmen playing at numbers 3 or 4 play such a role, especially if there is a batting collapse. An anchor plays defensively, and is often the top scorer in the innings.[7]", 
            "link": null, 
            "name": "Anchor"
        }, 
        {
            "def": "a type of late-swing delivery used by Bart King in the early 1900s. King, a rightarm fast bowler, delivered his inswinger with the right arm raised over the left ear, and concealed the seam of the ball by commencing his action with the ball held in both hands, in the manner of baseball pitchers. It is unclear whether angler also referred to his outswinger.", 
            "link": null, 
            "name": "Angler"
        }, 
        {
            "def": "the act of a bowler or fielder shouting at the umpire to ask if his last ball took the batsman's wicket. Usually phrased in the form of howzat (how-is-that?). Common variations include 'Howzee?' (how is he?), or simply turning to the umpire and shouting.[6] The umpire cannot give a batsman out unless the fielding side appeals, even if the criteria for a dismissal have otherwise been met. However, batsmen who are obviously out (for instance if they are bowled) will normally leave the field without waiting for an appeal.", 
            "link": "/wiki/Appeal_(cricket)", 
            "name": "Appeal"
        }, 
        {
            "def": "The motion of the bowler prior to bowling the ball. It is also known as the run-up. Also the ground a bowler runs on during his run up. E.g.: \"Play was delayed because the bowler's approaches were slippery.\"[citation needed]", 
            "link": "/wiki/Approach_(cricket)", 
            "name": "Approach"
        }, 
        {
            "def": "a deceptive delivery bowled by an off spin bowler that is not spun, so, unlike the off break, it travels straight on (with the bowler's arm). A particularly good bowler's arm ball might also swing away from the batsman in the air (or in to him when delivered by a left-armer).[1]", 
            "link": "/wiki/Arm_ball", 
            "name": "Arm ball"
        }, 
        {
            "def": "a right-handed bowler passing to the right of the non-striker's stumps in his run-up, and vice versa for a left-handed bowler. Compare with over the wicket.[8]", 
            "link": null, 
            "name": "Around the wicket or round the wicket"
        }, 
        {
            "def": "the perpetual prize in England v Australia Test match series. The Ashes originated as a result of a satirical obituary published in a British newspaper, The Sporting Times, in 1882 after a match at The Oval in which Australia beat England on an English ground for the first time. The obituary stated that English cricket had died, and the body will be cremated and the ashes taken to Australia.[1] The English media dubbed the next English tour to Australia (1882–83) as the quest to regain The Ashes. During that tour a small terracotta urn was presented to England captain Ivo Bligh by a group of Melbourne women. The contents of the urn are reputed to be the ashes of an item of cricket equipment, a bail.", 
            "link": "/wiki/The_Ashes", 
            "name": "The Ashes "
        }, 
        {
            "def": "the run rate at which the team batting second needs to score to catch the opponents score in a limited overs game.[1]", 
            "link": null, 
            "name": "Asking rate"
        }, 
        {
            "def": "A fielding configuration in which more fielders are close in to the pitch so as to take catches and dismiss batsmen more readily, at the risk of letting more runs get scored should the ball get past them.", 
            "link": null, 
            "name": "Attacking field"
        }, 
        {
            "def": "A shot of aggression or strength designed to score runs.[9]", 
            "link": null, 
            "name": "Attacking shot"
        }, 
        {
            "def": "A bowler's bowling average is defined as the total number of runs conceded by the bowler (including wides and no-balls) divided by the number of wickets taken by the bowler. A batsman's batting average is defined as the total number of runs scored by the batsman divided by the number of times he has been dismissed.[9]", 
            "link": null, 
            "name": "Average"
        }, 
        {
            "def": "see out swing[9]", 
            "link": null, 
            "name": "Away swing"
        }, 
        {
            "def": "in a batsman's stance the back foot is the foot that is closest to the stumps. A bowler's front foot is the last foot to contact the ground before the ball is released; the other foot is the back foot. Unless the bowler is bowling off the wrong foot the bowling foot is the back foot.[9]", 
            "link": null, 
            "name": "Back foot"
        }, 
        {
            "def": "is the position of the bowler at the moment when his back foot lands on the ground just prior to delivering the ball", 
            "link": "/wiki/Back_foot_contact", 
            "name": "Back foot contact"
        }, 
        {
            "def": "a shot played with the batsman's weight on his back foot (i.e. the foot further from the bowler).[6]", 
            "link": null, 
            "name": "Back foot shot"
        }, 
        {
            "def": "(also under-spin) a delivery which has a rotation backwards so that after pitching it immediately slows down, or bounces lower and skids on to the batsman.[6]", 
            "link": null, 
            "name": "Back spin"
        }, 
        {
            "def": "1.  The non-striking batsman leaving his crease during the delivery in order to shorten the distance to complete one run. A batsman \"backing up\" too far runs the risk of being run out, either by a fielder in a conventional run out, or – in a \"Mankad\" – by the bowler.[9]", 
            "link": null, 
            "name": "Backing up"
        }, 
        {
            "def": "the lifting of the bat in preparation to hit the ball.[9]", 
            "link": "/wiki/Backlift", 
            "name": "Backlift"
        }, 
        {
            "def": "In a match played during the day, \"bad light\" refers to the umpires taking the players from the field because ambient light has dimmed to the point that the ball has become difficult to see. Done for both the fairness and safety of the batsmen.[10] Often shortened simply to light. See also offer the light.", 
            "link": null, 
            "name": "bad light"
        }, 
        {
            "def": "cricket cap of myrtle green colour, which has been worn by Australian Test cricketers since around the turn of the twentieth century.", 
            "link": "/wiki/Baggy_green", 
            "name": "Baggy green"
        }, 
        {
            "def": "one of the two small pieces of wood that lie on top of the stumps to form the wicket.[2]", 
            "link": "/wiki/Bail_(cricket)", 
            "name": "Bail"
        }, 
        {
            "def": "the round object which the batsman attempts to strike with the bat. Also a delivery.[1]", 
            "link": "/wiki/Cricket_ball", 
            "name": "Ball"
        }, 
        {
            "def": "to bowl a delivery on a shorter length with additional speed and force. The bowler is said to be \"bending his back\" when banging it in.", 
            "link": null, 
            "name": "Bang (It) In"
        }, 
        {
            "def": "the wooden implement with which the batsman attempts to strike the ball.[9]", 
            "link": "/wiki/Cricket_bat", 
            "name": "Bat"
        }, 
        {
            "def": "a fielder who is in position close to the batsman on the leg side to catch the ball if it hits the bat, then the pad, and rises to a catchable height. Also a defence against being given out lbw, that the ball may have hit the bat first, however indiscernible.[1]", 
            "link": null, 
            "name": "Bat-pad"
        }, 
        {
            "def": "A player on the batting side, or a player whose speciality is batting,[1] or one of the two members of the batting side who are currently at the crease.", 
            "link": "/wiki/Batsman", 
            "name": "Batsman (also, and particularly in women's cricket, bat or batter)"
        }, 
        {
            "def": "the act and skill of defending one's wicket and scoring runs.[1]", 
            "link": "/wiki/Batting_(cricket)", 
            "name": "Batting"
        }, 
        {
            "def": "the average number of runs scored per innings by a batsman, calculated by dividing the batsman's total runs scored during those innings in question by the number of times the batsman was out.[9]", 
            "link": "/wiki/Batting_average", 
            "name": "Batting average"
        }, 
        {
            "def": "a match situation in which many batsmen are dismissed in rapid succession for very few runs. The terms top order collapse or middle order collapse may refer to batting collapses in a specific part of the batting order.", 
            "link": null, 
            "name": "Batting collapse"
        }, 
        {
            "def": "the order in which the batsmen bat, from the openers, through the top order and middle order to the lower order.[9]", 
            "link": "/wiki/Batting_order_(cricket)", 
            "name": "Batting order"
        }, 
        {
            "def": "an informal form of the game played on beaches, particularly in Australia, New Zealand, Sri Lanka and cricket-playing Caribbean countries.[11]", 
            "link": "/wiki/Beach_cricket", 
            "name": "Beach cricket"
        }, 
        {
            "def": "a delivery that reaches the batsman at around head height without bouncing. Due to the risk of injury to the batsman, a beamer is an illegal delivery, punishable by a no ball being called.[1] If an individual bowler bowls more than two beamers in an innings, they can be barred from bowling for the remainder of that innings.", 
            "link": "/wiki/Beamer_(cricket)", 
            "name": "Beamer"
        }, 
        {
            "def": "when a batsman narrowly avoids touching the ball with the edge of his bat, through good fortune rather than skill. Considered a moral victory for the bowler. The batsman is said to have been beaten. In some cases, this may be expanded to \"beaten all ends up\".[12]", 
            "link": null, 
            "name": "Beat the bat"
        }, 
        {
            "def": "a diagram showing where a number of balls, usually from a particular bowler, have passed the batsman.[13] Compare pitch map.", 
            "link": null, 
            "name": "Beehive"
        }, 
        {
            "def": "a belter of a pitch is a pitch offering advantage to the batsman.[1]", 
            "link": null, 
            "name": "Belter"
        }, 
        {
            "def": "of a pace bowler, to put in extra effort to extract extra speed or bounce.[1]", 
            "link": null, 
            "name": "Bend the back"
        }, 
        {
            "def": "the most wickets, for the lowest number of runs, in a single innings by a single bowler. See also high score.", 
            "link": null, 
            "name": "Best bowling"
        }, 
        {
            "def": "slang term for an attacking batsman. A biffer is the opposite of a blocker, being a defending player. In earlier times (particularly pre-World War II) cricketers were either amateur (Gentlemen) or professional (Players). Typically, but not universally, amateurs would be \"biffers\" and professionals \"blockers\". The word derives from the slightly archaic transitive verb, \"biff\" which means \"hit\". Today, biffers tend to be known as big hitters.", 
            "link": null, 
            "name": "Biffer"
        }, 
        {
            "def": "the turn a spin bowler is able to produce on a pitch.[3]", 
            "link": null, 
            "name": "Bite"
        }, 
        {
            "def": "1.  A defensive shot, or the act of playing such a shot;[12]", 
            "link": "/wiki/Batting_(cricket)#Leave_and_block", 
            "name": "Block"
        }, 
        {
            "def": "slang term for a defensive or slow-scoring batsman, the opposite of biffer. In earlier times (particularly pre-World War II) cricketers were either professional or amateur. Typically, but not universally, amateurs would be \"biffers\" and professionals \"blockers\". The word derives from the natural tendency of such batsmen to \"block\" each delivery, rather than try to score runs. Such players tend to have low strike rates, but in many cases high averages due to their lack of aggressive shots giving bowlers less chances to dismiss them. They are typically less effective in limited overs cricket where quick scoring is often needed, though some are able to adapt their game to score quicker in the shorter formats of the game.", 
            "link": null, 
            "name": "Blocker"
        }, 
        {
            "def": "the area between where the batsman rests his bat to receive a delivery and his toes. It is the target area for a yorker.[12]", 
            "link": null, 
            "name": "Block hole"
        }, 
        {
            "def": "a tactic (now suppressed by law changes restricting fielders on the leg side) involving bowling directly at the batsman's body, particularly with close fielders packed on the leg side. Bodyline was a common tactic in the contentious 1932–33 Ashes Tour. The tactic is often called \"fast leg theory\" in other contexts.[1]", 
            "link": "/wiki/Bodyline", 
            "name": "Bodyline"
        }, 
        {
            "def": "Another term for short leg, the least liked and most dangerous of the fielding positions. The term is derived from this potential for getting hit by the ball, being a reference to the Boot Hills of the American West, graveyards for those who \"died with their boots on\". Due to its unpopularity the position has traditionally been taken by the junior professional, although this is no longer necessarily the case. According to former England fielding coach Richard Halsall, a good short leg has to be physically brave, an outstanding catcher, and preferably a good reader of the batsman, and is indeed normally a batsman themselves.[14][15]", 
            "link": null, 
            "name": "Boot Hill"
        }, 
        {
            "def": "See Googly[1]", 
            "link": "/wiki/Bosey", 
            "name": "Bosie or Bosey "
        }, 
        {
            "def": "The hand of the batsman that is closest to the blade of the bat. Shots played with the bottom hand often are hit in the air.[12]", 
            "link": null, 
            "name": "Bottom hand"
        }, 
        {
            "def": "a fast short pitched delivery that rises up near the batsman's head.[1][3]", 
            "link": "/wiki/Bouncer_(cricket)", 
            "name": "Bouncer"
        }, 
        {
            "def": "1.  the perimeter of the ground;[12]", 
            "link": "/wiki/Boundary_(cricket)", 
            "name": "Boundary"
        }, 
        {
            "def": "a mode of a batsman's dismissal. Occurs when a delivery hits the stumps and removes the bails.[16]", 
            "link": "/wiki/Bowled", 
            "name": "Bowled"
        }, 
        {
            "def": "for a batsman to be dismissed bowled by a delivery which passes him on the leg side of his body or legs.", 
            "link": null, 
            "name": "Bowled around his legs"
        }, 
        {
            "def": "1.  see all out.", 
            "link": null, 
            "name": "Bowled out"
        }, 
        {
            "def": "the act of delivering the cricket ball to the batsman.[12]", 
            "link": "/wiki/Bowling_(cricket)", 
            "name": "Bowling"
        }, 
        {
            "def": "a method of determining the result in a limited overs match that has been tied or cancelled due to rain. Five players from each team bowl at a full set of stumps, and the team with the most hits wins. If the number of hits is equal after both team's turns, further sudden death turns are taken. The concept is analogous to the penalty shootout used in other sports.[17]", 
            "link": "/wiki/Bowl-out", 
            "name": "Bowl-out"
        }, 
        {
            "def": "(also called bowling figures) a shorthand statistical notation summarising a bowler's performance.[12]", 
            "link": "/wiki/Bowling_analysis", 
            "name": "Bowling analysis"
        }, 
        {
            "def": "See Death overs[1]", 
            "link": null, 
            "name": "Bowling at the death"
        }, 
        {
            "def": "a protective item shaped like a half-shell and inserted into the front pouch of a jockstrap with cup pocket worn underneath a player's (particularly a batsman's) trousers to protect his or her genitalia from the hard cricket ball. Also known as an abdominal protector, Hector protector, ball box, protector, athletic cup, protective cup or cup.[12]", 
            "link": "/wiki/Box_(cricket)", 
            "name": "Box"
        }, 
        {
            "def": "a suffix denoting the ball changing direction after pitching caused by the bowler's spin or cut. For example, a leg spinner will deliver leg breaks (moving from leg to off).[6]", 
            "link": null, 
            "name": "Break"
        }, 
        {
            "def": "see Cafeteria bowling.", 
            "link": null, 
            "name": "Buffet bowling"
        }, 
        {
            "def": "a delivery that bounces very close to the batsman's foot, after he has played a shot, such that it appears to have come directly from the bat without ground contact. The result is often the appearance of a clean catch.[1]", 
            "link": null, 
            "name": "Bump ball"
        }, 
        {
            "def": "old-fashioned name for a bouncer.[1]", 
            "link": null, 
            "name": "Bumper"
        }, 
        {
            "def": "see rabbit.[1]", 
            "link": null, 
            "name": "Bunny"
        }, 
        {
            "def": "A pitch on which spin bowlers can turn the ball prodigiously. From the rhyming slang: 'Bunsen Burner' meaning 'Turner'.[1]", 
            "link": null, 
            "name": "Bunsen"
        }, 
        {
            "def": "extras scored in the same way as normal runs when the ball does not make contact with any part of the batsman (bat, protective gear, body parts).[1]", 
            "link": "/wiki/Bye_(cricket)", 
            "name": "Bye"
        }, 
        {
            "def": "Mediocre bowling, to which the batsman can help himself in the manner of a self-service cafeteria. Also called Buffet bowling, and may be deployed for the purposes of Declaration bowling.", 
            "link": null, 
            "name": "Cafeteria bowling"
        }, 
        {
            "def": "1.  The act of a fieldsman in announcing to other fieldsmen that he is in a position to take a catch, usually by shouting the word \"mine\". This is considered good practice, as it prevents two fieldsmen colliding with one another in an attempt to take the same catch. See mine.", 
            "link": null, 
            "name": "Call"
        }, 
        {
            "def": "A brief but quick-scoring innings e.g. \"He played a little cameo of an innings\".[18]", 
            "link": null, 
            "name": "Cameo"
        }, 
        {
            "def": "headwear traditionally worn by cricketers in the field.", 
            "link": "/wiki/Cricket_cap", 
            "name": "Cap"
        }, 
        {
            "def": "The person in command of a whole Team.", 
            "link": "/wiki/Captain_(cricket)", 
            "name": "Captain"
        }, 
        {
            "def": "a style of slow bowling delivery in which the ball is released by flicking the ball between the thumb and a bent middle finger in order to impart spin", 
            "link": "/wiki/Carrom_ball", 
            "name": "Carrom ball"
        }, 
        {
            "def": "if a hit ball is caught by a fielder on the fly, it is said to have carried. If it bounces just short of the fielder, it is said not to have carried.[19] The carry of a delivery to the wicket keeper is also noted as a measure of the quality of the pitch.", 
            "link": null, 
            "name": "Carry"
        }, 
        {
            "def": "an opener who is not out at the end of a completed innings is said to have carried his bat.[1]", 
            "link": "/wiki/Carry_the_bat", 
            "name": "Carry the bat"
        }, 
        {
            "def": "when a ball hits a stump with enough force to cause it to flip end-over-end before landing.", 
            "link": null, 
            "name": "Cart-wheeling stump"
        }, 
        {
            "def": "out bowled often by a full length ball or a Yorker.", 
            "link": null, 
            "name": "Castled"
        }, 
        {
            "def": "to dismiss a batsman by a fielder catching the ball after the batsman has hit it with his bat but before it hits the ground.[19]", 
            "link": "/wiki/Caught", 
            "name": "Catch"
        }, 
        {
            "def": "Caught is a method of dismissing a batsman in the sport of cricket. Being caught out is the most common method of dismissal at higher levels of competition. This method of dismissal is covered by Law 32 of the Laws of cricket which reads:[20] A batsman is out caught if a fielder catches the ball fully within the field of play without it bouncing once the ball has touched the striker's bat, glove or only the leg of the batsman. If a batsman could be given out caught or by any other method except bowled, 'caught' takes precedence.", 
            "link": "/wiki/Caught", 
            "name": "Caught"
        }, 
        {
            "def": "When a player is dismissed by a catch taken by the bowler. The term originates from the way such dismissals are recorded on a scorecard (c & b); the alternative \"bowled and caught\", referring to the sequence of events in the chronological order, is almost never used.", 
            "link": null, 
            "name": "Caught and bowled"
        }, 
        {
            "def": "A catch by the wicket-keeper.", 
            "link": null, 
            "name": "Caught behind"
        }, 
        {
            "def": "A player who has scored more than 100 runs (a century) in an innings.", 
            "link": null, 
            "name": "Centurion"
        }, 
        {
            "def": "an individual score of at least 100 runs, a significant landmark for a batsman. Sometimes used ironically to refer to a bowler conceding over 100 runs in an innings.[19]", 
            "link": "/wiki/Century_(cricket)", 
            "name": "Century"
        }, 
        {
            "def": "When the batsman uses his feet and comes out of his batting crease towards the bowler, trying to hit the ball. Also known as giving the bowler the charge,[1] or stepping down the wicket.", 
            "link": null, 
            "name": "Charge"
        }, 
        {
            "def": "When the umpires on the ground consult with the third umpire, either to help them in taking a decision or because one of the teams invoked the DRS.", 
            "link": null, 
            "name": "Check upstairs"
        }, 
        {
            "def": "Another name for the ball, typically Australian. Alternatively can refer to the red mark made by the ball on bat.", 
            "link": null, 
            "name": "Cherry"
        }, 
        {
            "def": "1.  A chest on bowler has chest and hips aligned towards the batsman at the instant of back foot contact.[1]", 
            "link": null, 
            "name": "Chest on (also front on or square on)"
        }, 
        {
            "def": "The use of a series of bouncers from pace bowlers to intimidate a batsman. Term taken from baseball.[1]", 
            "link": "/wiki/Chin_music#Cricket", 
            "name": "Chin music"
        }, 
        {
            "def": "a left-handed bowler bowling wrist spin (left arm unorthodox). For a right-handed batsman, the ball will move from the off side to the leg side. Some commentators alternatively refer to googlies bowled by such bowlers as Chinamen. In both cases, named after Ellis \"Puss\" Achong, a West Indian left-arm wrist-spin bowler of Chinese descent.[3]", 
            "link": "/wiki/Left-arm_unorthodox_spin", 
            "name": "Chinaman"
        }, 
        {
            "def": "see French Cut", 
            "link": null, 
            "name": "Chinese cut"
        }, 
        {
            "def": "to be bowled by the ball deflecting off the inside or bottom edge of the bat and onto the stumps while playing a shot", 
            "link": null, 
            "name": "Chop on"
        }, 
        {
            "def": "to throw the ball instead of bowling it (i.e. by straightening the elbow during the delivery); also chucker: a bowler who chucks; and chucking: such an illegal bowling action. All are considered offensive terms as they imply cheating.[1]", 
            "link": null, 
            "name": "Chuck"
        }, 
        {
            "def": "a painted circle (or ellipse), centred in the middle of the pitch, of radius 30-yard (27 m) marked on the field. The circle separates the infield from the outfield, used in policing the fielding regulations in certain one-day versions of the game. The exact nature of the restrictions vary depending on the type of game: see limited overs cricket, Twenty20 and powerplay (cricket).", 
            "link": null, 
            "name": "Circle"
        }, 
        {
            "def": "bowled, without the ball first hitting the bat or pad.[2]", 
            "link": null, 
            "name": "Clean bowled"
        }, 
        {
            "def": "1.  A group of cricketers, from which one or more teams are formed.", 
            "link": null, 
            "name": "Club"
        }, 
        {
            "def": "A phrase used to indicate a batsman walking onto the playing arena and arriving at the cricket pitch in the middle of the ground to begin batting.", 
            "link": null, 
            "name": "Come to the crease"
        }, 
        {
            "def": "a swing bowler aligns the seam and the sides of the ball to reinforce the swing effect.", 
            "link": null, 
            "name": "Conventional Swing"
        }, 
        {
            "def": "Unusual tactics which are intended to achieve a legitimate outcome, but result in wild statistical abnormalities; for example, deliberately bowling extremely poorly to encourage a quick declaration. Wisden excludes records set in contrived circumstances from its official lists.[21]", 
            "link": null, 
            "name": "Contrived circumstances"
        }, 
        {
            "def": "all players fielding in the slips at any time are collectively referred to the slips cordon.", 
            "link": null, 
            "name": "Cordon (or slips cordon)"
        }, 
        {
            "def": "a good line. The corridor of uncertainty is a notional narrow area on and just outside a batsman's off stump. If a delivery is in the corridor, it is difficult for a batsman to decide whether to leave the ball, play defensively or play an attacking shot. The term was popularised by former England batsman, now commentator, Geoffrey Boycott.[1]", 
            "link": "/wiki/Corridor_of_uncertainty", 
            "name": "Corridor of uncertainty"
        }, 
        {
            "def": "the highest level of domestic cricket in England and Wales.[22]", 
            "link": "/wiki/County_cricket", 
            "name": "County cricket"
        }, 
        {
            "def": "1.  A fielding position between point and mid-off.[22]", 
            "link": null, 
            "name": "Covers"
        }, 
        {
            "def": "the area of the field (roughly) between deep mid-wicket and wide long-on. So called because few 'legitimate' shots are aimed to this part of the field, so fielders are rarely placed there – leading to the concept that cows could happily graze in that area.[1]", 
            "link": null, 
            "name": "Cow corner"
        }, 
        {
            "def": "a hard shot, usually in the air, across the line of a full-pitched ball, aiming to hit the ball over the boundary at cow corner, with very little regard to proper technique. A type of slog.[1]", 
            "link": null, 
            "name": "Cow shot"
        }, 
        {
            "def": "one of several lines on the pitch near the stumps (the \"popping crease\", the \"return crease\" and the \"bowling crease\") most often referring to the popping crease.[2]", 
            "link": "/wiki/Crease_(cricket)", 
            "name": "Crease"
        }, 
        {
            "def": "a person who plays cricket.[23]", 
            "link": null, 
            "name": "Cricketer"
        }, 
        {
            "def": "a shot played with the bat parallel with the ground, such as a cut or a pull. Also known as a horizontal-bat shot.[1]", 
            "link": null, 
            "name": "Cross-bat shot"
        }, 
        {
            "def": "a shot played square on the off side to a short-pitched delivery wide of off stump. So called because the batsman makes a \"cutting\" motion as he plays the shot.[22]", 
            "link": "/wiki/Cut_(cricket)", 
            "name": "Cut"
        }, 
        {
            "def": "a break delivery bowled by a fast or medium-pace bowler with similar action to a spin bowler, but at a faster pace. It is usually used in an effort to surprise the batsman, although some medium-pace bowlers use the cutter as their stock (main) delivery.[6]", 
            "link": null, 
            "name": "Cutter"
        }, 
        {
            "def": "When a ball rolls along the pitch or bounces more than 2 times", 
            "link": null, 
            "name": "Daisy cutter"
        }, 
        {
            "def": "a cricket match that is allowed to proceed into night hours by using floodlights; originally only allowed for one-day cricket, the ICC has recently allowed evening sessions of Test cricket to go day/night so that bad light need not preempt play.", 
            "link": "/wiki/Day/night_cricket", 
            "name": "Day/night cricket"
        }, 
        {
            "def": "1.  the state of play in between deliveries, in which batsmen may not score runs or be given out.[1]", 
            "link": "/wiki/Dead_ball_(cricket)", 
            "name": "Dead ball"
        }, 
        {
            "def": "the bat when held with a light grip such that it gives when the ball strikes it, and the ball loses momentum and falls to the ground.", 
            "link": "https://en.wiktionary.org/wiki/Dead_bat", 
            "name": "Dead bat"
        }, 
        {
            "def": "a bowler who regularly bowls during the death overs of a limited overs match. Bowlers are also described as \"bowling at the death\".", 
            "link": null, 
            "name": "Death bowler"
        }, 
        {
            "def": "the final overs of a limited overs match, in which a batting side with wickets in hand can bat aggressively, and in which bowlers are, usually, hit for lots of runs.", 
            "link": null, 
            "name": "Death overs (also slog overs)"
        }, 
        {
            "def": "the symbolic sound of a batsman's wicket being broken when he is bowled.", 
            "link": null, 
            "name": "Death rattle"
        }, 
        {
            "def": "see Umpire Decision Review System.", 
            "link": null, 
            "name": "Decision review system (DRS)"
        }, 
        {
            "def": "the act of a captain voluntarily bringing his side's innings to a close, in the belief that their score is now great enough to prevent defeat. Occurs almost exclusively in timed forms of cricket where a draw is a possible result (such as first class cricket), in order that the side declaring have enough time to bowl the opposition out and therefore win.[1]", 
            "link": "/wiki/Declaration_and_forfeiture", 
            "name": "Declaration"
        }, 
        {
            "def": "deliberately poor bowling (Full tosses and Long hops) from the fielding team to allow the batsmen to score runs quickly and encourage the opposing captain to declare, thereby giving both teams a chance of winning in a timed match which would otherwise have been drawn. Non-specialist bowlers will often be used in this context, to preserve dignity (and the bowling averages) of the specialist bowlers. This may be seen in domestic first class cricket, where the points systems used often show little penalty between a draw and a loss; but it would seldom be seen in Test cricket where the consequence of a loss in the context of a series is greater. Cf. Cafeteria bowling.", 
            "link": null, 
            "name": "Declaration bowling"
        }, 
        {
            "def": "A fielding configuration in which fielders are spread around the field so as to more readily stop hit balls and reduce the number of runs (particularly boundaries) being scored by batsmen, at the cost of fewer opportunities to take catches and dismiss batsmen.", 
            "link": null, 
            "name": "Defensive field"
        }, 
        {
            "def": "the act of bowling the ball.[6]", 
            "link": null, 
            "name": "Delivery"
        }, 
        {
            "def": "a score of 87, regarded as unlucky in Australian cricket. According to Australian superstition, batsmen have a tendency to be dismissed for 87. The superstition is thought to originate from the fact that 87 is 13 runs short of a century. The English term Nelson similarly refers to a superstition concerning a number traditionally regarded as unlucky.", 
            "link": null, 
            "name": "Devil's number (also Dreaded number) "
        }, 
        {
            "def": "regional usage varies, but either a dismissal (usually run out) without facing a delivery,[24] or a dismissal (for zero) off the first ball of a team's innings (the less common term platinum duck is used interchangeably).", 
            "link": null, 
            "name": "Diamond duck"
        }, 
        {
            "def": "1.  a bowler of limited skill.", 
            "link": null, 
            "name": "Dibbly dobbly"
        }, 
        {
            "def": "A stroke where a batsman goes on one knee and hits a good length or slightly short of length ball straight over the wicket keeper's head usually to the boundary or over it. Displayed at the world stage by Sri Lankan batsman Tillakaratne Dilshan during the ICC World Twenty20 in June 2009 and named after him.", 
            "link": "/wiki/Dilscoop", 
            "name": "Dilscoop"
        }, 
        {
            "def": "a gentle shot.", 
            "link": null, 
            "name": "Dink"
        }, 
        {
            "def": "a delivery bowled which curves into or away from the batsman before pitching.", 
            "link": null, 
            "name": "Dipper"
        }, 
        {
            "def": "to get one of the batsmen out so that he must cease batting.", 
            "link": "/wiki/Dismissal_(cricket)", 
            "name": "Dismissal"
        }, 
        {
            "def": "a throw from a fieldsman that directly strikes and puts down a wicket (without first being caught by a fieldsman standing at the stumps). Occurs when attempting a run out.", 
            "link": null, 
            "name": "Direct hit"
        }, 
        {
            "def": "'Dobbing' is the act of a bowler running out a batsman who has backed up too far. It is particularly used in League cricket in Lancashire and neighbouring counties", 
            "link": null, 
            "name": "Dobbing"
        }, 
        {
            "def": "a cricket pitch which has been intentionally prepared in an unusual manner to gain a competitive advantage for the home team, such as by creating a surface that favours the home team's strike bowler, or that exacerbates weaknesses in the visiting team's batting. The practice is common and (within reason) legal, but the term is used pejoratively.[25]", 
            "link": null, 
            "name": "Doctored pitch"
        }, 
        {
            "def": "a very easy catch.[1]", 
            "link": null, 
            "name": "Dolly"
        }, 
        {
            "def": "A ball with a very high trajectory prior to bouncing.[6]", 
            "link": null, 
            "name": "Donkey drop"
        }, 
        {
            "def": "a relatively new off spin delivery developed by Saqlain Mushtaq; the finger spin equivalent of the googly, in that it turns the \"wrong way\". From the Hindi or Urdu for second or other. First coined by Pakistani wicket keeper Moin Khan.[1]", 
            "link": "/wiki/Doosra", 
            "name": "Doosra"
        }, 
        {
            "def": "a delivery bowled without any runs scored off it, so called because it is recorded in the score book with a single dot.", 
            "link": null, 
            "name": "Dot ball"
        }, 
        {
            "def": "normally the scoring of a 1000 runs and the taking of 100 wickets in the same season.", 
            "link": "/wiki/Double_(cricket)", 
            "name": "Double"
        }, 
        {
            "def": "referring to the motion of a batsman towards the bowler prior to or during the delivery, made in the hope of turning a good length ball into a half-volley.", 
            "link": null, 
            "name": "Down the pitch (also Down the wicket)"
        }, 
        {
            "def": "before the current \"front foot rule\" was introduced, bowlers had to release the ball with the rear foot behind the bowling crease; there were instances of bowlers (especially Gordon Rorke) managing to \"drag\" the rear foot forward before release and not being no-balled.", 
            "link": null, 
            "name": "Drag"
        }, 
        {
            "def": "1.  a result in timed matches where the team batting last are not all out, but fail to exceed their opponent's total. Not to be confused with a tie, in which the side batting last is all out or run out of overs with the scores level.", 
            "link": null, 
            "name": "Draw"
        }, 
        {
            "def": "Declare the game, or a day's play, over; a reference to withdrawing the stumps from the ground by the umpire.", 
            "link": null, 
            "name": "Draw stumps"
        }, 
        {
            "def": "the slight lateral curved-path movement that a spinner extracts while the ball is in flight. Considered very good bowling.[1]", 
            "link": null, 
            "name": "Drift"
        }, 
        {
            "def": "a short break in play, generally taken in the middle of a session, when refreshments are brought out to the players and umpires by the twelfth men of each side. Drinks breaks do not always take place, but they are usual in test matches, particularly in hot countries.", 
            "link": null, 
            "name": "Drinks"
        }, 
        {
            "def": "a jocular term for the twelfth man, referring to his job of bringing out drinks.", 
            "link": null, 
            "name": "Drinks waiter"
        }, 
        {
            "def": "a powerful shot generally hit along the ground or sometimes in the air in a direction between cover point on the off side and mid-wicket on the leg side, or in an arc between roughly thirty degrees each side of the direction along the pitch.", 
            "link": "/wiki/Drive_(cricket)", 
            "name": "Drive"
        }, 
        {
            "def": "1.  the accidental \"dropping\" of a ball that was initially caught by a fielder, thus denying the dismissal of the batsman; when such an event occurs, the batsman is said to have been \"dropped\".", 
            "link": null, 
            "name": "Drop"
        }, 
        {
            "def": "alternate term for a lob ball, seen in Sir Arthur Conan Doyle's short work The story of Spedegue's Dropper. See also Lob bowling.", 
            "link": null, 
            "name": "Dropper"
        }, 
        {
            "def": "a temporary pitch that is cultivated off-site from the field which also allows other sports to share the use of the field with less chance of injury to the players.", 
            "link": "/wiki/Drop-in_pitch", 
            "name": "Drop-in pitch"
        }, 
        {
            "def": "common abbreviation for the Umpire Decision Review System. It is not used by India.", 
            "link": null, 
            "name": "DRS"
        }, 
        {
            "def": "a batsman's score of nought (zero) dismissed, as in \"he was out for a duck.\" It can refer to a score of nought not out during an innings, as in \"she hasn't got off her duck yet\", but never refers to a completed innings score of nought not out. Originally called a \"duck's egg\" because of the \"0\" shape in the scorebook.[1][3] ( see Golden, Diamond, and Platinum duck )", 
            "link": "/wiki/Duck_(cricket)", 
            "name": "Duck"
        }, 
        {
            "def": "a short pitched delivery that appears to be a bouncer, making the striker duck to avoid from being hit; but instead of bouncing high, it has a low bounce which causes the batsman to be dismissed LBW, or occasionally bowled.", 
            "link": null, 
            "name": "Duck under delivery"
        }, 
        {
            "def": "a mathematically based rule that derives a target score for the side batting second in a rain-affected one-day match.[1]", 
            "link": "/wiki/Duckworth-Lewis_method", 
            "name": "Duckworth-Lewis method"
        }, 
        {
            "def": "a sheltered place just outside the boundary ropes where players sit. Dugouts are a common feature of Twenty20 matches, but pavilions are usually used for any longer forms of the game.", 
            "link": null, 
            "name": "Dugout"
        }, 
        {
            "def": "[citation needed]", 
            "link": "/wiki/Hawk-Eye", 
            "name": "Eagle-Eye"
        }, 
        {
            "def": "a bowler who concedes very few runs from his over(s), i.e. has a low economy rate. The opposite of expensive.", 
            "link": null, 
            "name": "Economical"
        }, 
        {
            "def": "the average number of runs scored per over in the bowler's spell.[1]", 
            "link": null, 
            "name": "Economy rate"
        }, 
        {
            "def": "a slight deviation of the ball off the edge of the bat. Top, bottom, inside and outside edges denote the four edges of the bat. The notional four edges are due to the bat being either vertical (inside/outside edge), or horizontal (top/bottom edge). See also leading edge.[26]", 
            "link": null, 
            "name": "Edge (or snick or nick)"
        }, 
        {
            "def": "another name for one cricket team, which is made of eleven players.[26]", 
            "link": null, 
            "name": "Eleven"
        }, 
        {
            "def": "An area of the ground directly behind one of the stumps, used to designate what end a bowler is bowling from (e.g. the Pavilion End).[26] The bowlers take turns delivering alternating overs from the two ends of the pitch.", 
            "link": null, 
            "name": "End"
        }, 
        {
            "def": "a bowler who concedes a large number of runs from his over(s), i.e. has a high economy rate.[26] The opposite of economical.", 
            "link": null, 
            "name": "Expensive"
        }, 
        {
            "def": "a run not attributed to any batsman; there are five types: byes, leg byes, penalties, wides and no-balls. The first three types are called 'fielding' extras (i.e. the fielders are determined to be at fault for their being conceded) and the last two are called 'bowling' extras (the bowler being considered to be at fault for their being conceded) which are included in the runs conceded by the bowler.[1]", 
            "link": "/wiki/Extra_(cricket)", 
            "name": "Extra (also sundry) (England, Australia)"
        }, 
        {
            "def": "a verb used to indicate the dismissal of a batsman, e.g \"The fourth wicket fell for the addition of only three runs\".", 
            "link": null, 
            "name": "Fall"
        }, 
        {
            "def": "the batting team's score at which a batsman gets out. Often abbreviated to \"FoW\" in scorecards.[26]", 
            "link": null, 
            "name": "Fall of wicket"
        }, 
        {
            "def": "of a batsman, contrive to receive the majority of the balls bowled.[26]", 
            "link": null, 
            "name": "Farm the strike (also shepherd the strike or farm the bowling)"
        }, 
        {
            "def": "a style of bowling in which the ball is delivered at high speeds, typically over 90 mph (145 km/h). Fast bowlers also use swing.[26]", 
            "link": "/wiki/Fast_bowling", 
            "name": "Fast bowling (also pace bowling)"
        }, 
        {
            "def": "A variant of leg theory in which balls are bowled at high speed, aimed at the batsman's body. See Bodyline.", 
            "link": "/wiki/Bodyline", 
            "name": "Fast leg theory"
        }, 
        {
            "def": "a faint edge.[3]", 
            "link": null, 
            "name": "Feather"
        }, 
        {
            "def": "A soft, slow pitch of predictable bounce. Such pitches are considered to be good for batting on, offering little, if any, help for a bowler.[1]", 
            "link": null, 
            "name": "Featherbed"
        }, 
        {
            "def": "a suffix to any number, meaning the number of wickets taken by a team or bowler. (See also fifer/five-fer)", 
            "link": null, 
            "name": "-fer"
        }, 
        {
            "def": "see rabbit.", 
            "link": null, 
            "name": "Ferret"
        }, 
        {
            "def": "a player on the fielding side who is neither the bowler nor the wicket-keeper, in particular one who has just fielded the ball.", 
            "link": "/wiki/Fielding_(cricket)", 
            "name": "Fielder (also, more traditionally, fieldsman)"
        }, 
        {
            "def": "when a match finished early a further game was sometimes started to fill in the available time and to entertain the paying spectators.", 
            "link": null, 
            "name": "Fill-up game"
        }, 
        {
            "def": "to play a shot or series of shots along the ground, between fielders. The least risky way of scoring runs quickly, but it requires good technique to be able to do consistently.", 
            "link": null, 
            "name": "Find the gap(s)"
        }, 
        {
            "def": "of a position on the field behind the batsman, closer to the line of the pitch (wicket-to-wicket); the opposite of square.[26]", 
            "link": null, 
            "name": "Fine"
        }, 
        {
            "def": "the senior form of the game; usually county, state or international. First-class matches consist of two innings per side and are usually played over three or more days.[8]", 
            "link": "/wiki/First-class_cricket", 
            "name": "First-class cricket"
        }, 
        {
            "def": "the third bowler used in an innings. As the first bowler to replace either of the opening pair this bowler is the first change that the captain makes to the attack.", 
            "link": null, 
            "name": "First change"
        }, 
        {
            "def": "In first-class competitions with a league table to determine standings, in addition to points awarded for winning or tieing a match, a team is also awarded points for taking a first innings lead, i.e. scoring more than their opponents in the first innings.", 
            "link": null, 
            "name": "First innings points"
        }, 
        {
            "def": "being tempted into throwing the bat at a wider delivery outside off-stump and missing, reaching for a wide delivery and missing. See also waft.", 
            "link": null, 
            "name": "Fishing"
        }, 
        {
            "def": "five or more wickets taken by a bowler in an innings, considered a very good performance. The term five-for is an abbreviation of the usual form of writing bowling statistics, e.g., a bowler who takes 5 wickets and concedes 117 runs is said to have figures of \"5 for 117\" or \"5–117\". A five-wicket haul is traditionally regarded as a special moment for a bowler, just like a century for a batsman.", 
            "link": null, 
            "name": "Five-wicket haul (also five-for, five-fer, fifer, shortened to 5WI or FWI, or colloquially a Michelle)"
        }, 
        {
            "def": "to wield the bat aggressively, often hitting good line and length deliveries indiscriminately.", 
            "link": null, 
            "name": "Flash"
        }, 
        {
            "def": "a pitch which is advantageous to the batsmen and offers little or no help to the bowlers, due to predictable bounce.", 
            "link": null, 
            "name": "Flat pitch"
        }, 
        {
            "def": "an aerial shot hit with significant power by the batsman which travels fast enough to make the ballistic trajectory of the ball appear flat", 
            "link": null, 
            "name": "Flat hit"
        }, 
        {
            "def": "a ball thrown by the fielder which is almost parallel to the ground. Considered to be a hallmark of good fielding if the throw is also accurate because flat throws travel at a fast pace.", 
            "link": null, 
            "name": "Flat throw"
        }, 
        {
            "def": "a batsman high in the batting order who is very good only when the pitch is not giving the bowlers much help. 'Track' is Australian slang for the pitch. When the 'track' is said to be 'flat' it is at its easiest for the batsman, but these are the only conditions under which some players can dominate. When conditions are tough, or when it really counts – they don't.", 
            "link": null, 
            "name": "Flat-track bully"
        }, 
        {
            "def": "a gentle movement of the wrist to move the bat, often associated with shots on the leg side.", 
            "link": null, 
            "name": "Flick"
        }, 
        {
            "def": "a delivery which is thrown up at a more arched trajectory by a spinner. Considered to be good bowling. Also loop.", 
            "link": "/wiki/Flight_(cricket)", 
            "name": "Flight"
        }, 
        {
            "def": "a leg spin delivery with under-spin, so it bounces lower than normal, invented by Clarrie Grimmett.[1][3]", 
            "link": "/wiki/Flipper_(cricket)", 
            "name": "Flipper"
        }, 
        {
            "def": "a delivery bowled by a spinner that travels in a highly arched path appearing to 'float' in the air.[1]", 
            "link": null, 
            "name": "Floater"
        }, 
        {
            "def": "a position deeper than the conventional slips, between the slips and third man.[6]", 
            "link": null, 
            "name": "Fly slip"
        }, 
        {
            "def": "a team which bats first in the second innings, after having batted second in the first innings, is said to have followed on. The captain of the team batting first in the first innings may direct the team batting second to follow on if it leads by a certain margin after the first innings; this margin is currently 200 runs in a five-day game, and 150 runs in a three- or four-day game.[6]", 
            "link": "/wiki/Follow-on", 
            "name": "Follow on"
        }, 
        {
            "def": "a bowler's body actions after the release of the ball to stabilise their body.[6]", 
            "link": "/wiki/Follow_through_(cricket)", 
            "name": "Follow through"
        }, 
        {
            "def": "On a grass pitch, the bowler creates a rough patch where he lands his foot and follows through after delivering the ball. The rough patch can become cratered and becomes more abrasive as the match continues and more people step on it. The abrasive surface means that the ball will increasingly grip more if it lands in the footmarks. Bowlers, particularly spinners, will aim the ball there as it will turn more sharply, and is more likely to get irregular bounce from such areas, making it more difficult for the opposition batsmen.", 
            "link": null, 
            "name": "Footmarks"
        }, 
        {
            "def": "the necessary (foot) steps that a batsman has to take so as to be at a comfortable distance from where the ball has pitched, just right to hit the ball anywhere he desires, negating any spin or swing that a bowler attempts to extract after bouncing.", 
            "link": null, 
            "name": "Footwork"
        }, 
        {
            "def": "An uncommon fielding position akin to a short third-man, roughly halfway between the pitch and the boundary. Also used for a short backward square leg (at 45° behind square defending a single).", 
            "link": null, 
            "name": "Forty-Five (on the one)"
        }, 
        {
            "def": "a commonly-employed defensive shot.", 
            "link": "/wiki/Forward_defence", 
            "name": "Forward defence"
        }, 
        {
            "def": "a shot that reaches the boundary after touching the ground, which scores four runs to the batting side.", 
            "link": "/wiki/Boundary_(cricket)#4_or_6_runs", 
            "name": "Four"
        }, 
        {
            "def": "Also four-for four or more wickets taken by a bowler in an innings, considered a good performance. Mostly used in One Day Internationals and it is a rarer feat in T20 Cricket.", 
            "link": null, 
            "name": "Four wickets (also 4WI)"
        }, 
        {
            "def": "a position or line one stump's width outside the off stump, i.e. where the wicket's fourth stump would be positioned if it existed. Generally used to describe the line or pitch of a delivery. A fourth stump line is roughly synonymous with the corridor of uncertainty.[27]", 
            "link": null, 
            "name": "Fourth stump"
        }, 
        {
            "def": "a penalty given in some forms of cricket when a bowler bowls a front foot no-ball. The bowler must bowl another delivery, and the batsman cannot be dismissed by the bowler from that delivery. Between the no-ball and the free hit, the fielders may not change positions (unless the batsmen changed ends on the no-ball).", 
            "link": "/wiki/Free_hit", 
            "name": "Free hit"
        }, 
        {
            "def": "an informal form of the game. The term \"playing French Cricket\" can mean that a batsman has not moved his feet and looks ungainly because of this.", 
            "link": "/wiki/French_cricket", 
            "name": "French cricket"
        }, 
        {
            "def": "terms for any poorly executed shot which results in an inside edge which narrowly misses hitting the stumps.[19]", 
            "link": null, 
            "name": "French Cut (also Chinese Cut, Surrey Cut, or Harrow Drive)"
        }, 
        {
            "def": "[citation needed]", 
            "link": null, 
            "name": "Fritz"
        }, 
        {
            "def": "in a batsman's stance the front foot is the foot that is nearer to the bowler. A bowler's front foot is the last foot to contact the ground before the ball is released.", 
            "link": null, 
            "name": "Front foot"
        }, 
        {
            "def": "is the position of the bowler at the moment when his front foot lands on the ground just prior to delivering the ball.", 
            "link": "/wiki/Front_foot_contact", 
            "name": "Front foot contact"
        }, 
        {
            "def": "a shot played with the batsman's weight on his front foot (i.e. the foot nearest the bowler).", 
            "link": null, 
            "name": "Front-foot shot"
        }, 
        {
            "def": "when a bowler delivers a different type of delivery each time, rather than bowling a constant speed, length and angle. Fruit salad bowling is used most commonly in Twenty20 to prevent batsmen from getting comfortable.", 
            "link": null, 
            "name": "Fruit Salad"
        }, 
        {
            "def": "a delivery that pitches closer to the batsman than a ball pitching on a good length, but further away than a half-volley.", 
            "link": null, 
            "name": "Full length"
        }, 
        {
            "def": "a delivery that reaches the batsman on the full, i.e. without bouncing. Usually considered a bad delivery to bowl as the batsman has a lot of time to see the ball and play an attacking shot. Also, it does not have a chance to change direction off the ground, making it the ultimate crime for a spin or seam bowler.[1][3]", 
            "link": "/wiki/Full_toss", 
            "name": "Full toss (also full bunger)"
        }, 
        {
            "def": "another term for the stumps.", 
            "link": null, 
            "name": "Furniture"
        }, 
        {
            "def": "a batsman prodding at the pitch with his bat between deliveries, either to flatten a bump in the pitch, to soothe his own frazzled nerves or simply to waste time or upset the rhythm of the bowler. Considered facetious as there is not really a point to it.[1][3]", 
            "link": null, 
            "name": "Gardening"
        }, 
        {
            "def": "when the batsman takes his time to assess the condition of the pitch, ball or weather etc before starting to attempt more potentially risky strokes.", 
            "link": null, 
            "name": "Getting one's eye in"
        }, 
        {
            "def": "given men were players in the early history of cricket who did not normally play for a particular side but were included, for a particular fixture, to strengthen it. Early first-class matches were usually the subject of big wagers and it was therefore desirable that the two sides should be perceived as being of roughly equal strength. The concept is similar to that of handicapping in modern-day horse racing, whereby horses carry different weights in an attempt to equalise their chances of winning, again to encourage betting.", 
            "link": null, 
            "name": "Given man"
        }, 
        {
            "def": "the shot played very fine behind the batsman on the leg side. A glance is typically played on a short-pitched ball.[8] See also flick.", 
            "link": null, 
            "name": "Glance"
        }, 
        {
            "def": "part of a batsman's kit worn to protect the hands from accidental injury. When a hand is in contact with the bat it is considered part of the bat and so a player can be given out caught to a ball that came off the glove hence \"gloved a catch.\"", 
            "link": null, 
            "name": "Glove"
        }, 
        {
            "def": "the art of wicketkeeping. e.g. 'A marvellous display of glovemanship from the wicketkeeper.'", 
            "link": null, 
            "name": "Glovemanship (also Gauntlet work)"
        }, 
        {
            "def": "a dismissal for nought (zero), from the first ball faced in a batsman's innings. ( cf Duck, Diamond duck, Platinum duck )", 
            "link": null, 
            "name": "Golden duck"
        }, 
        {
            "def": "a dismissal for nought (zero) runs off the first ball faced in each of a batsman's two innings of a two-innings match (see this list of Pairs in test and first class cricket).", 
            "link": null, 
            "name": "Golden pair (also King pair)"
        }, 
        {
            "def": "the ideal place for a stock delivery to pitch in its trajectory from the bowler to the batsman. It makes the batsman uncertain whether to play a front-foot or back-foot shot. A good length differs from bowler to bowler, based on the type, height and speed of the bowler. The \"good length\" is not necessarily the best length to bowl, as a bowler may wish to bowl short or full to exploit a batsman's weaknesses.[1]", 
            "link": null, 
            "name": "Good length"
        }, 
        {
            "def": "a deceptive spinning delivery by a leg spin bowler which spins the opposite direction to the stock delivery. For a right-hander bowler and a right-handed batsman, a googly will turn from the off side to the leg side. Developed by Bosanquet around 1900.[1][3]", 
            "link": "/wiki/Googly", 
            "name": "Googly (also wrong'un or bosie)"
        }, 
        {
            "def": "causing intentional damage to the pitch or ball.", 
            "link": null, 
            "name": "Gouging"
        }, 
        {
            "def": "[citation needed]", 
            "link": null, 
            "name": "Gozza"
        }, 
        {
            "def": "batting defensively with strong emphasis on not getting out, often under difficult conditions.", 
            "link": null, 
            "name": "Grafting"
        }, 
        {
            "def": "a pitch with an unusually high amount of visible grass, that might be expected to assist the pace bowlers.", 
            "link": null, 
            "name": "Green top"
        }, 
        {
            "def": "the rubber casings used on the handle of the bat; alternatively, how the bowler holds the ball and how the batsman holds the bat.", 
            "link": null, 
            "name": "Grip"
        }, 
        {
            "def": "to turn and touch the bat onto the ground surface behind the popping crease after the batsman has left the crease in the action of taking a shot or starting a run; to run the bat in the process of completing a run in order to be safe.", 
            "link": null, 
            "name": "Ground, v"
        }, 
        {
            "def": "the batsman's safe area on the pitch. The batsman is said to be in his/her ground when a part of the body (usually the foot) or the bat is touching the ground surface behind the popping crease. The batsmen is said to have left his/her ground when he/she advances down the pitch in the action of taking a shot or has started a run. The batsman is said to have made his/her ground if able to ground his/her bat or touch the ground surface behind the popping crease with a part of the body before a fielder can break the wicket.", 
            "link": null, 
            "name": "Ground, n"
        }, 
        {
            "def": "a person responsible for maintaining the cricket field and preparing the pitch.[6]", 
            "link": null, 
            "name": "Groundsman (or curator)"
        }, 
        {
            "def": "a delivery that barely bounces.[1]", 
            "link": null, 
            "name": "Grubber"
        }, 
        {
            "def": "the batsman aligning his bat according with a stump (or between stumps) chosen behind him. Typically, the batsman marks the position of the bat on the pitch. The marking(s) give the batter an idea as to where he or she is standing in relation to the stumps.[6]", 
            "link": null, 
            "name": "(Taking) guard"
        }, 
        {
            "def": "a close fielder near the slip fielders, at an angle to a line between the two sets of stumps of about 100 to 140 degrees.[6]", 
            "link": "/wiki/Slip_(cricket)", 
            "name": "Gully"
        }, 
        {
            "def": "a batsman of generally low skill with an excessively aggressive approach to batting, commonly with a preference towards lofted cross bat shots. A poor defensive stance and lack of defensive strokes are also features of a hack. Can also be used for one particular stroke", 
            "link": null, 
            "name": "Hack"
        }, 
        {
            "def": "an individual score of over 50 runs, but not over 100 (century). Reasonably significant landmark for a batsman and more so for the lower order and the tail-enders.", 
            "link": null, 
            "name": "Half century"
        }, 
        {
            "def": "another term for a long hop. So called because the ball roughly bounces halfway down the pitch.", 
            "link": null, 
            "name": "Half-tracker"
        }, 
        {
            "def": "a delivery that bounces just short of the block hole. Usually easy to drive or glance away.[1]", 
            "link": null, 
            "name": "Half-volley"
        }, 
        {
            "def": "occurs when a batsman touches the ball with his/her hands (when they are not gripping the bat) while the ball is still legal. Can result in the batsman being given out.", 
            "link": "/wiki/Handled_the_ball", 
            "name": "Handled the ball"
        }, 
        {
            "def": "see French cut", 
            "link": null, 
            "name": "Harrow drive"
        }, 
        {
            "def": "a bowler taking a wicket off each of three consecutive deliveries that he bowls in a single match (whether in the same over or split up in two consecutive overs, or two overs in two different spells, or even spread across two innings of a test match or first-class cricket game).", 
            "link": "/wiki/Hat-trick_(cricket)", 
            "name": "Hat-trick"
        }, 
        {
            "def": "a delivery bowled after taking two wickets with the previous two deliveries. The captain will usually set a very attacking field for a hat-trick ball, to maximise the chances of the bowler taking a hat-trick.", 
            "link": null, 
            "name": "Hat-trick ball"
        }, 
        {
            "def": "a computer-generated graphic which tracks the trajectory of a delivery between the bowler and batsman, and shows the probable trajectory of the ball if it were not hindered by the batsman. Used in an official capacity by the third umpire to assess lbw decisions under the decision review system. Commentators use Hawk-Eye as a visual aide to assess bowlers' deliveries, and (in the days before the DRS) to assess lbw decisions.[1]", 
            "link": "/wiki/Hawk-Eye", 
            "name": "Hawk-Eye (or Eagle-Eye)"
        }, 
        {
            "def": "see call (2).", 
            "link": null, 
            "name": "Have the call"
        }, 
        {
            "def": "a very heavy cylinder of metal used by the ground staff, to improve a wicket for bowling.", 
            "link": "/w/index.php?title=Heavy_Roller&action=edit&redlink=1", 
            "name": "Heavy Roller"
        }, 
        {
            "def": "the most runs scored by the batsman in a single innings. see also Best bowling", 
            "link": null, 
            "name": "High score"
        }, 
        {
            "def": "[citation needed]", 
            "link": "/w/index.php?title=Hip_Clip&action=edit&redlink=1", 
            "name": "Hip Clip"
        }, 
        {
            "def": "a batsman getting out by dislodging the bails of the wicket behind him either with his bat or body as he tries to play the ball or set off for a run.[2]", 
            "link": "/wiki/Hit_wicket", 
            "name": "Hit wicket"
        }, 
        {
            "def": "an unrefined shot played to the leg side usually across the line of the ball.", 
            "link": null, 
            "name": "Hoick"
        }, 
        {
            "def": "A batsman who is intentionally restricting his scoring and concentrating on defence while his batting partner scores runs at the other end; or, a bowler who is bowling defensively to restrict runs at his end while his bowling partner tries to take wickets at the other end.", 
            "link": null, 
            "name": "Hold up an end"
        }, 
        {
            "def": "To be dismissed by being caught, usually referring to a catch from a lofted shot (or attempt thereof) in the outfield or forward from the wicket, rather than being caught behind by the wicketkeeper, in the slips cordon, or a leg trap fielder from edges or gloved balls.", 
            "link": null, 
            "name": "Hole out"
        }, 
        {
            "def": "a bowler is said to 'have the hoodoo' on a batsman when they have got them out many times in their career. (See rabbit II.)", 
            "link": null, 
            "name": "Hoodoo"
        }, 
        {
            "def": "a shot, similar to a pull, but played so that the ball is struck when it is above the batsman's shoulder.", 
            "link": "/wiki/Pull_shot", 
            "name": "Hook"
        }, 
        {
            "def": "a particularly large amount of swing.[28]", 
            "link": null, 
            "name": "Hoop"
        }, 
        {
            "def": "a technology used in television coverage to evaluate snicks and bat-pad catches. The batsman is filmed with an infrared camera, and friction caused by the strike of the ball shows up as a white \"hot spot\" on the picture.", 
            "link": "/wiki/Hot_Spot_(cricket)", 
            "name": "Hot Spot"
        }, 
        {
            "def": "the cry of a fielding team when appealing, notable because an umpire is not permitted to give the batsman 'out' unless the question is asked.", 
            "link": null, 
            "name": "\"How's that?\" (or \"Howzat?\") "
        }, 
        {
            "def": "the pavilion or dressing room, especially one that is home to a large number of rabbits.[citation needed]", 
            "link": null, 
            "name": "Hutch"
        }, 
        {
            "def": "of a batsman, presently batting.", 
            "link": null, 
            "name": "In"
        }, 
        {
            "def": "a field setting, usually with 5 close fielders and 3 on the boundary, designed to force batsmen into errors by trying to deny the opportunity to score singles while saving easy boundaries.", 
            "link": null, 
            "name": "In/out field"
        }, 
        {
            "def": "the batsman next to come in in the listed batting order. The incoming batsman is the one who is out when a \"timed out\" occurs.", 
            "link": null, 
            "name": "Incoming batsman"
        }, 
        {
            "def": "collective name for four Indian spin bowlers of the 1960s and 1970s—off spinners Erapalli Prasanna and Srinivas Venkataraghavan, leg spinner Bhagwat Chandrasekhar, and left-arm spinner Bishan Singh Bedi.", 
            "link": "/wiki/Indian_spin_quartet", 
            "name": "Indian spin quartet"
        }, 
        {
            "def": "a delivery that curves into the batsman in the air from off to leg.[8]", 
            "link": "/wiki/Inswinger", 
            "name": "Inswing or in-swinger "
        }, 
        {
            "def": "a delivery that moves into the batsman after hitting the surface.", 
            "link": null, 
            "name": "In-cutter"
        }, 
        {
            "def": "the region of the field that lies inside the 30-yard circle (27 m) or, in the days before defined circles, the area of the field close to the wicket bounded by an imaginary line through square leg, mid on, mid off and cover point.[8]", 
            "link": null, 
            "name": "Infield"
        }, 
        {
            "def": "one player's or one team's turn to bat (or bowl). Unlike in baseball, the cricket term \"innings\" is both singular and plural.", 
            "link": "/wiki/Innings", 
            "name": "Innings"
        }, 
        {
            "def": "The edge of the bat facing the batsmen's legs. The ball then generally goes on the stumps,legs or at Forty-Five.", 
            "link": null, 
            "name": "Inside edge"
        }, 
        {
            "def": "number eleven batsman.", 
            "link": null, 
            "name": "Jack "
        }, 
        {
            "def": "an exceptionally well bowled, practically unplayable delivery, usually but not always from a fast bowler.[1][3] Taken from the idea that a 'Jaffa' is the best type of Orange.[citation needed]", 
            "link": null, 
            "name": "Jaffa (also corker) "
        }, 
        {
            "def": "underwear for male cricketers, designed to securely hold a cricket box in place when batting or wicket keeping.", 
            "link": null, 
            "name": "Jockstrap (also jock strap)"
        }, 
        {
            "def": "short form of Wicket-keeper.", 
            "link": null, 
            "name": "Keeper (or 'Keeper)"
        }, 
        {
            "def": "see Golden pair.", 
            "link": null, 
            "name": "King pair"
        }, 
        {
            "def": "a batsman's innings. A batsman who makes a high score in an innings can be said to have had a \"good knock\".", 
            "link": null, 
            "name": "Knock"
        }, 
        {
            "def": "an overseas players who plays in English domestic cricket under the Kolpak ruling.[1]", 
            "link": "/wiki/Kolpak_ruling", 
            "name": "Kolpak"
        }, 
        {
            "def": "a brand of turf cricket ball that has been used for Test matches in Australia, New Zealand and South Africa since 1946, and for all limited overs internationals worldwide.", 
            "link": null, 
            "name": "Kookaburra"
        }, 
        {
            "def": "an informal form of the game, specifically designed to introduce children to the sport.", 
            "link": "/wiki/Kwik_cricket", 
            "name": "Kwik cricket"
        }, 
        {
            "def": "The Indian version of the hoik. Comes from the English 'lap', an old term for a stroke somewhere between a pull and a sweep.[8] In Indian sub-continent, it has its origin to Hindi word 'lapet' meaning 'wind' (verb) owing to the un-skilled circular course of bat.", 
            "link": null, 
            "name": "Lappa"
        }, 
        {
            "def": "The laws of cricket are a set of rules established by the Marylebone Cricket Club (MCC) and apply to cricket worldwide. Cricket is one of the few sports for which the governing principles are referred to as 'Laws' rather than as 'Rules' or 'Regulations'. Note that regulations to supplement and/or vary the laws may be agreed for particular competitions.", 
            "link": null, 
            "name": "Laws"
        }, 
        {
            "def": "The ball hitting the front edge of the bat as opposed to its face, when playing a cross-bat shot such as a pull. Often results in an easy catch for the bowler or a skier for someone else.[1]", 
            "link": null, 
            "name": "Leading edge"
        }, 
        {
            "def": "The action of the batsman not attempting to play at the ball. He may do this by holding the bat above his body. However, there is a clause in the LBW rules making him more susceptible to getting out this way. A batsman leaving the ball may also not claim any leg byes.", 
            "link": null, 
            "name": "Leave"
        }, 
        {
            "def": "A bowler who bowls the ball with his or her left hand is, by convention, called a 'left-arm' or 'left arm' bowler (rather than 'left hand' or 'left-handed'). (Contrast \"left hand batsman\".)[29]", 
            "link": null, 
            "name": "Left arm"
        }, 
        {
            "def": "A left arm who bowls finger spin; the left-handed version of an off spinner.", 
            "link": "/wiki/Left-arm_orthodox_spin", 
            "name": "Left-arm orthodox spin"
        }, 
        {
            "def": "A left arm who bowls wrist spin; the left-handed version of a leg spinner; also known as a Chinaman.", 
            "link": "/wiki/Left-arm_unorthodox_spin", 
            "name": "Left-arm unorthodox spin"
        }, 
        {
            "def": "A batsman who bats left handed is said to be a 'left hand' bat. (Contrast \"left arm bowler\".)[29]", 
            "link": null, 
            "name": "Left hand"
        }, 
        {
            "def": "a way of dismissing the batsman. In brief, the batsman is out if, in the opinion of the umpire, the ball hits any part of the batsman's body (usually the leg) before hitting the bat and would have gone on to hit the stumps.[1][2]", 
            "link": "/wiki/Leg_before_wicket", 
            "name": "Leg before wicket (LBW) "
        }, 
        {
            "def": "A leg spin delivery which, for a right-hander bowler and a right-handed batsman, will turn from the leg side to the off side (usually away from the batsman).[1]", 
            "link": "/wiki/Leg_break", 
            "name": "Leg break"
        }, 
        {
            "def": "Extras taken after a delivery hits any part of the body of the batsman other than the bat or the gloved hand that holds the bat. If the batsman makes no attempt to play the ball with the bat or evade the ball that hits him, leg byes may not be scored.[1]", 
            "link": "/wiki/Leg_bye", 
            "name": "Leg bye"
        }, 
        {
            "def": "A break delivery bowled by a fast or medium-pace bowler with similar action to a spin bowler, but at a faster pace. The ball breaks from the leg side to the off side of the batsman.[1]", 
            "link": "/wiki/Leg_cutter", 
            "name": "Leg cutter"
        }, 
        {
            "def": "A delicate shot played at a ball aimed slightly on the leg side, using the bat to flick the ball as it passes the batsman, deflecting towards the square leg or fine leg area.", 
            "link": "/wiki/Batting_(cricket)#Leg_glance", 
            "name": "Leg glance"
        }, 
        {
            "def": "the half of the field to the rear of the batsman as he takes strike (also known as the on side).[1]", 
            "link": "/wiki/Leg_side", 
            "name": "Leg side"
        }, 
        {
            "def": "a fielding position equivalent to a slip, but on the leg side.", 
            "link": null, 
            "name": "Leg slip"
        }, 
        {
            "def": "a form of bowling in which the bowler imparts spin on the ball by turning the wrist as the ball is delivered, and for that reason also known as \"wrist spin\". The stock delivery for a leg spinner is a leg break; other leg spin deliveries include the googly, the top spinner, and the flipper. The term leg spinner is usually reserved for right handed bowlers who bowl in this manner. Left handers who bowl with wrist spin are known as unorthodox spinners. This is also known as the Chinaman.", 
            "link": "/wiki/Leg_spin", 
            "name": "Leg spin"
        }, 
        {
            "def": "a style of bowling attack where balls are aimed towards the leg side, utilising several close-in, leg side fielders. The aim of leg theory is to cramp the batsman so that he has little room to play a shot and will hopefully make a mistake, allowing the close fielders to prevent runs from being scored or to catch him out. Leg theory is considered boring play by spectators and commentators since it forces batsmen to play conservatively, resulting in few runs being scored. See also fast leg theory and Bodyline.[1]", 
            "link": null, 
            "name": "Leg theory"
        }, 
        {
            "def": "1.  another term for a leg spinner (see leg spin);", 
            "link": null, 
            "name": "Leggie"
        }, 
        {
            "def": "the place along the pitch where a delivery bounces (see short pitched, good length, half-volley, full toss).[1]", 
            "link": null, 
            "name": "Length"
        }, 
        {
            "def": "a batsman being reprieved because of a mistake by the fielding team, through dropping a catch, missing a run-out chance or the wicket-keeper missing a stumping.", 
            "link": null, 
            "name": "Life"
        }, 
        {
            "def": "see bad light", 
            "link": null, 
            "name": "Light"
        }, 
        {
            "def": "a one-innings match where each side may only face a set number of overs. Another name for one-day cricket.", 
            "link": null, 
            "name": "Limited overs match"
        }, 
        {
            "def": "the deviation of the point along the pitch where a delivery bounces from the line from wicket-to-wicket (to the leg side or the off side).[1]", 
            "link": null, 
            "name": "Line (also see Line and length)"
        }, 
        {
            "def": "bowling so that a delivery pitches on a good length and just outside off stump. This forces the batsman to play a shot as the ball may hit the stumps.[1]", 
            "link": "/wiki/Line_and_length", 
            "name": "Line and length bowling"
        }, 
        {
            "def": "the limited-overs equivalent of first-class cricket.", 
            "link": "/wiki/List_A_cricket", 
            "name": "List A cricket"
        }, 
        {
            "def": "an easy ball to hit by a batsman or to catch by a fielder", 
            "link": null, 
            "name": "Lolly"
        }, 
        {
            "def": "a delivery that is much too short to be a good length delivery, but without the sharp lift of a bouncer. Usually considered a bad delivery to bowl as the batsman has a lot of time to see the ball and play an attacking shot.[1]", 
            "link": "/wiki/Long_hop", 
            "name": "Long hop"
        }, 
        {
            "def": "a field position near the boundary on the leg side kept to sweep up straight drives.", 
            "link": null, 
            "name": "Long on"
        }, 
        {
            "def": "a seldom-used field position near the boundary directly behind the wicket-keeper. Useful in case of uncertainty in the competence of the wicket-keeper to cope with irregular bounce in the wicket. A sweeper position in this area may make a come back if fine ramp and upper cut shots become a notable tactic.", 
            "link": null, 
            "name": "Long stop"
        }, 
        {
            "def": "running a single with urgency, the batsman convey the sense (to each other, to the crowd, to commentators) that they will attempt a second run, though no commitment is expected until after the turn. See push, two.", 
            "link": null, 
            "name": "Look for two"
        }, 
        {
            "def": "the curved path of the ball bowled by a spinner.[1]", 
            "link": null, 
            "name": "Loop"
        }, 
        {
            "def": "a poor delivery bowled at the start of a bowler's spell.", 
            "link": null, 
            "name": "Loosener"
        }, 
        {
            "def": "A condition in which a fielding team cannot retrieve a hit ball due to it being lost or otherwise out of reach. The fielding team must call out \"lost ball\" which allows the umpire to stop play. The batsman is credited with having scored at least a six, and a replacement ball is brought in: used and in similar condition to the one lost.", 
            "link": "/wiki/Lost_ball", 
            "name": "Lost ball"
        }, 
        {
            "def": "the batsmen who bat at between roughly number 8 and 11 in the batting order and who may have some skill at batting, but are generally either specialist bowlers or wicket-keepers with limited batting ability. Such batsmen are known as lower order batsmen or tail-enders.", 
            "link": null, 
            "name": "Lower order (colloquially the tail) "
        }, 
        {
            "def": "the first of the two intervals taken during a full day's play, which usually occurs at lunchtime at about 12:30 pm (local time).", 
            "link": "/wiki/Luncheon", 
            "name": "Luncheon"
        }, 
        {
            "def": "an over in which no runs are scored off the bat, and no wides or no balls are bowled. Considered a good performance for a bowler, maiden overs are tracked as part of a bowling analysis.[1][3]", 
            "link": "/wiki/Over_(cricket)", 
            "name": "Maiden over"
        }, 
        {
            "def": "the full face of the bat, where the manufacturer's logo is normally located. Used particularly when referring to a batsman's technique when playing a straight drive, e.g. \"Sachin Tendulkar played a beautiful on-drive for four, giving it plenty of maker's name...\".[1]", 
            "link": null, 
            "name": "Maker's name"
        }, 
        {
            "def": "also called the Skyline. It is a bar graph of the runs scored off each over in a one-day game, with dots indicating the overs in which wickets fell. The name is alternatively applied to a bar graph showing the number of runs scored in each innings in a batsman's career. So called because the bars supposedly resemble the skyscrapers that dominate the skyline of Manhattan.[1]", 
            "link": null, 
            "name": "Manhattan"
        }, 
        {
            "def": "the running-out of a non-striking batsman who leaves his crease before the bowler has released the ball. It is named after Vinoo Mankad, an Indian bowler, who controversially used this method in a Test match. This is relatively common in indoor cricket and is noted separately from run outs, though almost unheard of in first-class cricket.[1]", 
            "link": "/wiki/Run_out#Mankaded", 
            "name": "Mankad"
        }, 
        {
            "def": "an award which may be given to the highest scoring batsman, leading wicket taker or best overall performer in a match. Man of the series is the same over a whole series.", 
            "link": "/wiki/Man_of_the_match#Cricket", 
            "name": "Man of the match"
        }, 
        {
            "def": "a shot played with the bat held parallel to the pitch in front of the batsman, with the toe of the bat pointing towards the bowler. The batsman attempts to flick the ball over the wicket-keeper's head. Famous exponents of the shot include former Zimbabwean international Dougie Marillier, and Kiwi Brendon McCullum, and Sri Lanka's Tillakaratne Dilshan. Also known as the Dilscoop (after Dilshan), the Paddle scoop, the ramp shot.", 
            "link": "/wiki/Marillier_shot", 
            "name": "Marillier shot"
        }, 
        {
            "def": "the cricket club that owns Lord's cricket ground in London NW8. It is the custodian of the laws of cricket.[1]", 
            "link": "/wiki/Marylebone_Cricket_Club", 
            "name": "Marylebone Cricket Club (MCC)"
        }, 
        {
            "def": "bribing players of one of the teams to deliberately play poorly, with the intention of cashing in on bets on the result of the game.", 
            "link": "/wiki/Match_fixing", 
            "name": "Match fixing"
        }, 
        {
            "def": "an official whose role is to ensure that the spirit of the game is upheld. He has the power to fine players and/or teams for unethical play.", 
            "link": null, 
            "name": "Match referee"
        }, 
        {
            "def": "see six.", 
            "link": null, 
            "name": "Maximum"
        }, 
        {
            "def": "the thickest part of the bat, from which the most energy is imparted to the ball.", 
            "link": null, 
            "name": "Meat of the bat"
        }, 
        {
            "def": "a bowler who bowls slower than a pace bowler, but faster than a spin bowler. Speed is important to the medium-pacer, but they try and defeat the batsman with the movement of the ball, rather than the pace at which it is bowled. Medium-pacers either bowl cutters or rely on the ball to swing in the air. They usually bowl at about 55–70 mph (90–110 km/h).", 
            "link": "/wiki/Medium_pace_bowling", 
            "name": "Medium-pace"
        }, 
        {
            "def": "See five-wicket haul.", 
            "link": null, 
            "name": "Michelle"
        }, 
        {
            "def": "the area of the face of the bat that imparts maximum power to a shot if that part of the bat hits the ball. Also known as the \"meat\" of the bat. Effectively the same as the sweet spot; however, a shot that has been \"middled\" usually means one that is hit with great power as well as timing.[1]", 
            "link": null, 
            "name": "Middle of the bat"
        }, 
        {
            "def": "the batsmen who bat at between roughly number 5 and 7 in the batting order. Often includes all-rounders and the wicket-keeper.", 
            "link": null, 
            "name": "Middle order"
        }, 
        {
            "def": "A field position on leg side that is a mirror of extra cover on the off side.", 
            "link": null, 
            "name": "Mid wicket"
        }, 
        {
            "def": "medium-pace bowling that lacks the speed to trouble the batsman. Often has derogatory overtones, suggesting the bowling is boring, innocuous, or lacking in variety, but can also be a term of praise, suggesting a military regularity and lack of unintended variation. A good military medium bowler will pitch the ball on the same perfect line and length for six balls an over, making it very hard for the batsman to score runs.[1]", 
            "link": null, 
            "name": "Military medium"
        }, 
        {
            "def": "shouted by a fieldsman when \"calling\" a catch; that is, announcing to other fieldsmen that he is in a position to take the catch. This is considered good practice, as it prevents two fieldsmen colliding with one another in an attempt to take the same catch. See call.", 
            "link": null, 
            "name": "\"Mine\" "
        }, 
        {
            "def": "a fielder failing to collect the ball cleanly, often fumbling a pick-up or dropping a catch.", 
            "link": null, 
            "name": "Mis-field"
        }, 
        {
            "def": "A cricket bat specifically designed for Twenty20 cricket. The design is unusual in that the blade is 33% shorter than a conventional bat and the handle is 43% longer.", 
            "link": "/wiki/Mongoose_(cricket_bat)", 
            "name": "Mongoose bat"
        }, 
        {
            "def": "a ball that doesn't bounce after pitching. This term was coined by legendary player and commentator Richie Benaud.", 
            "link": null, 
            "name": "Mullygrubber"
        }, 
        {
            "def": "a persistent line of bowling down the leg-side of a batsman to stymie the batsman from scoring (particularly in Test matches).", 
            "link": null, 
            "name": "Negative bowling"
        }, 
        {
            "def": "a score of 111, either of a team or an individual batsman. According to an established superstition, the score is unlucky and at that point a batsman is likely to be dismissed. The traditional measure to avert the bad luck, is for some of the people concerned (usually among the spectators) to stand on one leg. Scores of 222 and 333 are called Double and Triple Nelson respectively.[1] The Australian term \"Devil's number\" or \"Dreaded number\" similarly refers to a superstition concerning a number traditionally regarded as unlucky.", 
            "link": "/wiki/Nelson_(cricket)", 
            "name": "Nelson"
        }, 
        {
            "def": "the period of batsman's innings when his or her score is between 90 and 99. During this phase many players bat extremely cautiously in order to avoid being out before they obtain a century.[1]", 
            "link": "/wiki/Nervous_nineties", 
            "name": "Nervous nineties"
        }, 
        {
            "def": "a pitch surrounded on three sides by netting, used by for practice by batsman and bowler.[8]", 
            "link": null, 
            "name": "Nets"
        }, 
        {
            "def": "In a match, the average run rate scored by a team minus the average run rate scored against them. In a series, a team's NRR is (total runs scored) / (total overs received) – (total runs conceded) / (total overs bowled).[1]", 
            "link": "/wiki/Net_run_rate", 
            "name": "Net run rate (NRR) "
        }, 
        {
            "def": "A small amount of movement by the ball off the seam.[30]", 
            "link": null, 
            "name": "Nibble"
        }, 
        {
            "def": "Another term for edge or snick.[1]", 
            "link": null, 
            "name": "Nick"
        }, 
        {
            "def": "(in a first-class game) a lower order batsman sent in when the light is dimming to play out the remaining overs of the day in order to protect more valuable batsmen for the next day's play.", 
            "link": "/wiki/Nightwatchman_(cricket)", 
            "name": "Nightwatchman"
        }, 
        {
            "def": "batsman's call not to run. See Push, Yes, Two, Wait.[1]", 
            "link": null, 
            "name": "No"
        }, 
        {
            "def": "an illegal delivery; the batting side is awarded one extra, the bowler must deliver another ball in the over, and the batsman cannot be dismissed by the bowler on a no-ball. Most usually a front-foot no ball, in which the bowler oversteps the popping crease; other reasons include bowling a full toss above waist height (see beamer), throwing, having more than two fielders (excluding the wicketkeeper) behind square on the leg side, or breaking the return crease in the delivery stride.[2]", 
            "link": "/wiki/No_ball", 
            "name": "No ball"
        }, 
        {
            "def": "an area of the field where a fielder cannot save a single, nor stop a boundary. Occasionally used to catch a batsman who mistimes a shot.", 
            "link": null, 
            "name": "No man's land"
        }, 
        {
            "def": "the batsman standing at the bowling end.[2]", 
            "link": null, 
            "name": "Non-striker"
        }, 
        {
            "def": "1.  a batsman who is in and has not yet been dismissed, particularly when play has ceased.[8]", 
            "link": "/wiki/Not_out", 
            "name": "Not out"
        }, 
        {
            "def": "to score runs by gently nudging the ball into vacant areas of the field. Also called milking around e.g.: \"He milked the bowler around\".[1]", 
            "link": null, 
            "name": "Nurdle"
        }, 
        {
            "def": "see One Day International", 
            "link": null, 
            "name": "ODI"
        }, 
        {
            "def": "a match in which one side has more players than the other. Generally the extra players were allowed to field as well as bat and so the bowling side had more than 11 fielders.", 
            "link": null, 
            "name": "Odds match"
        }, 
        {
            "def": "an off spin delivery which, for a right-handed bowler and a right-handed batsman, will turn from the off side to the leg side (usually into the batsman).[1]", 
            "link": "/wiki/Off_break", 
            "name": "Off break"
        }, 
        {
            "def": "an off break delivery bowled by a fast or medium-pace bowler which moves into the batsman after hitting the surface. (The ball breaks from the off-side to the leg side of the batsman.) (see In-Cutter)[1]", 
            "link": "/wiki/Off_cutter", 
            "name": "Off cutter"
        }, 
        {
            "def": "the half of the pitch in front of the batsman's body as he takes strike. For the right handed batsman this is the right half of the pitch, looking up the wicket towards the bowler, and the left half for the left handed batsman.[1]", 
            "link": "/wiki/Fielding_(cricket)#Off_and_leg_side_fields", 
            "name": "Off side"
        }, 
        {
            "def": "a form of bowling in which the bowler imparts spin on the ball with the fingers as the ball is delivered, and for that reason also known as \"finger spin\". The usual stock delivery for an off spinner is an off break, but other off spin deliveries includes the arm ball and the doosra. The term off spinner is usually reserved for right handed bowlers who bowl in this manner. Left handers who bowl with finger spin are known as orthodox spinners.[1]", 
            "link": "/wiki/Off_spin", 
            "name": "Off spin"
        }, 
        {
            "def": "when the first run is scored by a batsman, it is said that the batsman is off the mark. If a batsman gets out without scoring, it is said that the batsman failed to get off the mark.[31]", 
            "link": null, 
            "name": "Off the mark"
        }, 
        {
            "def": "Under historical rules, offering the light was the act of the umpires giving the batsmen the choice of whether or not to leave the field during times of bad light. Offering the light has disappeared from the game since 2010, the decision of whether or not to leave the field for bad light is made solely by the umpires.[10]", 
            "link": null, 
            "name": "Offer the light"
        }, 
        {
            "def": "the half of the pitch behind the batsman's body as he takes strike i.e. the left half for a right-handed batsman and the right for a left-hander (also known as the leg side).[1]", 
            "link": "/wiki/Leg_side", 
            "name": "On side"
        }, 
        {
            "def": "a delivery bowled on a good length.", 
            "link": null, 
            "name": "On a length"
        }, 
        {
            "def": "the batsman currently facing the bowling attack is said to be on strike.", 
            "link": null, 
            "name": "On strike"
        }, 
        {
            "def": "a batsman playing a shot, usually a drive, to a ball that is quite short and has already risen to knee height or more as the shot is played.", 
            "link": null, 
            "name": "On the up"
        }, 
        {
            "def": "an abbreviated form of the game, with just one innings per team, usually with a limited number of overs and played over one day.", 
            "link": "/wiki/One-day_cricket", 
            "name": "One-day cricket"
        }, 
        {
            "def": "a match between two national sides limited to 50 overs per innings, played over at most one day.", 
            "link": "/wiki/One_Day_International", 
            "name": "One Day International (ODI)"
        }, 
        {
            "def": "a batsman who bats at No. 3, a crucial position in the team's batting innings.", 
            "link": null, 
            "name": "One down"
        }, 
        {
            "def": "when a batsman fails to make contact with the ground beyond the popping crease, and turns back for an additional run.", 
            "link": null, 
            "name": "One short"
        }, 
        {
            "def": "1.  a batsman skilled at batting at the beginning of an innings, when the ball is new.", 
            "link": null, 
            "name": "Opener"
        }, 
        {
            "def": "1.  shots played in the accepted \"textbook\" manner, and batsmen who play in this manner.", 
            "link": null, 
            "name": "Orthodox"
        }, 
        {
            "def": "1.  the state of a batsman who has been dismissed.", 
            "link": null, 
            "name": "Out"
        }, 
        {
            "def": "a dipper that curves away from the batsman before pitching.", 
            "link": null, 
            "name": "Out dipper"
        }, 
        {
            "def": "a delivery that curves away from the batsman.[1]", 
            "link": "/wiki/Outswinger", 
            "name": "Outswing"
        }, 
        {
            "def": "the part of the field lying outside the 30-yard (27 m) circle measured from the centre of the pitch or, less formally, the part of the pitch furthest from the wickets.[8]", 
            "link": null, 
            "name": "Outfield"
        }, 
        {
            "def": "the delivery of six consecutive legal balls by one bowler.[2]", 
            "link": "/wiki/Over_(cricket)", 
            "name": "Over"
        }, 
        {
            "def": "the number of overs bowled per hour.", 
            "link": null, 
            "name": "Over rate"
        }, 
        {
            "def": "a right-handed bowler passing to the left of the non-striker's stumps in his run-up, and vice versa for a left-handed bowler. Compare with around the wicket.[8]", 
            "link": null, 
            "name": "Over the wicket"
        }, 
        {
            "def": "the action of bowling with the arm swinging from behind the body over the head, releasing the ball on the down swing without bending the elbow. This type of bowling is the only type normally allowed in all official cricket matches. Compare with underarm.", 
            "link": "/wiki/Overarm_bowling", 
            "name": "Overarm"
        }, 
        {
            "def": "a delivery that is full pitched but not a yorker, bouncing just in front of the batsman. Considered a poor delivery, as it easy for the batsman to get the middle of the bat to the ball. An overpitched ball is often a half-volley.[8]", 
            "link": null, 
            "name": "Overpitched delivery"
        }, 
        {
            "def": "the scoring of extra runs due to an errant throw from a fielder. Occasionally used erroneously for any runs scored after a fielder misfields the ball. Also the throw itself.[8]", 
            "link": "/wiki/Overthrow_(cricket)", 
            "name": "Overthrows"
        }, 
        {
            "def": "a style of bowling in which the ball is delivered at high speeds, typically over 90 mph (145 km/h). A pace bowler (or paceman) often will also use swing.", 
            "link": "/wiki/Fast_bowling", 
            "name": "Pace bowling (also fast bowling)"
        }, 
        {
            "def": "protective equipment for batsmen and wicket-keepers, covering the legs.[3]", 
            "link": "/wiki/Pads", 
            "name": "Pads"
        }, 
        {
            "def": "use the pads hit the ball away from the wicket, only possible when there is no danger of LBW (for example, if the ball pitched on the leg side). Using the pad instead of the bat removes the danger of being caught by close fielders.[8]", 
            "link": null, 
            "name": "Pad away or pad-play "
        }, 
        {
            "def": "A very fine sweep, almost just a tickle of the delivery pitched on or outside leg stump.", 
            "link": "/wiki/Batting_(cricket)#Types_of_batting_shots", 
            "name": "Paddle sweep"
        }, 
        {
            "def": "A shot where the batsman scoops the ball over his/her shoulder in order to find a boundary either behind the wicketkeeper or in the fine leg region.[1]", 
            "link": "/wiki/Paddle_scoop", 
            "name": "Paddle scoop"
        }, 
        {
            "def": "a \"pair of spectacles\" (0–0) or a \"pair of ducks\". A batsman's score of nought (zero) runs in both innings of a two-innings match (see this list of Pairs in test and first class cricket).[1]", 
            "link": null, 
            "name": "Pair"
        }, 
        {
            "def": "the number of runs scored between a pair of batsmen before one of them gets dismissed. This also includes the deliveries faced and time taken.", 
            "link": "/wiki/Partnership_(cricket)", 
            "name": "Partnership"
        }, 
        {
            "def": "a specialist batsman (or even a wicketkeeper) who is not known for bowling, but has adequate skills to occasionally bowl a few overs. Captains use part-timers to provide some variation in their attack, and to subject batsmen to bowlers they would not have prepared to face.[33]", 
            "link": null, 
            "name": "Part-time bowler (or part-timer)"
        }, 
        {
            "def": "the grandstand or building complex where the player's dressing rooms and members of the association or club owning the ground are seated. The dressing rooms are generally located in the members' area.", 
            "link": null, 
            "name": "Pavilion"
        }, 
        {
            "def": "a delivery bowled by a fast bowler considered unplayable, usually a really good delivery that a batsman gets out to, or one that is too good that the batsmen cannot even edge.", 
            "link": null, 
            "name": "Peach"
        }, 
        {
            "def": "a bouncer on or just outside off-stump that passes within inches of the batsman's face. So called because the ball is supposedly close enough to the batsman's face that he can smell it.", 
            "link": null, 
            "name": "Perfume ball"
        }, 
        {
            "def": "an over in which one run is scored off each delivery. It looks like picket fences 111111, hence the name.", 
            "link": null, 
            "name": "Picket fences"
        }, 
        {
            "def": "A poor bowler, usually of slow to medium pace whose deliveries are flighted so much as to appear similar to a pie in the air. Considered easy to score off by batsmen – see Buffet Bowling.[3]", 
            "link": null, 
            "name": "Pie Chucker (or Pie Thrower)"
        }, 
        {
            "def": "a lower order batsman promoted up the batting order to increase the run rate. The term, if not the precise sense, is borrowed from baseball.[1]", 
            "link": "/wiki/Pinch_hitter_(cricket)", 
            "name": "Pinch hitter"
        }, 
        {
            "def": "1.  the rectangular surface in the centre of the field where most of the action takes place, usually made of earth or clay. It is 22 yards in length.[1]", 
            "link": "/wiki/Cricket_pitch", 
            "name": "Pitch"
        }, 
        {
            "def": "to bowl a delivery on a fuller length.", 
            "link": null, 
            "name": "Pitch (It) Up "
        }, 
        {
            "def": "a diagram showing where a number of balls, usually from a particular bowler, have pitched.[13] Compare beehive.", 
            "link": null, 
            "name": "Pitch map"
        }, 
        {
            "def": "the ball when it is hit such that it bisects or trisects the fielders placed on the field. The ball usually ends up being a four.", 
            "link": null, 
            "name": "Placement"
        }, 
        {
            "def": "a player dismissed without even facing a ball – most likely by being run out as the non-striker. Also sometimes referred to as a Diamond Duck.", 
            "link": null, 
            "name": "Platinum duck"
        }, 
        {
            "def": "when a batsman aims to hit the ball with the bat but does not make contact", 
            "link": null, 
            "name": "Play and miss"
        }, 
        {
            "def": "for the batsman to hit the ball with his bat but only succeed in diverting it onto the stumps. The batsman is thus out bowled. Also known as \"dragging on\" or \"chopping on\"[1]", 
            "link": null, 
            "name": "Playing on"
        }, 
        {
            "def": "of a dismissal by LBW: indisputable, obvious.[1][3] Of a wicket, giving true bounce.[8]", 
            "link": null, 
            "name": "Plumb"
        }, 
        {
            "def": "A fielding position square of the batsman's off side.", 
            "link": "/wiki/Fielding_(cricket)", 
            "name": "Point"
        }, 
        {
            "def": "the position of the bowler at the moment when the ball is released.", 
            "link": "/wiki/Point_of_release", 
            "name": "Point of release"
        }, 
        {
            "def": "[citation needed]", 
            "link": null, 
            "name": "Pongo"
        }, 
        {
            "def": "[citation needed]", 
            "link": null, 
            "name": "Popper"
        }, 
        {
            "def": "One of two lines in the field defined as being four feet in front of and parallel to that end's bowling crease where the wickets are positioned. A batsman who does not have either the bat or some part of his or her body touching the ground behind the popping crease is considered out of his ground and is in danger of being dismissed run out or stumped.", 
            "link": "/wiki/Popping_crease", 
            "name": "Popping crease"
        }, 
        {
            "def": "a block of overs that in One Day Internationals offer a temporary advantage to the batting side.", 
            "link": "/wiki/Powerplay_(cricket)", 
            "name": "Powerplay"
        }, 
        {
            "def": "South African form of Twenty20", 
            "link": null, 
            "name": "Pro20"
        }, 
        {
            "def": "The name of a limited overs competition played in England towards the late summer. Games are arranged in group stages with later knockout stages for the qualifiers. So named as there are 40 overs per side.", 
            "link": "/wiki/Pro40", 
            "name": "Pro40"
        }, 
        {
            "def": "[citation needed]", 
            "link": null, 
            "name": "Projapoti"
        }, 
        {
            "def": "An area of the pitch defined as two feet wide down the middle of the pitch and beginning five feet from each popping crease. A bowler is not allowed to trespass this area in his or her follow-through or the bowler is given a warning. Three such warnings will immediately bar him or her from bowling for the rest of the innings.", 
            "link": null, 
            "name": "Protected area"
        }, 
        {
            "def": "a shot played to the leg side to a short-pitched delivery, between mid-wicket and backward square-leg.[1]", 
            "link": "/wiki/Pull_shot", 
            "name": "Pull"
        }, 
        {
            "def": "Synonym of runchase.", 
            "link": null, 
            "name": "Pursuit"
        }, 
        {
            "def": "batsman's call for a run, urging his/her partner to look for two. See No, Yes, Two, Wait.", 
            "link": null, 
            "name": "Push"
        }, 
        {
            "def": "Traditionally, a quick bowler was one who completed his over in a short space of time. In more recent years, it has been used as a synonym for a fast or pace bowler. (Paradoxically, a quick bowler in the traditional sense was often also a slow bowler, that is, a bowler who delivered slow deliveries. A fast or pace bowler was rarely also a quick bowler in the traditional sense, because he took a longer time to complete an over.)", 
            "link": null, 
            "name": "Quick"
        }, 
        {
            "def": "the total number of overs (maximum 10) allotted to a bowler in an ODI, or any limited overs match. Typically total overs in the innings divided by 5, rounded to next highest integer.", 
            "link": null, 
            "name": "Quota"
        }, 
        {
            "def": "The batting average of a team divided by the batting average against the team. The batting average of a team is the total number of runs scored divided by the total number of wickets lost. The batting average against is the total number of runs scored against divided by the total number of wickets taken. It is used to separate teams tied on points in first-class tournaments.", 
            "link": null, 
            "name": "Quotient"
        }, 
        {
            "def": "See Marillier shot.", 
            "link": null, 
            "name": "Ramp shot"
        }, 
        {
            "def": "1.  A particularly incompetent batsman, who is invariably a specialist bowler. While most lower order batsmen would be expected to occasionally score some useful runs, a rabbit is expected to be dismissed cheaply almost every time. Another term, ferret, refers to a batsman even worse than a rabbit (named as such because, in the wild, \"a ferret goes in after a rabbit.\")[1]", 
            "link": null, 
            "name": "Rabbit"
        }, 
        {
            "def": "A halt in game proceedings due to rain, but not yet a wash out.", 
            "link": null, 
            "name": "Rain delay"
        }, 
        {
            "def": "Any of various methods of determining which team wins a rain-shortened one-day match. The current preferred method is the Duckworth–Lewis method.", 
            "link": null, 
            "name": "Rain rule"
        }, 
        {
            "def": "A nickname for the red cricket ball. See cherry.", 
            "link": null, 
            "name": "Red cherry"
        }, 
        {
            "def": "A request for an on-field umpiring decision to be reviewed by the third umpire. Referrals can initiate from the standing umpire, or under the Umpire Decision Review System, by the fielding captain or a batsman. Still in the experimental stage and not currently used for all Test series.[34]", 
            "link": null, 
            "name": "Referral"
        }, 
        {
            "def": "Same as asking rate.", 
            "link": null, 
            "name": "Required run rate"
        }, 
        {
            "def": "A vacant day in a touring schedule which can be used to replay or reconvene a match which is washed out. Mostly seen in the latter stages of major limited-overs tournaments.", 
            "link": null, 
            "name": "Reserve day"
        }, 
        {
            "def": "A non-playing day in the middle of a multiple day game. These were once common, but are seldom seen in the modern era.", 
            "link": null, 
            "name": "Rest day"
        }, 
        {
            "def": "for a batsman to voluntarily leave the field during his innings, usually because of injury. A player who retires through injury/illness (\"retired hurt/ill\") may return in the same innings at the fall of a wicket, and continue where he left off.[8] A player who is uninjured (\"retired out\") may return only with the opposing captain's consent.", 
            "link": "/wiki/Substitute_(cricket)", 
            "name": "Retire"
        }, 
        {
            "def": "a right handed batsman sweeping the ball like a left handed batsman and vice versa.[1]", 
            "link": "/wiki/Reverse_sweep", 
            "name": "Reverse sweep"
        }, 
        {
            "def": "the art of swinging the ball contrary to how a conventionally swung ball moves in the air; i.e. movement away from the rough side. Many theories as to how this may occur. Usually happens with an older ball than conventional swing, but not always, atmospheric conditions and bowler skill also being important factors. It has been espoused that once the 'rough' side becomes extremely rough a similar effect to that of a dimpled golf ball may cause it to move more quickly through the air than the 'shiny' side of the ball. Invented by Pakistani fast bowler Sarfaraz Nawaz and later perfected by the likes of Imran Khan, Wasim Akram and Waqar Younis.", 
            "link": "/wiki/Reverse_swing", 
            "name": "Reverse swing"
        }, 
        {
            "def": "A ball bowled short of a length that bounces up higher than expected and strikes the batsman in the midriff (usually the side) and hits several ribs.", 
            "link": null, 
            "name": "Rib tickler"
        }, 
        {
            "def": "a bowler who bowls the ball with his or her right hand is, by convention, called a 'right-arm' or 'right arm' bowler (rather than 'right hand' or 'right-handed'). (Contrast \"right hand batsman\".)[29]", 
            "link": null, 
            "name": "Right arm"
        }, 
        {
            "def": "a batsman who bats right handed is a 'right hand' bat. (Contrast \"right arm bowler\".)[29]", 
            "link": null, 
            "name": "Right hand"
        }, 
        {
            "def": "A field which is set primarily to save singles, consisting of fieldsmen in all or most of the primary positions forward of the wicket, on or about the fielding circle (or where it would be).", 
            "link": null, 
            "name": "Ring field"
        }, 
        {
            "def": "A very hard and flat pitch, good for batting on. Synonyms such as street, highway, etc. may sometimes be used in the same context.", 
            "link": null, 
            "name": "Road"
        }, 
        {
            "def": "[citation needed]", 
            "link": null, 
            "name": "Rogers"
        }, 
        {
            "def": "a cylindrical implement used to flatten the pitch before play.", 
            "link": "/wiki/Road_roller", 
            "name": "Roller"
        }, 
        {
            "def": "to look to make singles wherever possible, in order to ensure that both batsmen are continually facing deliveries and making runs. The opposite of farming the strike.", 
            "link": null, 
            "name": "Rotate the strike"
        }, 
        {
            "def": "a worn-down section of the pitch, often due to bowlers' footmarks, from which spinners are able to obtain more turn.", 
            "link": null, 
            "name": "Rough"
        }, 
        {
            "def": "the type of bowling action in which the bowler's outstretched hand is perpendicular to his body when he releases the ball. Round arm bowling is legal in cricket.", 
            "link": "/wiki/Roundarm_bowling", 
            "name": "Roundarm bowling"
        }, 
        {
            "def": "[citation needed]", 
            "link": null, 
            "name": "Royal Duck"
        }, 
        {
            "def": "The act/task of the team batting second (in a limited-overs match) or batting fourth (in an unlimited overs match), trying to win a match by batting and surpassing the runs accumulated by the opponent.", 
            "link": null, 
            "name": "Run chase"
        }, 
        {
            "def": "dismissal by a member of the fielding side breaking the wicket while the batsman is outside his/her crease in the process of making a run.[2]", 
            "link": "/wiki/Run_out", 
            "name": "Run out"
        }, 
        {
            "def": "the average number of runs scored per over.", 
            "link": "/wiki/Run_rate", 
            "name": "Run rate"
        }, 
        {
            "def": "see approach.", 
            "link": "/wiki/Run-up_(cricket)", 
            "name": "Run up "
        }, 
        {
            "def": "a player from the batting side who assists an injured batsman by running between the wickets. The runner wears and carry the same equipment, and can be run out.[8] Since 2011, runners have not been permitted in international cricket, but can be used at lower grades.[35]", 
            "link": "/wiki/Runner_(cricket)", 
            "name": "Runner"
        }, 
        {
            "def": "The batsmen are safe when in their ground, or starting from a position between the popping creases it have made their ground before a fielder can break the wicket.", 
            "link": null, 
            "name": "Safe"
        }, 
        {
            "def": "A fast yorker (often inswinging) aimed at the batsman's feet.", 
            "link": null, 
            "name": "Sandshoe crusher"
        }, 
        {
            "def": "A batsman who has been wrongly or unluckily given out by an umpire.[citation needed]", 
            "link": null, 
            "name": "Sawn off"
        }, 
        {
            "def": "Someone who scores the progress of the game. Runs, wickets, extras etc", 
            "link": "/wiki/Scorer", 
            "name": "Scorer"
        }, 
        {
            "def": "1.  (noun) the raised stitching running around the circumference of the ball.[1]", 
            "link": null, 
            "name": "Seam"
        }, 
        {
            "def": "a bowling style which uses the uneven conditions of the ball – specifically the raised seam – to make it deviate upon bouncing off the pitch. Contrast with swing bowling.[8]", 
            "link": "/wiki/Seam_bowling", 
            "name": "Seam bowling"
        }, 
        {
            "def": "a seam bowler", 
            "link": "/wiki/Seamer_(bowler)", 
            "name": "Seamer"
        }, 
        {
            "def": "a person who is delegated with the task of choosing players for a cricket team. Typically the term is used in the context of player selection for national, provincial and other representative teams at the professional levels of the game, where a \"panel of selectors\" acts under the authority of the relevant national or provincial cricket administrative body.[8]", 
            "link": null, 
            "name": "Selector"
        }, 
        {
            "def": "a team which bats first after losing the toss is said to have been \"sent in\" by the opposing captain.[36]", 
            "link": null, 
            "name": "Sent in"
        }, 
        {
            "def": "A period of play, from start to lunch, lunch to tea and tea until stumps.[3]", 
            "link": null, 
            "name": "Session"
        }, 
        {
            "def": "of a batsman, contrive to receive the majority of the balls bowled, often to protect a weaker batting partner. Typically involves declining taking singles early in overs, and trying to take singles late in overs.", 
            "link": null, 
            "name": "Shepherd the strike (also farm the strike)"
        }, 
        {
            "def": "a delivery that skids after pitching (i.e. doesn't bounce as high as would be expected), usually at a quicker pace, resulting in a batsman unable to hit the ball cleanly.[1]", 
            "link": null, 
            "name": "Shooter"
        }, 
        {
            "def": "a delivery that bounces relatively close to the bowler. The intent is to make the ball bounce well above waist height (a bouncer). A slow or low-bouncing short-pitched ball is known as a long hop.", 
            "link": null, 
            "name": "Short-pitched"
        }, 
        {
            "def": "the act of the batsman hitting the ball with his bat.", 
            "link": null, 
            "name": "Shot"
        }, 
        {
            "def": "[citation needed]", 
            "link": null, 
            "name": "Short Stop"
        }, 
        {
            "def": "Rather than risk playing the ball, the batsman lifts the bat high above his shoulder to keep his bat and hand out of harm's way.[1]", 
            "link": null, 
            "name": "Shoulder Arms"
        }, 
        {
            "def": "1.  A side on bowler has back foot, chest and hips aligned towards the batsman at the instant of back foot contact.", 
            "link": null, 
            "name": "Side on"
        }, 
        {
            "def": "a large board placed behind the bowler, beyond the boundary, used to provide contrast to the ball, thereby aiding the striker in seeing the ball when it is delivered. Typically coloured white to contrast a red ball, or black to contrast a white ball.[8]", 
            "link": null, 
            "name": "Sightscreen"
        }, 
        {
            "def": "a modifier to the names of some fielding positions to denote that they are unusually close to the batsman, most often silly mid-off, silly mid-on, silly midwicket and silly point.[3]", 
            "link": null, 
            "name": "Silly"
        }, 
        {
            "def": "a run scored by the batsmen physically running once only between the wickets.", 
            "link": "/wiki/Single_(cricket)", 
            "name": "Single"
        }, 
        {
            "def": "a very easy catch. A fielder who misses such a catch is said to have 'dropped a sitter'.", 
            "link": null, 
            "name": "Sitter"
        }, 
        {
            "def": "a shot which passes over or touches the boundary without having bounced or rolled, so called because it scores six runs to the batting side.", 
            "link": "/wiki/Boundary_(cricket)#4_or_6_runs", 
            "name": "Six (or Sixer)"
        }, 
        {
            "def": "(pronounced Sky-er) A mistimed shot hit almost straight up in the air, to the sky. Usually results in the batsman being caught out. Occasionally however the fielder positions himself perfectly to take the catch but misses it or drops it. Such an error is considered very embarrassing for the fielder.", 
            "link": null, 
            "name": "Skier"
        }, 
        {
            "def": "alternative name for Manhattan.", 
            "link": null, 
            "name": "Skyline"
        }, 
        {
            "def": "a cut, but played aggressively or possibly recklessly – a cut (q.v.) being a shot played square on the off side to a short-pitched delivery wide of off stump. So called because the batsman makes a \"cutting\" motion as he plays the shot.", 
            "link": null, 
            "name": "Slash"
        }, 
        {
            "def": "verbal abuse in simple terms, or a psychological tactic in more complex terms. Used by cricketers both on and off the field to gain advantage of the opposition by frustrating them and breaking the concentration of the opposition. Considered in some cricketing countries to be against the spirit of the game, but acceptable in others.[3]", 
            "link": "/wiki/Sledging_(cricket)", 
            "name": "Sledging"
        }, 
        {
            "def": "a kind of cut shot played with the bat making an obtuse angle with the batsman.[8]", 
            "link": null, 
            "name": "Slice"
        }, 
        {
            "def": "a wrist spinner's delivery where backspin is put on the ball.", 
            "link": "/wiki/Slider_(cricket)", 
            "name": "Slider"
        }, 
        {
            "def": "a close fielder behind the batsman, next to the wicket-keeper on the off-side. Also (\"in the slips\", \"at first slip\") the positions occupied by such fielders.[3] Commonly there will be two or three slips in an attacking field (although there is no limit and a captain may use more), and one or none in a defensive field. A specialist slip fieldsman may be known as a slipper.[37]", 
            "link": "/wiki/Slip_(cricket)", 
            "name": "Slip"
        }, 
        {
            "def": "a powerful shot, usually hit in the air in an attempt to score a six, typically without too much concern for proper technique.", 
            "link": "/wiki/Slog", 
            "name": "Slog"
        }, 
        {
            "def": "see death overs.", 
            "link": null, 
            "name": "Slog overs"
        }, 
        {
            "def": "a sweep shot hit hard and in the air, over the same boundary as for a hook. Used exclusively against spin bowlers. A type of slog.[1]", 
            "link": "/wiki/Batting_(cricket)#Slog_and_slog_sweep", 
            "name": "Slog sweep"
        }, 
        {
            "def": "a medium-pace delivery bowled by a fast bowler. Designed to deceive the batsman into playing the ball too early and skying it to a fielder. Has several variations.", 
            "link": "/wiki/Slower_ball", 
            "name": "Slower ball"
        }, 
        {
            "def": "a left-arm, orthodox, finger spin bowler; the left-handed equivalent of an off spinner (see off spin).", 
            "link": null, 
            "name": "Slow left armer"
        }, 
        {
            "def": "a slight deviation of the ball off the edge of the bat.", 
            "link": null, 
            "name": "Snick (also edge)"
        }, 
        {
            "def": "a television graphic, also available for use by the third umpire, used to assess on a replay whether or not the batsman has snicked the ball. The graphic juxtaposes a slow motion replay with a sound oscilloscope, and is used to assess whether a sharp sound was recorded at the same moment as the ball passes the bat. Sometimes shortened to snicko.", 
            "link": "/wiki/Snickometer", 
            "name": "Snickometer"
        }, 
        {
            "def": "To bat with soft hands (or play with a soft bat) is to hold the bat loosely or with relaxed hands so that it absorbs the ball's momentum, meaning that the ball does not rebound sharply off it when the shot is played.", 
            "link": null, 
            "name": "Soft hands (batting) (also soft bat)"
        }, 
        {
            "def": "To catch the ball with soft hands is to relax the hands and follow through the motion of the ball in the air, allowing the ball to hit the hands gently rather than risking it bouncing out of the hands.", 
            "link": null, 
            "name": "Soft hands (fielding)"
        }, 
        {
            "def": "a player selected in the team primarily for a single skill, i.e. not an all-rounder or a wicketkeeper-batsman. Such players can be referred to as specialist batsmen, specialist bowlers, or specialist wicketkeepers.", 
            "link": null, 
            "name": "Specialist"
        }, 
        {
            "def": "another word for a pair. From the appearance of two ducks on the scorecard as 0–0.", 
            "link": null, 
            "name": "Spectacles"
        }, 
        {
            "def": "1.  the number of continuous overs a bowler bowls before being relieved.", 
            "link": null, 
            "name": "Spell"
        }, 
        {
            "def": "[citation needed]", 
            "link": null, 
            "name": "Spider Graph (also Wagon Wheel)"
        }, 
        {
            "def": "a style of bowling in which a spin bowler (\"spinner\") attempts to deceive the batsman by imparting spin on the ball using either their fingers or their wrist. Spin bowling is most effective when the ball is travelling relatively slowly, and so most spinners bowl at a pace between 40 and 55 mph.", 
            "link": "/wiki/Spin_bowling", 
            "name": "Spin bowling"
        }, 
        {
            "def": "the joint between the handle and the blade of a bat; the weakest part of the bat. If the ball hits the splice it is likely to dolly up for an easy catch.", 
            "link": null, 
            "name": "Splice"
        }, 
        {
            "def": "1.  of a position on the field, perpendicular to the line of the pitch; the opposite of fine.", 
            "link": null, 
            "name": "Square"
        }, 
        {
            "def": "1.  a fielding position on the on side approximately at right angles to the batsman", 
            "link": null, 
            "name": "Square leg"
        }, 
        {
            "def": "A cut shot, played square, i.e. perpendicular to the bowler's delivery.", 
            "link": null, 
            "name": "Square-cut"
        }, 
        {
            "def": "the posture of a batsman holding his bat when facing a delivery.", 
            "link": null, 
            "name": "Stance (also batting stance)"
        }, 
        {
            "def": "A synonym for partnership.", 
            "link": null, 
            "name": "Stand (noun)"
        }, 
        {
            "def": "An Umpire who officiates a cricket match is described as standing in that match.[citation needed]", 
            "link": null, 
            "name": "Stand (verb)"
        }, 
        {
            "def": "position adopted by a Wicket-keeper, close to the stumps, when a slow (or, occasionally, medium pace) bowler is operating.", 
            "link": null, 
            "name": "Standing up"
        }, 
        {
            "def": "a batsman is said to have a start when he successfully avoids being dismissed for very few runs; in Australia, this is generally understood to mean a score of twenty runs. Once a batsman survives this initial period and becomes established, batting generally becomes easier as he has settled into a rhythm and has adapted to the playing conditions and is less vulnerable, so they are then expected to convert their starts into big scores.", 
            "link": null, 
            "name": "Start"
        }, 
        {
            "def": "a bowler taking a fast run-up to bowl is said to be steaming in.", 
            "link": null, 
            "name": "Steaming in"
        }, 
        {
            "def": "a drying wicket that is exceedingly difficult to bat on. Uncommon if not non-existent in recent years due to the routine covering of pitches.", 
            "link": null, 
            "name": "Sticky dog"
        }, 
        {
            "def": "a difficult wet pitch.[8]", 
            "link": "/wiki/Sticky_wicket", 
            "name": "Sticky wicket"
        }, 
        {
            "def": "a bowler whose role is to restrict scoring rather than to take wickets. Usually called upon to bowl large amounts of overs at a miserly run rate while strike bowlers rest between spells or attempt to take wickets from the other end.", 
            "link": null, 
            "name": "Stock bowler"
        }, 
        {
            "def": "a bowler's standard delivery; the delivery a bowler bowls most frequently. Bowlers usually have one stock delivery and one or more variation deliveries.", 
            "link": null, 
            "name": "Stock delivery (also stock ball)"
        }, 
        {
            "def": "a batsman who makes it his job to defend and to score at a mediocre rate. This style is prone to derogatory comments but also compliments on resilience and technique.", 
            "link": null, 
            "name": "Stodger"
        }, 
        {
            "def": "a batsman who plays defensively rather than trying to score.[38]", 
            "link": null, 
            "name": "Stonewaller"
        }, 
        {
            "def": "the bat when held vertically, or when swung through a vertical arc", 
            "link": "https://en.wiktionary.org/wiki/Straight_bat", 
            "name": "Straight bat"
        }, 
        {
            "def": "pejorative term for a fast- or medium-paced bowler who cannot swing or seam the ball.", 
            "link": null, 
            "name": "Straight up-and-down"
        }, 
        {
            "def": "a batsman is said to be stranded on his score if he narrowly misses scoring a century or similar milestone because his team's innings ends, rather than because he was dismissed.", 
            "link": null, 
            "name": "Stranded"
        }, 
        {
            "def": "[citation needed]", 
            "link": null, 
            "name": "Strangled"
        }, 
        {
            "def": "a pitch which is easy for batsmen and difficult for bowlers. Sometimes called a road, highway, and various other synonyms for street.", 
            "link": null, 
            "name": "Street"
        }, 
        {
            "def": "the position as batsman, as opposed to non-striker. Often, 'Keep [the] strike', to arrange runs on the last ball of an over so as to face the first ball of the next. 'Shepherd the Strike': to keep doing this to protect a less skilful batsman.[2]", 
            "link": null, 
            "name": "Strike"
        }, 
        {
            "def": "an attacking bowler whose role is to take wickets rather than to restrict scoring. Usually a fast bowler or attacking spinner who bowls in short spells to attacking field settings.", 
            "link": null, 
            "name": "Strike bowler"
        }, 
        {
            "def": "1.  (batting) a percentage equal to the number of runs scored by a batsman divided by the number of balls faced.", 
            "link": "/wiki/Strike_rate", 
            "name": "Strike rate"
        }, 
        {
            "def": "the batsman who faces the deliveries bowled.", 
            "link": null, 
            "name": "Striker"
        }, 
        {
            "def": "an attempt by the batsman to play at a delivery.", 
            "link": null, 
            "name": "Stroke"
        }, 
        {
            "def": "1.  one of the three vertical posts making up the wicket (\"off stump\", \"middle stump\" and \"leg stump\");[2]", 
            "link": "/wiki/Stump_(cricket)", 
            "name": "Stump"
        }, 
        {
            "def": "A small television camera inside middle stump to provide images of play close to the stumps, particularly when a batsman is bowled out.[39]", 
            "link": null, 
            "name": "Stump-cam"
        }, 
        {
            "def": "[citation needed]", 
            "link": null, 
            "name": "Sun ball"
        }, 
        {
            "def": "a run not attributed to any batsman, such as a bye, leg bye, wide or no-ball.", 
            "link": null, 
            "name": "Sundry (also extra)"
        }, 
        {
            "def": "Under experimental One-Day International rules played between July 2005 and February 2006, the supersub was a substitute player able to come on and replace any player at any point during the game, with the substitute able to take over the substituted player's batting and bowling duties – as distinct from a traditional substitute, who can field but is not permitted to bat, bowl or keep wicket.[40]", 
            "link": null, 
            "name": "Supersub"
        }, 
        {
            "def": "see French Cut", 
            "link": null, 
            "name": "Surrey Cut"
        }, 
        {
            "def": "a shot played to a good length slow delivery. The batsman gets down on one knee and \"sweeps\" the ball to the leg side.", 
            "link": "/wiki/Batting_(cricket)#Sweep", 
            "name": "Sweep"
        }, 
        {
            "def": "the small area on the face of the bat that gives maximum power for minimum effort when the ball is hit with it. Also known as the \"middle\" or \"meat\" of the bat. A shot that is struck with the sweet spot is referred to as being \"well timed\" (see timing).", 
            "link": null, 
            "name": "Sweet spot"
        }, 
        {
            "def": "a bowling style usually employed by fast and medium-pace bowlers. The fielding side will polish the ball on one side of the seam only; as the innings continues, the ball will become worn on one side, but shiny on the other. When the ball is bowled with the seam upright, the air will travel faster over the shiny side than the worn side. This makes the ball swing (curve) in the air. Conventional swing would mean that the ball curves in the air away from the shiny side. (see reverse swing).[8]", 
            "link": "/wiki/Swing_bowling", 
            "name": "Swing"
        }, 
        {
            "def": "a rapid or careless attacking stroke by the batsman.", 
            "link": null, 
            "name": "Swish"
        }, 
        {
            "def": "a shot played by a batsman who reverses both his stance and his grip during the bowler's run-up, so that a right-handed batsman would play the shot as an orthodox left-hander. The shot was popularised by England batsman Kevin Pietersen, prompting some discussion about its impact on the rules, e.g. for lbw decisions in which it is necessary to distinguish between off and leg stumps.", 
            "link": "/wiki/Switch_hit", 
            "name": "Switch hit"
        }, 
        {
            "def": "common colloquialism for the lower order of a batting line-up.[3]", 
            "link": null, 
            "name": "Tail"
        }, 
        {
            "def": "a player who bats towards the end of the batting order, usually a specialist bowler or wicket-keeper with relatively poor batting skills.[1]", 
            "link": "/wiki/Tail-ender", 
            "name": "Tail-ender"
        }, 
        {
            "def": "The score that the team batting last has to score to beat their opponents. This is one run more than what the team batting first managed; or, in limited overs cricket, an adjusted value determined by a rain rule.", 
            "link": null, 
            "name": "Target"
        }, 
        {
            "def": "the second of the two intervals during a full day's play is known as the tea interval, due to its timing at about tea-time. In matches lasting only an afternoon, the tea interval is usually taken between innings.", 
            "link": null, 
            "name": "Tea"
        }, 
        {
            "def": "A variation delivery for an off spin bowler, Saqlain Mushtaq has been credited with creating it. Teesra comes from the Urdu meaning \"the third one\".\n\n\n\nA doosra with extra bounce.\nA ball that drifts in from wide of off stump and turns away from the right hander sharply with extra bounce.\nA finger spinner's back-spinner. Similar to a wrist spinner's slider or flipper.[41]\n\n\nThe actual definition of this ball has yet to have been definitively announced.\n\n", 
            "link": null, 
            "name": "Teesra"
        }, 
        {
            "def": "A two-innings match in which a bowler takes ten or more wickets in total.", 
            "link": null, 
            "name": "Ten-wicket match"
        }, 
        {
            "def": "a cricket match with play spread over five days with unlimited overs played between two senior international teams. Considered the highest level of the game.", 
            "link": "/wiki/Test_cricket", 
            "name": "Test match"
        }, 
        {
            "def": "A shot played by the batsmen with perfect technique, also known as a cricket shot", 
            "link": null, 
            "name": "Textbook Shot"
        }, 
        {
            "def": "position behind the wicket-keeper on the off-side, beyond the slip and gully areas", 
            "link": null, 
            "name": "Third man"
        }, 
        {
            "def": "an off-field umpire, equipped with a television monitor, whose assistance the two on-field umpires can seek when in doubt.", 
            "link": "/wiki/Third_umpire", 
            "name": "Third umpire"
        }, 
        {
            "def": "\"bowled through the gate\": dismissed with a ball that passes between the bat and the pads before hitting the wicket.", 
            "link": null, 
            "name": "Through the gate"
        }, 
        {
            "def": "of a bowler, an illegal bowling action in which the arm is straightened during the delivery.", 
            "link": null, 
            "name": "Throwing"
        }, 
        {
            "def": "An old name for a yorker.", 
            "link": null, 
            "name": "Tice"
        }, 
        {
            "def": "An edge to the wicket-keeper or slips. Alternatively a delicate shot usually played to third man or fine leg.", 
            "link": null, 
            "name": "Tickle"
        }, 
        {
            "def": "the result of a cricket in which the two teams' scores are equal and the team batting last is all out; or in a limited overs match, the allotted overs have been played. Not to be confused with a draw, in which neither team wins but the scores are not equal.", 
            "link": "/wiki/The_result_in_cricket", 
            "name": "Tie"
        }, 
        {
            "def": "A batsmen or batting team having their run-making restricted by the bowling side.", 
            "link": null, 
            "name": "Tied down"
        }, 
        {
            "def": "the (wooden) stumps. Achieving a Bowled dismissal is to have \"hit the timber\", or simply \"Timber!\".", 
            "link": null, 
            "name": "Timber"
        }, 
        {
            "def": "a match whose duration is based on a set amount of time rather than a set number of overs. Timed matches usually have a draw as a potential result, in addition to the win/loss or tie that can be achieved in limited overs cricket. All first class cricket is currently played under a timed format.", 
            "link": null, 
            "name": "Timed match"
        }, 
        {
            "def": "a match which is played until both teams have completed their allotted innings or overs, regardless of how many days are required. Many early first class matches were played in a timeless format, but the need for advanced scheduling has meant that timeless matches are seldom played today.", 
            "link": null, 
            "name": "Timeless match"
        }, 
        {
            "def": "the art of striking the ball so that it hits the bat's sweet spot. A \"well-timed\" shot imparts great speed to the ball but appears effortless.", 
            "link": null, 
            "name": "Timing"
        }, 
        {
            "def": "see century.[1]", 
            "link": null, 
            "name": "Ton"
        }, 
        {
            "def": "the ball hitting the top edge of the bat when a batsmen plays a cross-bat shot", 
            "link": null, 
            "name": "Top edge"
        }, 
        {
            "def": "the batsmen batting in the top 4 in the batting order. These are generally the most skilled batsmen in the team, equipped with the technique and temperament to continue batting for long periods, often for hours or a whole day.", 
            "link": null, 
            "name": "Top order"
        }, 
        {
            "def": "forward rotation on the ball, causing it to increase speed immediately after pitching.[8]", 
            "link": "/wiki/Topspinner", 
            "name": "Top spin"
        }, 
        {
            "def": "An organised itinerary of matches requiring travel away from the team's usual base. Used especially in international cricket for the representative team of one nation playing a series of matches in another nation.[42]", 
            "link": null, 
            "name": "Tour"
        }, 
        {
            "def": "any match on a tour which does not have full international status; most typically matches played as a warm-up between the travelling international team and a local club or composite team.", 
            "link": null, 
            "name": "Tour match"
        }, 
        {
            "def": "another term for the pitch.", 
            "link": null, 
            "name": "Track"
        }, 
        {
            "def": "[citation needed]", 
            "link": null, 
            "name": "Triggerd"
        }, 
        {
            "def": "a high-quality fast bowling delivery, especially one that results in a dismissal of a batsman by removing the bails without hitting the stumps", 
            "link": null, 
            "name": "Trimmer"
        }, 
        {
            "def": "a reliable, steady medium-pace bowler who is not especially good, but is not especially bad either.[1]", 
            "link": null, 
            "name": "Trundler"
        }, 
        {
            "def": "manner in which a batsman grounds the bat at the end of a run, change directions, and prepare to take another run. The correct execution is for the batsman to turn towards the side of the field the ball was played to in order to judge whether another run is possible. See Turn blind, Two. Also a term used to describe the amount a spin ball changes directions - turns/spins - after hitting the pitch. For example \"That leg spin turned a lot.\"", 
            "link": null, 
            "name": "Turn"
        }, 
        {
            "def": "turn by a batsman facing to the side of field away from that to which the ball was played, deprecated as it increases the danger of a run out.", 
            "link": null, 
            "name": "Turn blind"
        }, 
        {
            "def": "Traditionally, the first substitute player who fields when a member of the fielding side is injured. In Test matches, twelve players are named to a team prior to the match, with the final reduction to eleven occurring immediately prior to play commencing on the first day. This gives the captain some flexibility in team selection, dependent on the conditions (e.g. a spin bowler may be named to the team, but omitted if the captain feels that the pitch is not suitable for spin bowling).[1]", 
            "link": null, 
            "name": "Twelfth man"
        }, 
        {
            "def": "a form of limited overs cricket in which each team has one innings with a maximum length of twenty overs.", 
            "link": "/wiki/Twenty20", 
            "name": "Twenty20 (or T20) "
        }, 
        {
            "def": "batsman's call for a probable two runs, requiring his/her partner to commit to a fast turn. See No, Push, Yes, Wait.", 
            "link": null, 
            "name": "Two"
        }, 
        {
            "def": "one of the two (or three) enforcers of the laws[44] and adjudicators of play.", 
            "link": "/wiki/Umpire_(cricket)", 
            "name": "Umpire"
        }, 
        {
            "def": "a system which allows the fielding captain or the batsmen to request the third umpire to review the standing umpires' previous decision using technological aids, in the hope of having a dismissal awarded (in the case of the fielding captain) or overturned (in the case of the batsman).", 
            "link": "/wiki/Umpire_Decision_Review_System", 
            "name": "Umpire Decision Review System (UDRS, or simply Decision Review System or DRS)"
        }, 
        {
            "def": "the action of bowling with the arm swinging from behind the body in a downswing arc and then releasing the ball on the up swing without bending the elbow. This type of bowling is now illegal in formal cricket, but commonly played in informal types of cricket. Compare with overarm.", 
            "link": "/wiki/Underarm_bowling", 
            "name": "Underarm"
        }, 
        {
            "def": "backward rotation on the ball, causing it to decrease speed immediately after pitching.", 
            "link": null, 
            "name": "Under-spin (also back-spin)"
        }, 
        {
            "def": "1.  a shot played not in the accepted \"textbook\" manner, often with a degree of improvisation.", 
            "link": null, 
            "name": "Unorthodox"
        }, 
        {
            "def": "a ball that is impossible for the batsman to deal with; used to imply that the batsman was out more through the skill of the bowler than through his own error.", 
            "link": null, 
            "name": "Unplayable delivery"
        }, 
        {
            "def": "A typical shot played against a short ball or bouncer. Here the batsmen makes a cut above his head and the ball usually goes to the third-man area.", 
            "link": null, 
            "name": "Upper Cut"
        }, 
        {
            "def": "A shot that gains a risky amount of height, opening up the possibility of the batsman being caught.", 
            "link": null, 
            "name": "Uppish"
        }, 
        {
            "def": "[citation needed]", 
            "link": null, 
            "name": "Vatta"
        }, 
        {
            "def": "1.  an unmarked, loosely defined V-shaped area on the ground at which the batsman stands at the apex. The two sides of the \"V\" go through the mid-off and mid-on regions. Most shots played into this region are straight-batted shots, which don't involve the risks associated with playing across the line.", 
            "link": null, 
            "name": "Vee"
        }, 
        {
            "def": "the kind of level of cricket played by the majority of the cricket-watching public. Traditionally applied pejoratively when the standard of play (particularly from professionals) is very low. e.g. \"That shot/dropped catch/bowling was village\"", 
            "link": "/wiki/Village_cricket", 
            "name": "Village or Village cricket"
        }, 
        {
            "def": "A loose non-committal shot, usually played to a ball pitched short of length and well wide of the off stump.", 
            "link": null, 
            "name": "Waft"
        }, 
        {
            "def": "when the tail (the lower order of the batting line-up) scores more runs than it is expected to, it is said to have wagged (as an extension of the animal tail metaphor)", 
            "link": null, 
            "name": "Wag"
        }, 
        {
            "def": "a graphical chart which divides a cricket ground into six sectors (looking like the spokes of a wagon style wheel), and shows how many runs a batsman has scored into each area.[13][45] The term may also be used for the Spider Graph, a similar graphic that displays the same information in greater detail.", 
            "link": null, 
            "name": "Wagon wheel"
        }, 
        {
            "def": "of a batsman, to walk off the pitch, knowing or believing that he is out, rather than waiting for an umpire to give him out (forfeiting the chance that the umpire may give the benefit of the doubt regarding a dismissal if he is not certain that the batsman is out). Generally considered to be sportsmanlike behaviour, but rare in international cricket.[1]", 
            "link": null, 
            "name": "Walk"
        }, 
        {
            "def": "fielders will, unless fielding close in, usually \"walk in\" a few paces just before the bowler bowls in order to be alert if ball is hit in their direction.", 
            "link": null, 
            "name": "Walking in"
        }, 
        {
            "def": "a very poor batsman, particularly tail-end batsmen, who are usually specialist bowlers.[citation needed]", 
            "link": null, 
            "name": "Walking wicket"
        }, 
        {
            "def": "a cricket match, or a specific day of a cricket match, which is abandoned with either no play or very little play due to rain.", 
            "link": null, 
            "name": "Wash out"
        }, 
        {
            "def": "On a turf pitch, typically consisting of dry/dead grass on the top, the soil can be loosened because of the players, stepping on it during play, and rough, abrasive patches can form. This means that as the pitch wears, or becomes worn, balls that land in these rough areas will grip the surface more and turn more drastically, thereby becoming more helpful to spin bowling. Uneven bounce can also result.", 
            "link": null, 
            "name": "Wearing wicket"
        }, 
        {
            "def": "1.  a set of stumps and bails;", 
            "link": "/wiki/Wicket", 
            "name": "Wicket"
        }, 
        {
            "def": "the player on the fielding side who stands immediately behind the batting end wicket. A specialist position, used throughout the game. The wicket-keeper is the only player in the fielding side allowed to wear gloves and external leg guards, under Law 40.[2]", 
            "link": "/wiki/Wicket-keeper", 
            "name": "Wicket-keeper "
        }, 
        {
            "def": "a wicket-keeper who is also a very good batsman, capable of opening the batting or at least making good scores in the top order.", 
            "link": null, 
            "name": "Wicket-keeper/batsman"
        }, 
        {
            "def": "a maiden over in which the bowler also dismisses a batsman. A double wicket maiden if two wickets are taken, and so on.[2]", 
            "link": null, 
            "name": "Wicket maiden"
        }, 
        {
            "def": "an imaginary line connecting the two wickets, also a style of straight, un-varied bowling.", 
            "link": null, 
            "name": "Wicket-to-wicket (or stump-to-stump)"
        }, 
        {
            "def": "a delivery that passes illegally wide of the wicket, scoring an extra for the batting side. A wide does not count as one of the six valid deliveries that must be made in each over – an extra ball must be bowled for each wide.[1][2]", 
            "link": "/wiki/Wide_(cricket)", 
            "name": "Wide"
        }, 
        {
            "def": "a plot of either the cumulative runs scored, or the progressive run rate achieved by a team (the y-axis) against the over number (x-axis) in limited-overs cricket.", 
            "link": null, 
            "name": "Worm"
        }, 
        {
            "def": "when the bowling foot is the front foot the delivery is said to be bowled off the wrong foot. Such a bowler is said to bowl off the wrong foot.", 
            "link": null, 
            "name": "Wrong foot"
        }, 
        {
            "def": "when the batsman is initially moving either back or forward to a delivery and then has to suddenly change which foot he uses (back or front), he is said to have been wrong-footed. Usually applies to spin bowling.", 
            "link": null, 
            "name": "Wrong footed"
        }, 
        {
            "def": "another name for a googly; most common in Australia.[1][3]", 
            "link": null, 
            "name": "Wrong 'un"
        }, 
        {
            "def": "batsman's call for a run. See No, Push, Two, Wait.", 
            "link": null, 
            "name": "Yes"
        }, 
        {
            "def": "The Yips are occasionally experienced by bowlers suffering from a loss of confidence. A psychological condition whereby the bowler is unable to sufficiently relax when delivering the ball – often holding the ball too long before release, losing flight, turn and accuracy in the process. Bowlers have been known to suffer from The Yips for as little as a few overs, up to the course of an entire season or more.[1]", 
            "link": "/wiki/Yips", 
            "name": "(The) Yips"
        }, 
        {
            "def": "a (usually fast) delivery that is pitched very close to the batsman. The intent is for it to pitch exactly underneath his bat or on his toes, in the block hole. A perfectly pitched fast yorker is almost impossible to keep out; a poorly delivered yorker can turn into a half-volley (too short) or a full toss (too full).[1]", 
            "link": "/wiki/Yorker", 
            "name": "Yorker"
        }, 
        {
            "def": "a variation of the flipper bowled by a leg-break bowler. Typically 'Zoots' along the ground without much bounce. This ball is possibly a myth made up by Shane Warne to create confusion amongst opposition sides.[1]", 
            "link": null, 
            "name": "Zooter or Zoota "
        }
    ]
}