{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_the_American_trucking_industry", 
    "words": [
        {
            "def": "\nMain article: Bill of lading\n", 
            "link": null, 
            "name": "Bill of lading (BOL, BL, B/L)"
        }, 
        {
            "def": "Operating a tractor unit with no trailer attached.", 
            "link": null, 
            "name": "Bobtailing"
        }, 
        {
            "def": "A person or company that arranges for the truck transportation of cargo belonging to others, using for-hire carriers to provide the actual truck transportation.[5]", 
            "link": null, 
            "name": "Broker"
        }, 
        {
            "def": "\nMain article: Bulk cargo\n", 
            "link": null, 
            "name": "Bulk cargo"
        }, 
        {
            "def": "See bulk cargo.", 
            "link": null, 
            "name": "Bulk freight"
        }, 
        {
            "def": "See freight.", 
            "link": null, 
            "name": "Cargo"
        }, 
        {
            "def": "\nMain article: Consignee\n", 
            "link": null, 
            "name": "Consignee"
        }, 
        {
            "def": "\nMain article: Consignment\n", 
            "link": null, 
            "name": "Consignment"
        }, 
        {
            "def": "\nMain article: Consignor\n", 
            "link": null, 
            "name": "Consignor"
        }, 
        {
            "def": "Operating a truck empty.[8]", 
            "link": null, 
            "name": "Deadheading"
        }, 
        {
            "def": "\nMain article: Electronic on-board recorder\n", 
            "link": null, 
            "name": "Electronic on-board recorder (EOBR)"
        }, 
        {
            "def": "\nMain article: Float shifting\n", 
            "link": null, 
            "name": "Float shifting"
        }, 
        {
            "def": "\nMain article: Freight\n", 
            "link": null, 
            "name": "Freight"
        }, 
        {
            "def": "\nMain article: Dangerous goods\n", 
            "link": null, 
            "name": "Hazardous materials (Haz-mat)"
        }, 
        {
            "def": "\nMain article: Intermodal freight transport\n", 
            "link": null, 
            "name": "Intermodal"
        }, 
        {
            "def": "\nMain article: Just-in-time (business)\n", 
            "link": null, 
            "name": "Just-in-time"
        }, 
        {
            "def": "\nMain article: Logbook\n", 
            "link": null, 
            "name": "Log book"
        }, 
        {
            "def": "A document that describes the contents of a shipment in greater detail than a bill of lading. Commonly used as a checklist during unloading.[13][14]", 
            "link": null, 
            "name": "Manifest"
        }, 
        {
            "def": "Motor carriers for-hire must apply for the authority to engage in interstate commerce with the Federal Motor Carrier Safety Administration.[5]", 
            "link": null, 
            "name": "Operating authority"
        }, 
        {
            "def": "\nMain article: Oversize load\n", 
            "link": null, 
            "name": "Oversize load"
        }, 
        {
            "def": "\nMain article: Pallet\n", 
            "link": null, 
            "name": "Pallet"
        }, 
        {
            "def": "Consignee, importer, or buyer (who may or may not be the same) named in the bill of lading as the party responsible for receiving a shipment.[18]", 
            "link": null, 
            "name": "Receiver"
        }, 
        {
            "def": "A consignor, exporter, or seller (who may or may not be the same) named in the bill of lading as the party responsible for initiating a shipment.[19]", 
            "link": null, 
            "name": "Shipper"
        }, 
        {
            "def": "A dock or hub where freight originates, terminates, or is handled in the transportation process; or a location where motor carriers maintain operating facilities.[10]", 
            "link": null, 
            "name": "Terminal"
        }, 
        {
            "def": "\nMain article: Tractor unit\n", 
            "link": null, 
            "name": "Tractor"
        }, 
        {
            "def": "The capability to connect a truck to a land-based electric power supply (\"Shore power\") at a truck stop. Eliminates the need for engine idling while parked, and in the case of IdleAire, also supplies land-based climate control within the truck cab, as well as Internet and TV access.[20]", 
            "link": "/wiki/Truck_stop_electrification", 
            "name": "Truck Stop Electrification (TSE)"
        }, 
        {
            "def": "\nMain article: Common carrier\n", 
            "link": null, 
            "name": "Common carrier"
        }, 
        {
            "def": "Employee of a carrier who is assigned to drive company-owned trucks.[22]", 
            "link": null, 
            "name": "Company driver"
        }, 
        {
            "def": "A for-hire carrier contracted to one particular shipper. A contract carrier enters into a contract whose terms are negotiated between a specific carrier and specific customer.[5]", 
            "link": null, 
            "name": "Contract carrier"
        }, 
        {
            "def": "A driver or carrier who transports cargo between regular, prescribed routes. Regular route drivers usually are at home on regular intervals, given the scheduled nature of their routes.[23][24][25]", 
            "link": null, 
            "name": "Dedicated route"
        }, 
        {
            "def": "A licensed carrier that holds itself out to hire under either a public tariff for the general public (for-hire common carrier) or under a contract filed with a specific shipper (contract carrier). For-hire carriers must apply for operating authority with the Federal Motor Carrier Safety Administration.[5]", 
            "link": null, 
            "name": "For-hire carrier"
        }, 
        {
            "def": "See over-the-road.", 
            "link": null, 
            "name": "Irregular route"
        }, 
        {
            "def": "\nMain article: Less than truckload\n", 
            "link": null, 
            "name": "Less-than-truckload (LTL)"
        }, 
        {
            "def": "See over-the-road.", 
            "link": null, 
            "name": "Long-haul"
        }, 
        {
            "def": "A person or company providing transportation of property or passengers using commercial motor vehicles.[5]", 
            "link": null, 
            "name": "Motor carrier"
        }, 
        {
            "def": "A driver or carrier who transports cargo to any place at any time, without prescribed schedules or routes. Long-Haul OTR involves being away for weeks, or months at a time, often cross-country or international (Canada and Mexico), given the unscheduled nature of their routes.[27]", 
            "link": null, 
            "name": "Over-the-road (OTR)"
        }, 
        {
            "def": "\nMain article: Owner-operator\n", 
            "link": null, 
            "name": "Owner-operator (O/O)"
        }, 
        {
            "def": "A not-for-hire carrier contracted to or owned by a shipper that does not offer services to the general public, and operates primarily to transport its own goods. Private carriers are not required to obtain operating authority by the Federal Motor Carrier Safety Administration.[5][28]", 
            "link": null, 
            "name": "Private carrier"
        }, 
        {
            "def": "A driver or carrier who transports cargo in a limited geographical area, usually within a certain radius of one's own home or company terminal, and may or may not maintain a schedule.[29]", 
            "link": null, 
            "name": "Regional route"
        }, 
        {
            "def": "See dedicated route.", 
            "link": null, 
            "name": "Regular route"
        }, 
        {
            "def": "A team of two or more drivers who ride together and drive the same truck in shifts, essentially allowing the truck to remain in motion almost constantly. Primarily used for time-sensitive freight.[8]", 
            "link": null, 
            "name": "Team drivers"
        }, 
        {
            "def": "See semi-truck.", 
            "link": null, 
            "name": "Big rig"
        }, 
        {
            "def": "See semi-truck.", 
            "link": null, 
            "name": "Big truck"
        }, 
        {
            "def": "A tractor without a trailer.[8] In verb form, this also refers to operating a truck without a trailer.[30]", 
            "link": null, 
            "name": "Bobtail"
        }, 
        {
            "def": "\nMain article: Cab over\n", 
            "link": null, 
            "name": "Cab over"
        }, 
        {
            "def": "A vehicle composed of two or more separate units, a tractor (powered unit, semi-truck) and a trailer (unpowered unit, semi-trailer).[3]", 
            "link": null, 
            "name": "Combination vehicle"
        }, 
        {
            "def": "\nMain article: Conventional truck\n", 
            "link": null, 
            "name": "Conventional truck"
        }, 
        {
            "def": "A truck cab without a sleeper berth.[31]", 
            "link": null, 
            "name": "Day cab"
        }, 
        {
            "def": "\nMain article: Dump truck\n", 
            "link": null, 
            "name": "Dump truck"
        }, 
        {
            "def": "This term is derived from the number of tires that the typical OTR tractor-trailer configuration has. See also semi-truck.", 
            "link": null, 
            "name": "Eighteen-wheeler"
        }, 
        {
            "def": "\nMain article: Semi-trailer truck\n", 
            "link": null, 
            "name": "Semi-truck"
        }, 
        {
            "def": "A single vehicle, with no articulation. Normally 2 or 3 axles, sometimes with lift axles.", 
            "link": null, 
            "name": "Straight truck"
        }, 
        {
            "def": "See semi-truck.", 
            "link": null, 
            "name": "Tractor-trailer"
        }, 
        {
            "def": "A special truck (carrier) with a permanently mounted crane (upper). This design allows faster moves from site to site than conventional cranes.", 
            "link": null, 
            "name": "Truck crane"
        }, 
        {
            "def": "A partition or separator within a liquid tank, used to inhibit the flow of fluids within the tank. During acceleration, turning, and braking, a large liquid-filled tank may produce unexpected forces on the vehicle due to the inertia of liquids.[3]", 
            "link": null, 
            "name": "Baffle"
        }, 
        {
            "def": "A strong wall-like structure placed at the front of a flatbed trailer (or on the rear of the tractor) used to protect the driver against shifting cargo during a front-end collision. May also refer to any separator within a dry or liquid trailer (also called a baffle for liquid trailers) used to partition the load.[3]", 
            "link": null, 
            "name": "Bulkhead"
        }, 
        {
            "def": "See sleeper berth.", 
            "link": null, 
            "name": "Bunk"
        }, 
        {
            "def": "The interior of a truck where the driver sits to operate the vehicle.", 
            "link": null, 
            "name": "Cab"
        }, 
        {
            "def": "See lift axle.", 
            "link": null, 
            "name": "Cheater axle"
        }, 
        {
            "def": "A pair of tire and wheel assemblies mounted side-by-side on a single axle hub. In some applications it is replaced by a super single. On pickup trucks it is sometimes called a dually. The assembly has a greater load carrying ability as compared to a single wheel. It also provides redundancy so if one of the two tires fail the second will maintain support preventing loss of vehicle control and allowing the vehicle to travel to a repair facility.[32]", 
            "link": null, 
            "name": "Dual wheels"
        }, 
        {
            "def": "\nMain article: Engine brake\n", 
            "link": null, 
            "name": "Engine brake"
        }, 
        {
            "def": "\nMain article: Fifth wheel\n", 
            "link": null, 
            "name": "Fifth wheel"
        }, 
        {
            "def": "\nMain article: Gladhand connector\nInterlocking connectors attached to air hoses that supply air from the tractor to the trailer for air brakes.[10]", 
            "link": null, 
            "name": "Glad hands"
        }, 
        {
            "def": "See bulkhead.", 
            "link": null, 
            "name": "Headache rack"
        }, 
        {
            "def": "\nMain article: Jake brake\n", 
            "link": null, 
            "name": "Jake brake"
        }, 
        {
            "def": "A large pin, underneath the front of a trailer, which interlocks with the fifth wheel.[8]", 
            "link": null, 
            "name": "Kingpin"
        }, 
        {
            "def": "A set of retractable, crank-up legs that support the front of a trailer when it is not connected to a tractor.[8]", 
            "link": null, 
            "name": "Landing gear"
        }, 
        {
            "def": "An air-powered axle that may be raised or lowered to the ground to provide greater load-carrying capacity,[3] or to comply with axle weight requirements (see also Federal Gross Weight Bridge Formula).", 
            "link": null, 
            "name": "Lift axle"
        }, 
        {
            "def": "\nMain article: Retarder (mechanical engineering)\n", 
            "link": null, 
            "name": "Retarder"
        }, 
        {
            "def": "\nMain article: Berth (sleeping)\nThe portion of the truck's interior designated for sleeping, legally must contain a bed.[34]", 
            "link": null, 
            "name": "Sleeper berth"
        }, 
        {
            "def": "A single, larger wheel, substituted for a tandem assembly. The main benefit of a super single is a reduction in weight; combined with lower rolling resistance the super single promises better fuel economy. The disadvantage is the lack of tire redundancy from which tandem wheels benefit, as tire failure can disable the vehicle[32][35] and increased highway wear, through the high point loading and scrubbing of road surfaces when making tight turns[36]", 
            "link": null, 
            "name": "Super single"
        }, 
        {
            "def": "A set of axles spaced close together, legally defined as more than 40 and less than 96 inches apart by the USDOT[37]", 
            "link": null, 
            "name": "Tandem axle"
        }, 
        {
            "def": "A specialized trailer or truck/trailer combination used for transporting passenger vehicles.[38][39]", 
            "link": null, 
            "name": "Auto transport"
        }, 
        {
            "def": "See bottom dump.", 
            "link": null, 
            "name": "Belly dump"
        }, 
        {
            "def": "A trailer between 26 feet (7.9 m) and 29 feet (8.8 m) used primarily for the transport of beverages. Colloquially known as a sidebanger, sideloader, or route trailer.", 
            "link": null, 
            "name": "Beverage trailer"
        }, 
        {
            "def": "A dump with a funnel-shaped floor for unloading through the bottom.[40]", 
            "link": null, 
            "name": "Bottom dump"
        }, 
        {
            "def": "See livestock.", 
            "link": null, 
            "name": "Bull wagon"
        }, 
        {
            "def": "See auto transport.", 
            "link": null, 
            "name": "Car hauler"
        }, 
        {
            "def": "specially designed bulk dry van with open top for wood byproducts.", 
            "link": null, 
            "name": "Chip van"
        }, 
        {
            "def": "\nMain article: Intermodal container\n", 
            "link": null, 
            "name": "Container"
        }, 
        {
            "def": "A skeletal trailer composed of a simple chassis for the mounting of an intermodal container.[38]", 
            "link": null, 
            "name": "Container skeletal carrier"
        }, 
        {
            "def": "A flatbed with specially fitted side plates and curved ribs supporting a tarp covering, commonly referred to as a \"side kit\". Named for the resemblance to horse-drawn covered wagons.[41][42]", 
            "link": null, 
            "name": "Covered wagon"
        }, 
        {
            "def": "Can be either a dry box with tarp sides, or a flatbed with a movable frame of squared ribs supporting a tarp.[43]", 
            "link": null, 
            "name": "Curtainside"
        }, 
        {
            "def": "A specialized dry van that maximizes interior space, with a lowered floor and higher roof. Normally used to transport bulky, relatively light cargo, such as furniture and electronics.[38]", 
            "link": null, 
            "name": "Deep-drop van"
        }, 
        {
            "def": "A specialized trailer with 2 floors to allow for more cargo space.[44]", 
            "link": null, 
            "name": "Double decker"
        }, 
        {
            "def": "A trailer between 26 feet (7.9 m) and 29 feet (8.8 m) long that can be used singularly as a delivery trailer in congested areas or in combination with another trailer for over the road.[10][45]", 
            "link": null, 
            "name": "Doubles trailer"
        }, 
        {
            "def": "A flatbed with a lowered deck, featuring a raised step at the front, where the trailer attaches to the fifth wheel.[38]", 
            "link": null, 
            "name": "Dropdeck"
        }, 
        {
            "def": "A variation of the liquid tank trailer, with a funnel-shaped bottom, used for hauling bulk quantities of dry powder (sometimes called bulk pneumatic). Usually loaded through holes in the top, unloaded through the bottom or through pneumatic force.[10][46]", 
            "link": null, 
            "name": "Dry bulk"
        }, 
        {
            "def": "A simple, enclosed non-climate controlled rectangular trailer that carries general cargo, including food and other products that do not require refrigeration. Usually loaded/unloaded through the rear doors, requiring elevated access for forklifts to enter the trailer.[38]", 
            "link": null, 
            "name": "Dry van"
        }, 
        {
            "def": "A bucket-like trailer with an open top for loading, commonly used for hauling bulk quantities of dirt, rock, gravel, etc. See dump truck.[47][48]", 
            "link": null, 
            "name": "Dump"
        }, 
        {
            "def": "A flat trailer with no enclosure or doors. Can be loaded/unloaded from the sides or above, and does not require elevated access for forklifts.[38][41]", 
            "link": null, 
            "name": "Flatbed"
        }, 
        {
            "def": "\nMain article: Lowboy (trailer)\n", 
            "link": null, 
            "name": "Gooseneck lowboy"
        }, 
        {
            "def": "A rectangular enclosure with an open top for bulk loading, covered with a tarp, and a funnel shaped bottom for unloading grain, fertilizer, etc.[38]", 
            "link": null, 
            "name": "Grain"
        }, 
        {
            "def": "See grain.", 
            "link": null, 
            "name": "Hopper"
        }, 
        {
            "def": "A rectangular enclosure with sides featuring numerous ventilation holes, an interior with multiple levels, and usually a ramp in the rear for loading/unloading. Used for hauling cows, pigs, sheep, etc.[38]", 
            "link": null, 
            "name": "Livestock"
        }, 
        {
            "def": "A dry van with solid or openable roof with a moveable mechanized floor for unloading.", 
            "link": null, 
            "name": "Live-bottom"
        }, 
        {
            "def": "See timber.", 
            "link": null, 
            "name": "Logger"
        }, 
        {
            "def": "See double dropdeck, or gooseneck lowboy.", 
            "link": null, 
            "name": "Lowboy"
        }, 
        {
            "def": "See flatbed.", 
            "link": null, 
            "name": "Platform"
        }, 
        {
            "def": "See auto transport.", 
            "link": null, 
            "name": "Portable parking lot"
        }, 
        {
            "def": "A trailer between 26 feet (7.9 m) and 29 feet (8.8 m) long that can be used singularly as a delivery trailer in congested areas or in combination with another trailer for over the road.[10][45]", 
            "link": null, 
            "name": "Pup"
        }, 
        {
            "def": "A dump with a rear pivot point allowing the front of the cargo area to be raised vertically for unloading through the rear.[51]", 
            "link": null, 
            "name": "Rear dump"
        }, 
        {
            "def": "See refrigerated van.", 
            "link": null, 
            "name": "Reefer"
        }, 
        {
            "def": "A refrigerated and insulated box trailer.[38]", 
            "link": null, 
            "name": "Refrigerated van"
        }, 
        {
            "def": "See covered wagon.", 
            "link": null, 
            "name": "Side kit"
        }, 
        {
            "def": "(aka Sidelifter) A specialized container trailer with cranes on the front and rear to allow for on-the-spot loading and unloading.[52]", 
            "link": null, 
            "name": "Sideloader"
        }, 
        {
            "def": "See flatbed.", 
            "link": null, 
            "name": "Skateboard"
        }, 
        {
            "def": "See dropdeck.", 
            "link": null, 
            "name": "Stepdeck"
        }, 
        {
            "def": "\nMain article: Tank truck\n", 
            "link": null, 
            "name": "Tank"
        }, 
        {
            "def": "See tank.", 
            "link": null, 
            "name": "Tanker"
        }, 
        {
            "def": "A specialized trailer, used for transporting logs, consisting of a basic chassis with vertical stakes along the sides to hold the logs in place.[38] There are several types of timber trailers: Long wood trailers; Usually with four stakes, but can have more, evenly spaced for tree length logs to be carried longwise on the trailer; Short wood trailers, with two separated sets of four of stakes, commonly referred to as a double bunk,[53] and piggyback trailers. These trailers can be self loaded onto the back of a truck[54]", 
            "link": null, 
            "name": "Timber"
        }, 
        {
            "def": "A special set-of-doubles: the second (usually shorter) trailer is hooked directly to the first via a fifth wheel on the rear of the first one (two semis).", 
            "link": null, 
            "name": "'B' train Double"
        }, 
        {
            "def": "A combination of a standard trailer and a shorter pup trailer. Legal in more than 20 states, use is usually restricted to toll roads, freeways, or by permit.[45]", 
            "link": null, 
            "name": "Rocky Mountain Double (occasionally called an 'A' train)"
        }, 
        {
            "def": "A single trailer. Common dimensions range from 45 feet (14 m) to 53 feet (16 m) long, and up to 13.5 feet (4.1 m) tall.[45]", 
            "link": null, 
            "name": "Standard"
        }, 
        {
            "def": "A combination of three pup trailers. Legal in 17 states, usually restricted to major highways, toll roads, or freeways.[45]", 
            "link": null, 
            "name": "Triple"
        }, 
        {
            "def": "A combination of two standard trailers. Legal in 18 states, these unusually long combinations are usually restricted to toll roads or freeways.[45]", 
            "link": null, 
            "name": "Turnpike Double"
        }
    ]
}