{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Glossary_of_broadcasting_terms", 
    "words": [
        {
            "def": "In Australia, the Australian Broadcasting Corporation. In the UK, ABC Weekend TV, a former ITV broadcaster. In the US, American Broadcasting Company, a television and radio network originally spun-off from the NBC network in the 1940s.", 
            "link": null, 
            "name": "ABC"
        }, 
        {
            "def": "Analog-to-digital conversion.", 
            "link": null, 
            "name": "A/D"
        }, 
        {
            "def": "A scheduled event whose start time is determined with an assigned time based upon the facility master clock.", 
            "link": null, 
            "name": "absolute event"
        }, 
        {
            "def": "The total time required to find, retrieve and commence using information, also known as lead time.", 
            "link": null, 
            "name": "access time"
        }, 
        {
            "def": "Listeners who contact the radio show regarding requests, contests or other interaction.", 
            "link": null, 
            "name": "actives"
        }, 
        {
            "def": "Analog-to-digital converter: A device to convert analog signals to digital.", 
            "link": null, 
            "name": "ADC"
        }, 
        {
            "def": "The recorded copy of a broadcast.", 
            "link": "/wiki/Aircheck", 
            "name": "aircheck"
        }, 
        {
            "def": "AM drive time: The morning rush hour slot.", 
            "link": null, 
            "name": "AMD"
        }, 
        {
            "def": "Recording of audio using an electronic signal that varies continuously. The main drawback of analog recording is the introduction of inherent noise to the recorded signal.", 
            "link": "/wiki/Analog_recording", 
            "name": "analog recording"
        }, 
        {
            "def": "The broadcasting of a signal using an analog recording. Examples of use include radio.", 
            "link": "/wiki/Analog_transmission", 
            "name": "analog transmission"
        }, 
        {
            "def": "The company that provides the industry accepted standard for radio audience measurement.", 
            "link": "/wiki/Arbitron", 
            "name": "Arbitron"
        }, 
        {
            "def": "1.  Storage of master material under controlled conditions", 
            "link": "/wiki/Archive", 
            "name": "archive"
        }, 
        {
            "def": "Noticeable loss of video and/or audio fidelity in a broadcast or recording caused by limitations in the technology used. Usually reflects undesirable distortion(s) of the original when digitized.", 
            "link": "/wiki/Artifact_(observational)", 
            "name": "artifact"
        }, 
        {
            "def": "Changing the original aspect ratio of a HD picture through downconversion to either 16:9 letterbox or 4:3 center cut (see Center Cut). Also general term for converting original 4:3 / 14:9 material into 16:9 by zooming in whilst maintaining the aspect ratio, typically to allow the seamless insertion of archive footage into modern 16:9 productions.", 
            "link": null, 
            "name": "Aspect Ratio Conversion"
        }, 
        {
            "def": "Asynchronous serial interface: A streaming data format which often carries an MPEG transport stream (MPEG-TS).", 
            "link": null, 
            "name": "ASI"
        }, 
        {
            "def": "The ratio between the width and the height of the picture. In NTSC television sets, this is 4:3; in widescreen (ATSC) sets, 16:9. Sometimes it is printed decimally as 1.33:1 for 4:3 and 1.78:1 for 16:9.", 
            "link": "/wiki/Aspect_ratio_(image)", 
            "name": "Aspect ratio"
        }, 
        {
            "def": "A synonym for lower thirds, the graphics on the bottom part of a television screen. An on-screen overlaid graphic, usually giving the name of the speaker, reporter or place in frame. Name derived from Aston Broadcast Systems Ltd., an early manufacturer of character generator (CG) equipment.", 
            "link": null, 
            "name": "Aston"
        }, 
        {
            "def": "Audio tape recorder: A method of recording sound by electromagnetic pulses on a sensitised plastic strip.", 
            "link": null, 
            "name": "ATR"
        }, 
        {
            "def": "Advanced Television Systems Committee: A committee established by the FCC to decide the technical standards for digital broadcasting in the US.", 
            "link": "/wiki/Advanced_Television_Systems_Committee", 
            "name": "ATSC"
        }, 
        {
            "def": "Average Quarter Hour: A form of audience measurement used by Arbitron, defined as the number of persons listening to a particular station for at least five minutes during a quarter hour. Typical audience measurements may be in the order of ten thousand for the larger shows. (e.g. Jerry Springer scored 1,600 in the 12+ age group in the spring 2005 figures. Rush Limbaugh scored 16,400 in the same report)", 
            "link": null, 
            "name": "AQH"
        }, 
        {
            "def": "Typically a raw broadcast signal direct from a remote site that is devoid of program graphics or studio segments (see fronthaul)", 
            "link": null, 
            "name": "backhaul"
        }, 
        {
            "def": "The technique where the DJ announces the song title and/or artist of the song that has just played. Also known as \"back announcing\".", 
            "link": null, 
            "name": "backsell"
        }, 
        {
            "def": "Where the DJ calculates the intro time on the song in an attempt to talk over the intro of the song and finish just prior to the vocals commencing. Frequently referred to as 'Hitting the Post' or 'Talking Up the Song' In the case where a piece of music or theme is intended to end at the end of a program, the start of that music is backtimed for its ending to match the end of the program. This music is usually started silently and faded up for the credits.", 
            "link": null, 
            "name": "backtiming"
        }, 
        {
            "def": "The available space between two given points on the electromagnetic spectrum and, inter alia, the amount of information that can be squeezed into that space.", 
            "link": "/wiki/Bandwidth_(signal_processing)", 
            "name": "bandwidth"
        }, 
        {
            "def": "British Broadcasting Corporation: The main public service broadcaster in the United Kingdom, founded as the British Broadcasting Company in 1922.", 
            "link": "/wiki/BBC", 
            "name": "BBC"
        }, 
        {
            "def": "A production element, usually instrumental music or sound effect played in the background of a spoken commercial, promo or other announcement.", 
            "link": null, 
            "name": "bed"
        }, 
        {
            "def": "A constant amplitude high frequency signal added to the recording signal to improve the signal to noise ratio and reduce the distortion of an analog tape recording. It works by overcoming magnetic hysteresis.", 
            "link": null, 
            "name": "bias"
        }, 
        {
            "def": "A short announcement to identify a sponsor at the beginning or end of a production element such as the news or traffic/weather reports.", 
            "link": null, 
            "name": "billboard"
        }, 
        {
            "def": "Burnt-In Time Code: pronounced bit-see. A permanently visible (as opposed to VITC clock counter superimposed over the video pictures, typically showing duration in hours, minutes, seconds and frames.", 
            "link": "/wiki/Burnt-in_timecode", 
            "name": "BITC"
        }, 
        {
            "def": "Black To Air", 
            "link": null, 
            "name": "BTA"
        }, 
        {
            "def": "The Arbitron rating period.", 
            "link": null, 
            "name": "book"
        }, 
        {
            "def": "An animation or logotype briefly shown after the end of a program or part of a program before the advertising. See also \"optical\".", 
            "link": null, 
            "name": "breakbumper"
        }, 
        {
            "def": "An animation shown during the middle of a commercial break to provide relevant graphic information accompanied by backing music, usually only taking up no more than two minutes. On news channels, breakfiller content usually includes news excerpts, weather, stock market indices, current time(s) and/or schedules.", 
            "link": null, 
            "name": "breakfiller"
        }, 
        {
            "def": "Interruptions of regular or planned programming for recently-occurring events as reported by a news organization or agency.", 
            "link": "/wiki/Breaking_news", 
            "name": "breaking news"
        }, 
        {
            "def": "Video used to illustrate a story.", 
            "link": null, 
            "name": "b-roll"
        }, 
        {
            "def": "A DOG (Digital on-screen graphic) permanent on-screen logo. Usually located in the corner of the screen. So-called because it looks like an insect is hanging out in the corner of the screen.", 
            "link": null, 
            "name": "bug"
        }, 
        {
            "def": "An element that acts as a transition to or from commercial breaks", 
            "link": "/wiki/Bumper_(broadcasting)", 
            "name": "bumper"
        }, 
        {
            "def": "A pre-recorded production element containing voice-over and/or music that acts as a transition to or from commercial breaks.", 
            "link": null, 
            "name": "bumper music"
        }, 
        {
            "def": "The official name of the radio station in the USA. Also known as a station's callsign.", 
            "link": null, 
            "name": "call letters"
        }, 
        {
            "def": "Slang for headphones.", 
            "link": null, 
            "name": "cRans"
        }, 
        {
            "def": "Columbia Broadcasting System, an American television and radio network.", 
            "link": null, 
            "name": "CBS"
        }, 
        {
            "def": "Comité consultatif international pour la radio: In English, \"International Radio Consultative Committee\", the organisation responsible for assigning frequencies to radio stations between 1927 and 1992. Now known as ITU-R.", 
            "link": null, 
            "name": "CCIR"
        }, 
        {
            "def": "Text version of a program's dialogue, overlaid on the screen by an equipped television set for the hearing impaired.", 
            "link": "/wiki/Closed_captioning", 
            "name": "closed captioning"
        }, 
        {
            "def": "An excessive number of non-program elements (such as commercials) appearing one after another.", 
            "link": "/wiki/Clutter_(advertising)", 
            "name": "clutter"
        }, 
        {
            "def": "Written material to be read by a DJ or presenter.", 
            "link": "/wiki/Copy_(written)", 
            "name": "copy"
        }, 
        {
            "def": "A bumper which counts down to the beginning of the following broadcast. Also used for the debut of a new channel.", 
            "link": "/wiki/Countdown", 
            "name": "countdown"
        }, 
        {
            "def": "When an announcement, jingle or graphic overlaps with a fixed point in the schedule (e.g. the news or a time signal), usually due to poor timing.", 
            "link": null, 
            "name": "crash"
        }, 
        {
            "def": "The technique where a DJ, producer or engineer fades out the out going track at the same time as fading in the new track.", 
            "link": "/wiki/Crossfade_(audio_engineering)", 
            "name": "crossfade"
        }, 
        {
            "def": "The percentage of households that can tune into a radio station within the theoretical broadcast radius.", 
            "link": null, 
            "name": "coverage"
        }, 
        {
            "def": "Changing scan rates for synchronicity within a broadcast plant. Typically done by converting between 720p, 1080i or 1080p", 
            "link": null, 
            "name": "cross conversion"
        }, 
        {
            "def": "Whilst the previous record was playing the DJ would attempt to find the beginning of the song on the next record. The DJ would place the needle down in approximately the right area then move the record back and forth Cueing on the turntable until the beginning of the song was found. When the previous song completed playing the DJ would introduce the next song and turn the record deck on and the record would quickly whirl up to speed with a characteristic distortion. This was later minimized by the use of a slipmat.", 
            "link": null, 
            "name": "cueing"
        }, 
        {
            "def": "Cue burn relates to the days of vinyl records (33rpm, 45rpm). Whilst the previous record was playing the DJ would attempt to find the beginning of the song on the next record. The DJ would place the needle down in approximately the right area then move the record back and forth Cueing on the turntable until the beginning of the song was found. This cueing back and forth would rub the vinyl and damage the records creating a characteristic noise.", 
            "link": null, 
            "name": "cue burn"
        }, 
        {
            "def": "A small square inserted in the corner of the picture to inform rebroadcasters that an advertisement break is about to happen. In the UK, this appeared exactly one minute before the break and disappeared 55 seconds later.", 
            "link": null, 
            "name": "cue dot"
        }, 
        {
            "def": "In the early days of networks a dedicated multi-drop phone line connected all affiliated station engineers to the network Master Control. The system was backed up with teletype too.", 
            "link": null, 
            "name": "cue channel"
        }, 
        {
            "def": "A recorded audio track containing information about upcoming events that the operating engineer should be aware of. It was first used by Edison on his first talking pictures using records for the sound playback. He used the information to synchronize picture and sound. On early soundtrack records the introduction of a \"beep tone\" was used to tell the projectionist to turn on and off the auditorium speakers so the audience would not hear the projectionist's cue information. Cue tracks were adopted in the early days of Kinascope to cue the film chain engineer and later used in early Ampex Quad Tape systems and is still used today either as voice or digitally for station automation systems. In the early days of bicycled programs cue tracks along with a printed time line was used to inform the engineer of brakes or jam (insert) spots in the tape including a 5 count to the brake in and out locations. Because the program tape or film never stopped. Often the original recording engineer would add comments of his own regarding the program, sometimes humors. When smaller networks that supported independent stations programs, were assembled and the mew track often had the original engineer's voice and the assembling engineer's voice and humor too.", 
            "link": null, 
            "name": "cue track"
        }, 
        {
            "def": "Short for cumulative audience, a similar measurement for a newspaper or magazines' circulation figures.", 
            "link": "/wiki/Cume", 
            "name": "cume"
        }, 
        {
            "def": "Digital Audio Broadcasting: The use of digital encoding to send higher quality or a greater number of radio services to equipped receivers.", 
            "link": null, 
            "name": "DAB"
        }, 
        {
            "def": "Digital-to-analog converter: Equipment that changes digital signals into pictures or sound.", 
            "link": null, 
            "name": "DAC"
        }, 
        {
            "def": "The radio station's broadcast programming day is normally split up (starting at 6am) into a series of 4 hour sessions containing one or more shows. In radio broadcasting, the term is usually used to refer to the practice of pushing certain songs to a later or earlier listening time (such as more adult-oriented content to a later hour).", 
            "link": "/wiki/Dayparting", 
            "name": "dayparting"
        }, 
        {
            "def": "A measure of voltage, current or power gain.", 
            "link": "/wiki/Decibel", 
            "name": "decibel"
        }, 
        {
            "def": "Direct-broadcast satellite: Television and radio programs distributed by satellite for reception via a dish at the receiver's property.", 
            "link": null, 
            "name": "DBS"
        }, 
        {
            "def": "The time on-air where there is no audible transmission. This silence can be down to any of the following:\n\n\n\nDJ, Producer or Engineer error\nEquipment error or failure\nAct of God\nDeliberate silence for remembrance.\n\n\n\n", 
            "link": "/wiki/Dead_air", 
            "name": "dead air"
        }, 
        {
            "def": "Disc Jockey: A radio presenter who links records.", 
            "link": null, 
            "name": "DJ"
        }, 
        {
            "def": "Digital on-screen graphic: A station logo, BUG or slogan permanently displayed on screen during a program. Controversial due to \"screenburn\" issues, found to be distracting, among other reasons.", 
            "link": null, 
            "name": "DOG"
        }, 
        {
            "def": "Also Dolby D. The standard for 5.1 channel (surround sound) audio. Six discrete channels are used (Left, Center, Right, Left Rear Surround, Right Rear Surround, and Subwoofer).", 
            "link": "/wiki/Dolby_Digital", 
            "name": "Dolby Digital"
        }, 
        {
            "def": "Putting out two episodes of a show back-to-back, either to boost ratings in a given slot or to burn off episodes of a cancelled show.", 
            "link": null, 
            "name": "double pumping"
        }, 
        {
            "def": "Drive time refers to the period of time where the majority of radio listeners travel to or from work (i.e. rush hour). This is traditionally 6-10 am and 2-6 pm, and is normally accompanied by radio stations' highest listenership. Commercials are normally more expensive during such times.", 
            "link": null, 
            "name": "drive time"
        }, 
        {
            "def": "Part of a vision mixer used for compositing by removing part of one video signal (the \"key\") and adding in another video signal (the \"fill\").", 
            "link": null, 
            "name": "down-stream keyer"
        }, 
        {
            "def": "Lowering the light levels. \"Drop the light\" is often yelled while shooting when the director wants to continue shooting the action of the scene after the light levels are lowered. It has nothing to do with any physical dropping of a lighting fixture during the scene.", 
            "link": null, 
            "name": "dropping the light"
        }, 
        {
            "def": "These are excerpts of TV, movies and other audio programs that are used to accentuate programming.", 
            "link": null, 
            "name": "drops"
        }, 
        {
            "def": "Temporary unselecting a playlist song to better accommodate an accurate clock hour.(Or in English: a song scheduled but not played for timing reasons.)", 
            "link": null, 
            "name": "drop song"
        }, 
        {
            "def": "Digital Satellite news gathering:Use of digital satellite transmission from remote broadcast locations for the purpose of live television news event coverage.", 
            "link": null, 
            "name": "DSNG"
        }, 
        {
            "def": "Television and radio programs distributed by satellite for reception via a dish at the receiver's property.", 
            "link": "/wiki/Direct_To_Home", 
            "name": "DTH - Direct To Home"
        }, 
        {
            "def": "Digital Video Broadcasting: The MPEG-2 based standard of digital transmission and reception. Comes in variants according to the type of broadcast, e.g. DVB-T for terrestrial.", 
            "link": null, 
            "name": "DVB"
        }, 
        {
            "def": "The scrambling of a signal to allow reception via a decoder only be specific viewers, e.g. after the payment of a fee.", 
            "link": "/wiki/Encryption", 
            "name": "encryption"
        }, 
        {
            "def": "See pot.", 
            "link": null, 
            "name": "fader"
        }, 
        {
            "def": "A loud noise produced when the amplified sound from an output ( loudspeaker ) is picked up by an input ( microphone, phonograph ) feeding that loudspeaker. This can be potentially damaging to both the speaker(s) in question, as well as the hearing of the subjected listener. This may also occur when an input is directly patched into an output of the same device, usually due to operator error.\nIn radio broadcasting, feedback may occur when a DJ increases his or her headphone volume to a high enough level that the microphone is able to pick up the sound coming from the headphones, usually when the DJ's head is turned to one side.", 
            "link": "/wiki/Audio_feedback", 
            "name": "feedback"
        }, 
        {
            "def": "Federal Communications Commission: The regulator of broadcasting in the United States.", 
            "link": null, 
            "name": "FCC"
        }, 
        {
            "def": "A format clock is a diagram produced by a program director or a producer to illustrate where each programming element appears in a typical hour.", 
            "link": null, 
            "name": "format clock"
        }, 
        {
            "def": "The number of times the television is refreshed in a second of time. As a rule of thumb, this is the same as the local Alternating Current electricity supply - 60 Hz or 50 Hz.", 
            "link": null, 
            "name": "frames per second"
        }, 
        {
            "def": "A technology to synchronize and change frame rates between two formats (ie: film to video, PAL to NTSC, 50 Hz. to 60Hz. etc..)", 
            "link": null, 
            "name": "FRC"
        }, 
        {
            "def": "A broadcast video feed that is complete with graphics, commercials, interstitials and studio integration. This typically originates from a Master Control Room and is delivered to a distributor or over-the-air (also see backhaul)", 
            "link": null, 
            "name": "fronthaul"
        }, 
        {
            "def": "The act of introducing a song about to be played.", 
            "link": null, 
            "name": "front sell"
        }, 
        {
            "def": "A change in signal level, usually expressed in decibels.", 
            "link": null, 
            "name": "gain"
        }, 
        {
            "def": "Also known as the production control room or the studio control room. Where the composition of the outgoing program takes place.", 
            "link": null, 
            "name": "gallery"
        }, 
        {
            "def": "Distributing a reference signal to multiple video devices in order to make them operate at the same frequency.", 
            "link": "/w/index.php?title=Gen-lock&action=edit&redlink=1", 
            "name": "gen-lock"
        }, 
        {
            "def": "Gigahertz: Thousand million cycles per second. The measurement for satellite frequencies.", 
            "link": null, 
            "name": "GHz"
        }, 
        {
            "def": "Placing a new or poorly-performing program between two established popular programs in order to boost viewing figures.", 
            "link": null, 
            "name": "hammocking"
        }, 
        {
            "def": "High-definition television: Broadcasting using a line standard of 720 or greater. Prior to World War II, high definition meant a line standard greater than 240 lines.", 
            "link": null, 
            "name": "HDTV"
        }, 
        {
            "def": "A DJ talking right up to the point where the vocals of a song commence hits the post.", 
            "link": null, 
            "name": "hit the post"
        }, 
        {
            "def": "A station's symbol or logo, often accompanied by music, a jingle or an animation.", 
            "link": "/wiki/Television_ident", 
            "name": "ident"
        }, 
        {
            "def": "A short audio clip played frequently on a radio station between songs and ads to identify the station that is being aired. I.E the stations call letters or positioning statement.", 
            "link": null, 
            "name": "image liner"
        }, 
        {
            "def": "International Telecommunication Union: Originally the International Telegraph Union, the ITU is the international organization established in 1865 to standardize and regulate international radio and telecommunications.", 
            "link": null, 
            "name": "ITU"
        }, 
        {
            "def": "Systems that allow viewers to interact (e.g. play games, shop for related items or find further information) either two-way, via a telephone line, or one-way, via MHEG graphics.", 
            "link": null, 
            "name": "interactive television"
        }, 
        {
            "def": "Independent Television: The UK's first commercial television network.", 
            "link": "/wiki/ITV_(TV_network)", 
            "name": "ITV"
        }, 
        {
            "def": "A produced programming element usually in the form of vocals to accompanying music often produced in-house to identify the show, DJ or the station.", 
            "link": "/wiki/Jingle", 
            "name": "jingle"
        }, 
        {
            "def": "Thousand cycles per second. kHz is used to measure mediumwave and often shortwave frequencies.", 
            "link": null, 
            "name": "kilohertz"
        }, 
        {
            "def": "In the US, the station identification consisting of the station call letters followed by the community of license. Given as close as practical to the top of the hour at a natural break in program offerings.", 
            "link": null, 
            "name": "legal ID"
        }, 
        {
            "def": "The appearance of black bars at the top and bottom of a picture when 16:9 or 14:9 widescreen material is shown on 4:3 sets. See also pillar box and postage stamp.", 
            "link": "/wiki/Letterboxing_(filming)", 
            "name": "letterbox"
        }, 
        {
            "def": "A piece of written text that the DJ says over the intro of a song or between spots and songs. Liners are designed to invoke the imagination.", 
            "link": null, 
            "name": "liner"
        }, 
        {
            "def": "The number of lines broadcast to make up a television picture. Generally, 525 in NTSC areas and 625 elsewhere.", 
            "link": null, 
            "name": "line standard"
        }, 
        {
            "def": "Any programming which is broadcast immediately as it is being delivered (a live report); performed (a live concert or show); or captured (live news or sports coverage). Requires an unbroken communications chain without any intervening recording or storage technology. Considered the most exciting form of broadcasting, delivered “as it happens”.", 
            "link": null, 
            "name": "live"
        }, 
        {
            "def": "A recorded program produced in real time, usually with a studio audience, for later broadcast. Requires precisely timed pauses for insertion of station breaks and commercials at time of broadcast. Typically employed for network broadcast across multiple time zones. Also applies to live broadcasting which is simultaneously recorded for rebroadcast at a later time or date.", 
            "link": null, 
            "name": "live-to-tape"
        }, 
        {
            "def": "A newly introduced audio measurement tool that measure loudness, K-weighted, relative to Full Scale (or LKFS) is a loudness standard designed to enable normalization of audio levels for delivery of broadcast TV and other video. It typically is measured over time and not as immediate peak readings. LKFS is standardized in ITU-R BS.1770.", 
            "link": null, 
            "name": "LKFS"
        }, 
        {
            "def": "A written record of broadcasting. There are typically three logs:\n\nA Music Log recording what songs were played.\nAn Engineer's Log detailing technical production settings.\nA Commercial Log recording which commercials were played during the day.\n\n\nSee also PASB.\n\n", 
            "link": null, 
            "name": "log"
        }, 
        {
            "def": "Portion of screen of regular broadcast reserved for textual and static visual content; i.e., news ticker, time, title of segment, title of program, channel bug, etc. Upper third has sometimes been used alongside lower third, as in the case of MSNBC since 2010.", 
            "link": "/wiki/Lower_third", 
            "name": "lower third"
        }, 
        {
            "def": "A trademarked system designed to prevent unauthorized copying of video material.", 
            "link": "/wiki/Macrovision", 
            "name": "Macrovision"
        }, 
        {
            "def": "A signal generator that outputs timecode and reference video for genlocking. May output word clock as well.", 
            "link": null, 
            "name": "master clock"
        }, 
        {
            "def": "Million cycles per second. The bandwidth area for FM broadcasts and television.", 
            "link": null, 
            "name": "MHz"
        }, 
        {
            "def": "A mistake by the DJ or production engineer resulting in two audio elements being played at the same time, e.g. an interview and the next song.", 
            "link": null, 
            "name": "miscue"
        }, 
        {
            "def": "Video only with natural sound: (Television news) Video with natural sound played at full volume intended to accompanied by a news correspondent reading a news story.", 
            "link": null, 
            "name": "nat/VO"
        }, 
        {
            "def": "National Broadcasting Company: A television network in the United States. Formerly also a radio network.", 
            "link": null, 
            "name": "NBC"
        }, 
        {
            "def": "A system which distributes programming to multiple stations simultaneously, or slightly delayed, for the purpose of extending total broadcast coverage beyond the limits of a single radio or television signal.", 
            "link": "/wiki/Television_network", 
            "name": "network"
        }, 
        {
            "def": "An early term used in remote broadcast operations. It was often used to refer to the remote lines that fed live programming from dance halls, ballrooms, clubs and sporting events to the station's master control.", 
            "link": null, 
            "name": "Not Emanating Main Office"
        }, 
        {
            "def": "scrolling ticker at the bottom of the display of television content. It is usually reserved for text headlines or numeric statistics (or both) depending upon the focus of the channel.", 
            "link": null, 
            "name": "news crawl"
        }, 
        {
            "def": "Survey of US viewers by the AC Nielsen Company to establish the audiences for individual programs and their demographics.", 
            "link": "/wiki/Nielsen_ratings", 
            "name": "Nielsen ratings"
        }, 
        {
            "def": "National Television System Committee: An American committee formed to set the line standard and later color standard for broadcasting. Gave its name to the method of color reproduction used in the Americas (except Brazil) and in Japan.", 
            "link": "/wiki/NTSC", 
            "name": "NTSC"
        }, 
        {
            "def": "The regulator of broadcasting and communications in the United Kingdom.", 
            "link": null, 
            "name": "Office of Communications"
        }, 
        {
            "def": "Generically, any on-screen graphic. Specifically, a graphic inserted between a program and an advertisement or between individual advertisements.", 
            "link": null, 
            "name": "optical"
        }, 
        {
            "def": "A stage instruction noting that a character is not seen when speaking. Also, in continuity announcing, the practice of speaking over a caption rather than appearing on screen.", 
            "link": null, 
            "name": "Out Of Vision"
        }, 
        {
            "def": "Outside Broadcast. A complete event or programme, or a brief news report, produced and fed back live from the location by an OB vehicle to the broadcaster.", 
            "link": null, 
            "name": "OB"
        }, 
        {
            "def": "Phase Alternating Line: Television broadcast system used in Europe and Australia & New Zealand, also parts of Asia, Africa and South America.", 
            "link": "/wiki/PAL", 
            "name": "PAL"
        }, 
        {
            "def": "Program As Broadcast: A BBC term for a (supposedly contemporaneous) log of a channel's output - also a video (or film) recording of an individual live program.", 
            "link": "/wiki/Lower_third#Terminology", 
            "name": "PASB"
        }, 
        {
            "def": "Reception of a scrambled film or sporting event after the payment of a one-off fee for that broadcast.", 
            "link": "/wiki/Pay-per-view", 
            "name": "pay-per-view"
        }, 
        {
            "def": "The erroneous effect of pink and green flashing on a video signal usually caused by a disturbance to the SDI input/output of broadcast equipment.", 
            "link": null, 
            "name": "Pink and Green Flashing"
        }, 
        {
            "def": "A government-produced commercial, usually shown for free, giving safety information or advice.", 
            "link": null, 
            "name": "PIF"
        }, 
        {
            "def": "The appearance of blank bars on either side of the picture when 4:3 material is shown on a 16:9 widescreen television set.", 
            "link": "/wiki/Pillar_box_(film)", 
            "name": "pillarbox"
        }, 
        {
            "def": "A one-off episode of a proposed series, usually in extended form, to gauge audience reaction. If successful, the rest of the series is made and the pilot becomes the first episode.", 
            "link": null, 
            "name": "pilot"
        }, 
        {
            "def": "Slang term for the time signal broadcast by some radio stations at the top of the hour.", 
            "link": null, 
            "name": "pips"
        }, 
        {
            "def": "The official songs that a radio station will play during a given week. The playlist is not usually chosen by the DJ.", 
            "link": "/wiki/Playlist", 
            "name": "playlist"
        }, 
        {
            "def": "The transmission of radio or TV channels from the broadcaster into broadcast networks that deliver content to the audience.", 
            "link": "/wiki/Playout", 
            "name": "playout"
        }, 
        {
            "def": "PM drive time: The evening rush hour slot.", 
            "link": null, 
            "name": "PMD"
        }, 
        {
            "def": "A radio station's mission statement or vision statement. A one to two sentence statement that conveys what you do for whom, to uniquely solve an urgent need. These are usually aired during Image Liners.", 
            "link": null, 
            "name": "positioning statement"
        }, 
        {
            "def": "The appearance of a black border all around the picture, usually in error, when 4:3 material is converted to 16:9 and then back to 4:3 before broadcast.", 
            "link": null, 
            "name": "postage stamp"
        }, 
        {
            "def": "Potentiometer: A control for attenuating the level of a signal. Also used as a verb, as in \"pot up\" (increase volume, typically but not always from nothing) or \"pot down\" (lower volume, sometimes to nothing).", 
            "link": null, 
            "name": "pot"
        }, 
        {
            "def": "A Production Element is a piece of audio that is used in the final audio mix. This may include commercials, music, sound effects, audio effects (e.g. echo) station id or program signatures or announcements.", 
            "link": null, 
            "name": "production element"
        }, 
        {
            "def": "The person who performs or manages the day to day business operations of a station. Also the person responsible for an individual program - a radio producer or a television producer.", 
            "link": null, 
            "name": "producer"
        }, 
        {
            "def": "An announcement (either recorded or live) used to promote the station's image or other event.", 
            "link": "/wiki/Promo_(media)", 
            "name": "promo"
        }, 
        {
            "def": "A PSA is intended to change the public interest, by raising awareness of an issue, affecting public attitudes, and potentially stimulating action.", 
            "link": "/wiki/Public_service_announcement", 
            "name": "public service announcement"
        }, 
        {
            "def": "Sound reproduction utilizing four speakers. Now superseded by Dolby 5.1 Surround Sound.", 
            "link": "/wiki/Quadraphonic", 
            "name": "quadraphonic"
        }, 
        {
            "def": "Control panel where several television cameras are matched together by operator(s) for exposure, colour balance and black level.", 
            "link": null, 
            "name": "racks"
        }, 
        {
            "def": "An intro to a piece of music.", 
            "link": null, 
            "name": "ramp"
        }, 
        {
            "def": "A story read by a presenter entirely on-camera (as opposed to a voice-over).", 
            "link": null, 
            "name": "reader"
        }, 
        {
            "def": "A timed outline of a program.", 
            "link": null, 
            "name": "rundown"
        }, 
        {
            "def": "British term for the broadcast of the same program from multiple transmitters.", 
            "link": "/wiki/Simulcast", 
            "name": "simulcast"
        }, 
        {
            "def": "Where a permanent mark is burnt into the mask of the TV screen due to prolonged display. Common with sets tuned to one channel for promotional purposes or on ordinary sets from DOGs inserted by broadcasters. Also known as Phosphor burn-in.", 
            "link": "/wiki/Screen_burn-in", 
            "name": "screenburn"
        }, 
        {
            "def": "American satellite radio platform.", 
            "link": "/wiki/Sirius_Satellite_Radio", 
            "name": "Sirius Satellite Radio"
        }, 
        {
            "def": "When a broadcaster joins another feed typically produced by a third-party supplier outside their facility either live or in a prerecorded format. For example, a press conference or event that is simultaneously joined by various non-related broadcasters.", 
            "link": null, 
            "name": "simulcast"
        }, 
        {
            "def": "A slipmat was a mat that was placed on a record deck between the deck and the record. Normally made by the DJ, it was cut significantly oversized when compared to a vinyl record. The DJ would cue the record to the beginning of a song and then holding onto the mat would turn the turntable on whilst the record stayed at the beginning of the song. The DJ could then introduce the record and then release the mat onto the already spinning deck thus reducing the spin up speed to 33 or 45 rpm. The effect was to reduce the whirl effect produced by the turning on of the turntable.", 
            "link": "/wiki/Slipmat", 
            "name": "slipmat"
        }, 
        {
            "def": "A small portion (usually one or two sentences) of an audio recording (often an interview) used to illustrate a news story in the words of the interviewee (c.f. a quotation from a politician).", 
            "link": "/wiki/Soundbite", 
            "name": "soundbite"
        }, 
        {
            "def": "In the United States, the practice of a company funding the making of a program in order to entertain an audience and sell a product. In the UK, an advertisement inserted between the end-of-part caption and the breakbumper.", 
            "link": "/wiki/Sponsor_(commercial)", 
            "name": "sponsorship"
        }, 
        {
            "def": "A radio, television commercial or underwriting spot", 
            "link": "/wiki/Advertising", 
            "name": "spot"
        }, 
        {
            "def": "A commercial or commercials run in the middle of or between programs, sold separately from the program (as opposed to sponsors' messages).", 
            "link": null, 
            "name": "spot advertising"
        }, 
        {
            "def": "The place where commercials are played during a typical broadcast hour. There may be several scattered throughout a typical 60 minute period. Stop set length can vary much between local stations and even network programming.", 
            "link": null, 
            "name": "stop set"
        }, 
        {
            "def": "a visual and/or musical punctuation that signals a break between two sections of a program.", 
            "link": null, 
            "name": "sting"
        }, 
        {
            "def": "Text version of a program's dialogue, overlaid on the screen either at broadcast or at reception (often via Teletext or Closed Captioning) for the hearing impaired or for when a speaker is unclear or speaking in a foreign language.", 
            "link": "/wiki/Subtitle_(captioning)", 
            "name": "subtitles"
        }, 
        {
            "def": "A period, usually in February, May, July and November, where the ACNielsen Company undertakes audience measurement to record the Nielsen ratings of all shows in all markets with all demographics. This allows networks and local stations to spot surprise hits and unexpected failures. It is also a time when a successful network will try pilot episodes of new shows, whilst a failing network will often put existing successful programs in place of poorly performing shows to boost average ratings.", 
            "link": "/wiki/Sweeps", 
            "name": "sweeps"
        }, 
        {
            "def": "An interview conducted by phone and recorded in both locations, with the two recordings to be mixed later.", 
            "link": null, 
            "name": "tape sync"
        }, 
        {
            "def": "A part of a program played before the title sequence, usually featuring a cliffhanger or prefiguring the plot of the episode to follow.", 
            "link": "/wiki/Cold_open", 
            "name": "cold open"
        }, 
        {
            "def": "Electronic information inserted into the unused parts of a television signal and decodable by an equipped television set.", 
            "link": "/wiki/Teletext", 
            "name": "teletext"
        }, 
        {
            "def": "The appearance of large non-congruent blocks on a video display when a digitally generated broadcast (i.e., image) was received by the monitor in an incomplete form. Tiling also occurs when the video signal has degraded or been partially interrupted as it was received by the monitor.", 
            "link": null, 
            "name": "tiling"
        }, 
        {
            "def": "A physical part of a satellite that broadcasts the signal. In colloquial use, the satellite equivalent of the \"channel\" a television station is broadcast on (e.g. \"broadcasting from Transponder 2C of the satellite\").", 
            "link": "/wiki/Transponder", 
            "name": "transponder"
        }, 
        {
            "def": "Ultra high frequency - Frequencies between 300 MHz (wavelength 1 meter) and 3.0 GHz (wavelength 10 centimeters), used for television broadcasting.", 
            "link": null, 
            "name": "UHF"
        }, 
        {
            "def": "Typically used to increase scan lines on SD video so content can be viewed or processed in a higher resolution environment. Quality is not improved, but scan lines are added to permit a suitable viewing experience in a higher resolution environment.", 
            "link": null, 
            "name": "upconversion"
        }, 
        {
            "def": "The blank area out of sight at the top and bottom of a television picture that allows the raster gun to reset. The space created is often used for Teletext and other services.", 
            "link": "/wiki/Vertical_blanking_interval", 
            "name": "vertical blanking interval"
        }, 
        {
            "def": "Very high frequency - Frequencies from 30 MHz (wavelength 10 m) to 300 MHz (wavelength 1 m), used for radio and television broadcasting.", 
            "link": null, 
            "name": "VHF"
        }, 
        {
            "def": "The television version of a Disc Jockey.", 
            "link": null, 
            "name": "video jockey"
        }, 
        {
            "def": "Vertical Interval Time Code: pronounced vit-see. A non-visible (as opposed to BITC) timecode integrated within the video signal, readable by editing and playback equipment to ensure synchronisation.", 
            "link": "/wiki/Vertical_interval_timecode", 
            "name": "VITC"
        }, 
        {
            "def": "1.  Recorded voice announcer played as off-screen narration in drama or advertising.", 
            "link": "/wiki/Voice_over", 
            "name": "voice over"
        }, 
        {
            "def": "A method of recording television pictures by electromagnetic pulses on a sensitised plastic strip.", 
            "link": "/wiki/Video_tape_recorder", 
            "name": "video tape recorder"
        }, 
        {
            "def": "The regular meetings of the CCIR (now ITU-R) to allocate radio frequency spectrum.", 
            "link": "/wiki/World_Administrative_Radio_Conference", 
            "name": "World Administrative Radio Conference"
        }, 
        {
            "def": "A large carpeted wedge used to display items for shooting.", 
            "link": null, 
            "name": "Wendy"
        }, 
        {
            "def": "A common practice of displaying a company's logo during a television broadcast, typically a translucent image in the right hand bottom corner. (See also Bug and DOG)", 
            "link": "/wiki/Digital_watermarking", 
            "name": "watermark"
        }, 
        {
            "def": "See format clock.", 
            "link": null, 
            "name": "wheel"
        }, 
        {
            "def": "An American satellite radio platform.", 
            "link": "/wiki/XM_Satellite_Radio", 
            "name": "XM Satellite Radio"
        }, 
        {
            "def": "Luminance in many color models used for television broadcast, such as YIQ and YUV.", 
            "link": null, 
            "name": "Y"
        }, 
        {
            "def": "To go from a long shot to a close-up (or vice versa) with the camera. In the UK, the name given by Associated TeleVision to their idents.", 
            "link": null, 
            "name": "zoom"
        }
    ]
}