{
    "c1": "Culture and the arts", 
    "c2": "Arts", 
    "c3": "Heideggerian_terminology", 
    "words": [
        {
            "def": "Heidegger's idea of aletheia, or disclosure (Erschlossenheit), was an attempt to make sense of how things in the world appear to human beings as part of an opening in intelligibility, as \"unclosedness\" or \"unconcealedness\". (This is Heidegger's usual reading of aletheia as Unverborgenheit, \"unconcealment.\")[3] It is closely related to the notion of world disclosure, the way in which things get their sense as part of a holistically structured, pre-interpreted background of meaning. Initially, Heidegger wanted aletheia to stand for a re-interpreted definition of truth. However, he later corrected the association of aletheia with truth (see main article on aletheia for more information).", 
            "link": null, 
            "name": "Aletheia"
        }, 
        {
            "def": "An assertion (as opposed to a question, a doubt or a more expressive sense) is apophantic. It is a statement that covers up meaning and just gives us something as present-at-hand. For Instance, \"The President is on vacation\", and, \"Salt is Sodium Chloride\" are sentences that, because of their apophantic character, can easily be picked-up and repeated in news and gossip by 'The They.' However, the real ready-to-hand meaning and context may be lost.", 
            "link": null, 
            "name": "Apophantic"
        }, 
        {
            "def": "Being-in-the-world is Heidegger's replacement for terms such as subject, object, consciousness, and world. For him, the split of things into subject/object, as we find in the Western tradition and even in our language, must be overcome, as is indicated by the root structure of Husserl and Brentano's concept of intentionality, i.e., that all consciousness is consciousness of something, that there is no consciousness, as such, cut off from an object (be it the matter of a thought or of a perception). Nor are there objects without some consciousness beholding or being involved with them.", 
            "link": null, 
            "name": "Being-in-the-world"
        }, 
        {
            "def": "Being-toward-death is not an orientation that brings Dasein closer to its end, in terms of clinical death, but is rather a way of being.[4] Heideggerian terminology refers to a process of growing through the world where a certain foresight guides the Dasein towards gaining an authentic perspective. It is provided by dread or death. In the analysis of time, it is revealed as a threefold condition of Being. Time, the present and the notion of the \"eternal\", are modes of temporality. Temporality is the way we see time. For Heidegger, it is very different from the mistaken view of time as being a linear series of past, present and future. Instead he sees it as being an ecstasy, an outside-of-itself, of futural projections (possibilities) and one's place in history as a part of one's generation. Possibilities, then, are integral to our understanding of time; our projects, or thrown projection in-the-world, are what absorb and direct us. Futurity, as a direction toward the future that always contains the past—the has-been—is a primary mode of Dasein's temporality.", 
            "link": null, 
            "name": "Being-toward-death"
        }, 
        {
            "def": "The term \"Being-with\" refers to an ontological characteristic of the human being, that it is always already[8] with others of its kind. This assertion is to be understood not as a factual statement about an individual, that he or she is at the moment in spatial proximity to one or more other individuals. Rather it is a statement about the being of every human, that in the structures of its being-in-the-world one finds an implicit reference to other humans. We all live with others, and in fact we could not live without them. Humans have been called (by others, not by Heidegger) \"ultrasocial\"[9] and \"obligatorily gregarious.\"[10] Without others of our kind we could not survive. Heidegger, from his phenomenological perspective, calls this feature of human life \"Being-with\" (Mitsein), and says it is essential to being human.[11] We are inauthentic when we fail to recognize how much and in what ways how we think of ourselves and how we habitually behave is influenced by our social surroundings. We are authentic when we pay attention to that influence and decide for ourselves whether to go along with it or not. Living entirely without such influence, however, is not an option.", 
            "link": null, 
            "name": "Being-with"
        }, 
        {
            "def": "Here is Martin Heidegger on philosophy as the task of destroying ontological concepts, in other words also including, ordinary everyday meanings of words like time, history, being, theory, death, mind, body, matter, logic etc.:", 
            "link": null, 
            "name": "Destruktion"
        }, 
        {
            "def": "Dasein is a German word and is sometimes translated as \"being-there\" or \"being-here\" (da combines in its meaning \"here\" and \"there\", excluding the spatial-relational distinction made by the English words; Sein is the infinitive, \"to be\"). It is the German form of the existential expletive, which, as in most European languages, is expressed idiomatically. Heidegger, after Nietzsche, used the word, but as a gerund synonym for \"human being\" or \"human entity.\" A Dasein is then a new coinage for a being that is there, in a familiar world, and in a mood. Dasein also has unique capacities for language, intersubjective communication, and detached reasoning. Heidegger does not want to get tied up with overused and ambiguous words such as \"person,\" \"consciousness,\" \"soul,\" or \"spirit,\" so Dasein is a new way of approaching something all of those other words point towards, but without the connotations. Dasein is the starting point of Heidegger's ontology. It is typically thought to apply to humans, but it could apply to any being that fulfills the definition's characteristics which he states. What makes a being a Dasein is as follows: Dasein is a being whose being is an issue for itself; every Dasein has an a priori sense of \"mineness,\" or being one's self; Dasein is always thrown into the world, meaning it finds itself within a world, meaning no Dasein has ever been decontextualized. We are all world-bound, submerged, entangled, and engaged with our ontico-ontological surroundings through care, concern, and moods. Dasein has various modes of being-in-the-world, which are the subject of much of Heidegger's analysis in Being and Time. Furthermore, average humans have a pre-ontological (general intuitive sense of being) understanding of being insofar as they understand what things are and that they are e.g. \"My dog is brown\" or \"Today is Sunday.\" Heidegger believed that this pre-reflective understanding of being, that which determines entities as entities,[16] helps constitute our unique existence as human beings, thus the coinage of \"Dasein.\"", 
            "link": null, 
            "name": "Dasein"
        }, 
        {
            "def": "Hubert Dreyfus and Charles Spinosa write that: \"According to Heidegger our nature is to be world disclosers. That is, by means of our equipment and coordinated practices we human beings open coherent, distinct contexts or worlds in which we perceive, feel, act, and think.\"[17]", 
            "link": null, 
            "name": "Disclosure, or \"world disclosure\""
        }, 
        {
            "def": "Ereignis is translated often as \"an event,\" but is better understood in terms of something \"coming into view.\" It comes from the German prefix, er-, comparable to 're-' in English, and Auge, eye.[20][21] It is a noun coming from a reflexive verb. Note that the German prefix er- also can connote an end or a fatality. A recent translation of the word by Kenneth Maly and Parvis Emad renders the word as \"enowning\"; that in connection with things that arise and appear, that they are arising 'into their own'. Hubert Dreyfus defined the term as \"things coming into themselves by belonging together.\"", 
            "link": null, 
            "name": "Ereignis"
        }, 
        {
            "def": "Heidegger uses this word to describe the nature of Dasein's being. Beings unlike Dasein (chairs, shoes, etc.) do not \"exist\"; they are merely \"objectively present\". Dasein exists; chairs are objectively present.", 
            "link": null, 
            "name": "Existence"
        }, 
        {
            "def": "Often translated as \"releasement,\"[23] Heidegger's concept of Gelassenheit has been explained as \"the spirit of disponibilité [availability] before What-Is which permits us simply to let things be in whatever may be their uncertainty and their mystery.\"[24] Heidegger elaborated the idea of Gelassenheit in 1959, with a homonymous volume which includes two texts: a 1955 talk entitled simply Gelassenheit,[25] and a 'conversation' (Gespräch) entitled Zur Erörterung der Gelassenheit. Aus einem Feldweggespräch über das Denken[26] (\"Towards an Explication of Gelassenheit: From a Conversation on a Country Path about Thinking\"[27] or \"Toward an Emplacing Discussion [Erörterung] of Releasement [Gelassenheit]: From a Country Path Conversation about Thinking\").[28] An English translation of this text was published in 1966 as \"Conversation on a Country Path about Thinking\".[28][29] He borrowed the term from the Christian mystical tradition, proximately from Meister Eckhart.[27][30][31]", 
            "link": null, 
            "name": "Gelassenheit"
        }, 
        {
            "def": "Geworfenheit describes our individual existences as \"being thrown\" (geworfen) into the world. For William J. Richardson, Heidegger used this single term, \"thrown-ness,\" to \"describe [the] two elements of the original situation, There-being's non-mastery of its own origin and its referential dependence on other beings\".[32]", 
            "link": null, 
            "name": "Geworfenheit"
        }, 
        {
            "def": "Heidegger's later works, beginning by 1930 and largely established by the early 1940s,[33] seem to many commentators (e.g. William J. Richardson)[34] to at least reflect a shift of focus, if not indeed a major change in his philosophical thinking which is known as \"the turn\" (die Kehre).[35] One way this has been understood is as a shift from \"doing\" to \"dwelling\" and from Being and Time to Time and Being.[33][36][37] However, others feel that this is to overstate the difference. Heidegger himself held between 1 and 4 December 1949 at Bremen Club four lectures, which were repeated in the spring of 1950 (25 and 26 March) unchanged at Bühlerhöhe. The titles were Das Ding, Das Gestell, Die Gefahr and Die Kehre. The third lecture is still unpublished, while the other three lectures again unchanged were collected in a book entitled Die Technik und die Kehre and published in 1962.[38] According to different sources, Die Technik und die Kehre includes the two lectures Die Frage nach der Technik and Die Kehre.[39]", 
            "link": null, 
            "name": "Kehre"
        }, 
        {
            "def": "Heidegger uses the term ontic, often in contrast to the term ontological, when he gives descriptive characteristics of a particular thing and the \"plain facts\" of its existence. What is ontic is what makes something what it is.", 
            "link": null, 
            "name": "Ontic"
        }, 
        {
            "def": "As opposed to \"ontic\" (ontisch), ontological is used when the nature, or meaningful structure of existence is at issue. Ontology, a discipline of philosophy, focuses on the formal study of Being. Thus, something that is ontological is concerned with understanding and investigating Being, the ground of Being, or the concept of Being itself.", 
            "link": null, 
            "name": "Ontological"
        }, 
        {
            "def": "A term used only once in a particular edition of Being and Time. In the text, the term appears to denote \"the possibility whose probability it is solely to be possible\". At least, if it were used in context, this is the only plausible definition.", 
            "link": null, 
            "name": "Possibility"
        }, 
        {
            "def": "With the present-at-hand one has (in contrast to \"ready-to-hand\") an attitude like that of a scientist or theorist, of merely looking at or observing something. In seeing an entity as present-at-hand, the beholder is concerned only with the bare facts of a thing or a concept, as they are present and in order to theorize about it. This way of seeing is disinterested in the concern it may hold for Dasein, its history or usefulness. This attitude is often described as existing in neutral space without any particular mood or subjectivity. However, for Heidegger, it is not completely disinterested or neutral. It has a mood, and is part of the metaphysics of presence that tends to level all things down. Through his writings, Heidegger sets out to accomplish the Destruktion (see above) of this metaphysics of presence.", 
            "link": null, 
            "name": "Present-at-hand"
        }, 
        {
            "def": "However, in almost all cases we are involved in the world in an ordinary, and more involved, way. We are usually doing things with a view to achieving something. Take for example, a hammer: it is ready-to-hand; we use it without theorizing. In fact, if we were to look at it as present-at-hand, we might easily make a mistake. Only when it breaks or something goes wrong might we see the hammer as present-at-hand, just lying there. Even then however, it may be not fully present-at-hand, as it is now showing itself as something to be repaired or disposed, and therefore a part of the totality of our involvements. In this case its Being may be seen as unreadiness-to-hand. Heidegger outlines three manners of unreadiness-to-hand: Conspicuous (damaged; e.g., a lamp's wiring has broken), Obtrusive (a part is missing which is required for the entity to function; e.g., we find the bulb is missing), Obstinate (when the entity is a hindrance to us in pursuing a project; e.g., the lamp blocks my view of the computer screen).", 
            "link": null, 
            "name": "Ready-to-hand"
        }, 
        {
            "def": "Resoluteness refers to one's ability to \"unclose\" one's framework of intelligibility (i.e., to make sense of one's words and actions in terms of one's life as a whole), and the ability to be receptive to the \"call of conscience.\"", 
            "link": null, 
            "name": "Resoluteness"
        }, 
        {
            "def": "Heidegger gives us four ways of using the term world:", 
            "link": null, 
            "name": "World"
        }
    ]
}